let citylist = [{
        "p_name": "北京市",
        "p_code": "110000",
        "s": [{
            "s_name": "市辖区",
            "c": [{
                    "c_code": "110101",
                    "c_name": "东城区"
                },
                {
                    "c_code": "110102",
                    "c_name": "西城区"
                },
                {
                    "c_code": "110103",
                    "c_name": "崇文区"
                },
                {
                    "c_code": "110104",
                    "c_name": "宣武区"
                },
                {
                    "c_code": "110105",
                    "c_name": "朝阳区"
                },
                {
                    "c_code": "110106",
                    "c_name": "丰台区"
                },
                {
                    "c_code": "110107",
                    "c_name": "石景山区"
                },
                {
                    "c_code": "110108",
                    "c_name": "海淀区"
                },
                {
                    "c_code": "110109",
                    "c_name": "门头沟区"
                },
                {
                    "c_code": "110111",
                    "c_name": "房山区"
                },
                {
                    "c_code": "110112",
                    "c_name": "通州区"
                },
                {
                    "c_code": "110113",
                    "c_name": "顺义区"
                },
                {
                    "c_code": "110114",
                    "c_name": "昌平区"
                },
                {
                    "c_code": "110115",
                    "c_name": "大兴区"
                },
                {
                    "c_code": "110116",
                    "c_name": "怀柔区"
                },
                {
                    "c_code": "110117",
                    "c_name": "平谷区"
                },
                {
                    "c_code": "110228",
                    "c_name": "密云县"
                },
                {
                    "c_code": "110229",
                    "c_name": "延庆县"
                }
            ],
            "s_code": "110100"
        }]
    },
    {
        "p_name": "上海市",
        "s": [{
            "s_name": "市辖区",
            "c": [{
                    "c_code": "310101",
                    "c_name": "黄浦区"
                },
                {
                    "c_code": "310103",
                    "c_name": "卢湾区"
                },
                {
                    "c_code": "310104",
                    "c_name": "徐汇区"
                },
                {
                    "c_code": "310105",
                    "c_name": "长宁区"
                },
                {
                    "c_code": "310106",
                    "c_name": "静安区"
                },
                {
                    "c_code": "310107",
                    "c_name": "普陀区"
                },
                {
                    "c_code": "310108",
                    "c_name": "闸北区"
                },
                {
                    "c_code": "310109",
                    "c_name": "虹口区"
                },
                {
                    "c_code": "310110",
                    "c_name": "杨浦区"
                },
                {
                    "c_code": "310112",
                    "c_name": "闵行区"
                },
                {
                    "c_code": "310113",
                    "c_name": "宝山区"
                },
                {
                    "c_code": "310114",
                    "c_name": "嘉定区"
                },
                {
                    "c_code": "310115",
                    "c_name": "浦东新区"
                },
                {
                    "c_code": "310116",
                    "c_name": "金山区"
                },
                {
                    "c_code": "310117",
                    "c_name": "松江区"
                },
                {
                    "c_code": "310118",
                    "c_name": "青浦区"
                },
                {
                    "c_code": "310120",
                    "c_name": "奉贤区"
                },
                {
                    "c_code": "310230",
                    "c_name": "崇明县"
                }
            ],
            "s_code": "310100"
        }],
        "p_code": "310000"
    },
    {
        "p_name": "天津市",
        "s": [{
            "s_name": "市辖区",
            "c": [{
                    "c_code": "120101",
                    "c_name": "和平区"
                },
                {
                    "c_code": "120102",
                    "c_name": "河东区"
                },
                {
                    "c_code": "120103",
                    "c_name": "河西区"
                },
                {
                    "c_code": "120104",
                    "c_name": "南开区"
                },
                {
                    "c_code": "120105",
                    "c_name": "河北区"
                },
                {
                    "c_code": "120106",
                    "c_name": "红桥区"
                },
                {
                    "c_code": "120110",
                    "c_name": "东丽区"
                },
                {
                    "c_code": "120111",
                    "c_name": "西青区"
                },
                {
                    "c_code": "120112",
                    "c_name": "津南区"
                },
                {
                    "c_code": "120113",
                    "c_name": "北辰区"
                },
                {
                    "c_code": "120114",
                    "c_name": "武清区"
                },
                {
                    "c_code": "120115",
                    "c_name": "宝坻区"
                },
                {
                    "c_code": "120116",
                    "c_name": "滨海新区"
                },
                {
                    "c_code": "120221",
                    "c_name": "宁河区"
                },
                {
                    "c_code": "120223",
                    "c_name": "静海区"
                },
                {
                    "c_code": "120225",
                    "c_name": "蓟州区"
                }
            ],
            "s_code": "120100"
        }],
        "p_code": "120000"
    },
    {
        "p_name": "重庆市",
        "s": [{
            "s_name": "市辖区",
            "c": [{
                    "c_code": "500101",
                    "c_name": "万州区"
                },
                {
                    "c_code": "500102",
                    "c_name": "涪陵区"
                },
                {
                    "c_code": "500103",
                    "c_name": "渝中区"
                },
                {
                    "c_code": "500104",
                    "c_name": "大渡口区"
                },
                {
                    "c_code": "500105",
                    "c_name": "江北区"
                },
                {
                    "c_code": "500106",
                    "c_name": "沙坪坝区"
                },
                {
                    "c_code": "500107",
                    "c_name": "九龙坡区"
                },
                {
                    "c_code": "500108",
                    "c_name": "南岸区"
                },
                {
                    "c_code": "500109",
                    "c_name": "北碚区"
                },
                {
                    "c_code": "500110",
                    "c_name": "万盛区"
                },
                {
                    "c_code": "500111",
                    "c_name": "双桥区"
                },
                {
                    "c_code": "500112",
                    "c_name": "渝北区"
                },
                {
                    "c_code": "500113",
                    "c_name": "巴南区"
                },
                {
                    "c_code": "500114",
                    "c_name": "黔江区"
                },
                {
                    "c_code": "500115",
                    "c_name": "长寿区"
                },
                {
                    "c_code": "500116",
                    "c_name": "江津区"
                },
                {
                    "c_code": "500117",
                    "c_name": "合川区"
                },
                {
                    "c_code": "500118",
                    "c_name": "永川区"
                },
                {
                    "c_code": "500119",
                    "c_name": "南川区"
                },
                {
                    "c_code": "500222",
                    "c_name": "綦江县"
                },
                {
                    "c_code": "500223",
                    "c_name": "潼南县"
                },
                {
                    "c_code": "500224",
                    "c_name": "铜梁县"
                },
                {
                    "c_code": "500225",
                    "c_name": "大足县"
                },
                {
                    "c_code": "500226",
                    "c_name": "荣昌县"
                },
                {
                    "c_code": "500227",
                    "c_name": "璧山县"
                },
                {
                    "c_code": "500228",
                    "c_name": "梁平县"
                },
                {
                    "c_code": "500229",
                    "c_name": "城口县"
                },
                {
                    "c_code": "500230",
                    "c_name": "丰都县"
                },
                {
                    "c_code": "500231",
                    "c_name": "垫江县"
                },
                {
                    "c_code": "500232",
                    "c_name": "武隆县"
                },
                {
                    "c_code": "500233",
                    "c_name": "忠县"
                },
                {
                    "c_code": "500234",
                    "c_name": "开县"
                },
                {
                    "c_code": "500235",
                    "c_name": "云阳县"
                },
                {
                    "c_code": "500236",
                    "c_name": "奉节县"
                },
                {
                    "c_code": "500237",
                    "c_name": "巫山县"
                },
                {
                    "c_code": "500238",
                    "c_name": "巫溪县"
                },
                {
                    "c_code": "500240",
                    "c_name": "石柱土家族自治县"
                },
                {
                    "c_code": "500241",
                    "c_name": "秀山土家族苗族自治县"
                },
                {
                    "c_code": "500242",
                    "c_name": "酉阳土家族苗族自治县"
                },
                {
                    "c_code": "500243",
                    "c_name": "彭水苗族土家族自治县"
                }
            ],
            "s_code": "500100"
        }],
        "p_code": "500000"
    },
    {
        "p_name": "河北省",
        "s": [{
                "s_name": "石家庄市",
                "c": [{
                        "c_code": "130102",
                        "c_name": "长安区"
                    },
                    {
                        "c_code": "130103",
                        "c_name": "桥东区"
                    },
                    {
                        "c_code": "130104",
                        "c_name": "桥西区"
                    },
                    {
                        "c_code": "130105",
                        "c_name": "新华区"
                    },
                    {
                        "c_code": "130107",
                        "c_name": "井陉矿区"
                    },
                    {
                        "c_code": "130108",
                        "c_name": "裕华区"
                    },
                    {
                        "c_code": "130121",
                        "c_name": "井陉县"
                    },
                    {
                        "c_code": "130123",
                        "c_name": "正定县"
                    },
                    {
                        "c_code": "130124",
                        "c_name": "栾城县"
                    },
                    {
                        "c_code": "130125",
                        "c_name": "行唐县"
                    },
                    {
                        "c_code": "130126",
                        "c_name": "灵寿县"
                    },
                    {
                        "c_code": "130127",
                        "c_name": "高邑县"
                    },
                    {
                        "c_code": "130128",
                        "c_name": "深泽县"
                    },
                    {
                        "c_code": "130129",
                        "c_name": "赞皇县"
                    },
                    {
                        "c_code": "130130",
                        "c_name": "无极县"
                    },
                    {
                        "c_code": "130131",
                        "c_name": "平山县"
                    },
                    {
                        "c_code": "130132",
                        "c_name": "元氏县"
                    },
                    {
                        "c_code": "130133",
                        "c_name": "赵县"
                    },
                    {
                        "c_code": "130181",
                        "c_name": "辛集市"
                    },
                    {
                        "c_code": "130182",
                        "c_name": "藁城市"
                    },
                    {
                        "c_code": "130183",
                        "c_name": "晋州市"
                    },
                    {
                        "c_code": "130184",
                        "c_name": "新乐市"
                    },
                    {
                        "c_code": "130185",
                        "c_name": "鹿泉市"
                    }
                ],
                "s_code": "130100"
            },
            {
                "s_name": "唐山市",
                "c": [{
                        "c_code": "130202",
                        "c_name": "路南区"
                    },
                    {
                        "c_code": "130203",
                        "c_name": "路北区"
                    },
                    {
                        "c_code": "130204",
                        "c_name": "古冶区"
                    },
                    {
                        "c_code": "130205",
                        "c_name": "开平区"
                    },
                    {
                        "c_code": "130207",
                        "c_name": "丰南区"
                    },
                    {
                        "c_code": "130208",
                        "c_name": "丰润区"
                    },
                    {
                        "c_code": "130223",
                        "c_name": "滦州市"
                    },
                    {
                        "c_code": "130224",
                        "c_name": "滦南县"
                    },
                    {
                        "c_code": "130225",
                        "c_name": "乐亭县"
                    },
                    {
                        "c_code": "130227",
                        "c_name": "迁西县"
                    },
                    {
                        "c_code": "130229",
                        "c_name": "玉田县"
                    },
                    {
                        "c_code": "130230",
                        "c_name": "唐海县"
                    },
                    {
                        "c_code": "130281",
                        "c_name": "遵化市"
                    },
                    {
                        "c_code": "130283",
                        "c_name": "迁安市"
                    }
                ],
                "s_code": "130200"
            },
            {
                "s_name": "秦皇岛市",
                "c": [{
                        "c_code": "130302",
                        "c_name": "海港区"
                    },
                    {
                        "c_code": "130303",
                        "c_name": "山海关区"
                    },
                    {
                        "c_code": "130304",
                        "c_name": "北戴河区"
                    },
                    {
                        "c_code": "130321",
                        "c_name": "青龙满族自治县"
                    },
                    {
                        "c_code": "130322",
                        "c_name": "昌黎县"
                    },
                    {
                        "c_code": "130323",
                        "c_name": "抚宁县"
                    },
                    {
                        "c_code": "130324",
                        "c_name": "卢龙县"
                    }
                ],
                "s_code": "130300"
            },
            {
                "s_name": "邯郸市",
                "c": [{
                        "c_code": "130402",
                        "c_name": "邯山区"
                    },
                    {
                        "c_code": "130403",
                        "c_name": "丛台区"
                    },
                    {
                        "c_code": "130404",
                        "c_name": "复兴区"
                    },
                    {
                        "c_code": "130406",
                        "c_name": "峰峰矿区"
                    },
                    {
                        "c_code": "130421",
                        "c_name": "邯郸县"
                    },
                    {
                        "c_code": "130423",
                        "c_name": "临漳县"
                    },
                    {
                        "c_code": "130424",
                        "c_name": "成安县"
                    },
                    {
                        "c_code": "130425",
                        "c_name": "大名县"
                    },
                    {
                        "c_code": "130426",
                        "c_name": "涉县"
                    },
                    {
                        "c_code": "130427",
                        "c_name": "磁县"
                    },
                    {
                        "c_code": "130428",
                        "c_name": "肥乡县"
                    },
                    {
                        "c_code": "130429",
                        "c_name": "永年县"
                    },
                    {
                        "c_code": "130430",
                        "c_name": "邱县"
                    },
                    {
                        "c_code": "130431",
                        "c_name": "鸡泽县"
                    },
                    {
                        "c_code": "130432",
                        "c_name": "广平县"
                    },
                    {
                        "c_code": "130433",
                        "c_name": "馆陶县"
                    },
                    {
                        "c_code": "130434",
                        "c_name": "魏县"
                    },
                    {
                        "c_code": "130435",
                        "c_name": "曲周县"
                    },
                    {
                        "c_code": "130481",
                        "c_name": "武安市"
                    }
                ],
                "s_code": "130400"
            },
            {
                "s_name": "邢台市",
                "c": [{
                        "c_code": "130502",
                        "c_name": "桥东区"
                    },
                    {
                        "c_code": "130503",
                        "c_name": "桥西区"
                    },
                    {
                        "c_code": "130521",
                        "c_name": "邢台县"
                    },
                    {
                        "c_code": "130522",
                        "c_name": "临城县"
                    },
                    {
                        "c_code": "130523",
                        "c_name": "内丘县"
                    },
                    {
                        "c_code": "130524",
                        "c_name": "柏乡县"
                    },
                    {
                        "c_code": "130525",
                        "c_name": "隆尧县"
                    },
                    {
                        "c_code": "130526",
                        "c_name": "任县"
                    },
                    {
                        "c_code": "130527",
                        "c_name": "南和县"
                    },
                    {
                        "c_code": "130528",
                        "c_name": "宁晋县"
                    },
                    {
                        "c_code": "130529",
                        "c_name": "巨鹿县"
                    },
                    {
                        "c_code": "130530",
                        "c_name": "新河县"
                    },
                    {
                        "c_code": "130531",
                        "c_name": "广宗县"
                    },
                    {
                        "c_code": "130532",
                        "c_name": "平乡县"
                    },
                    {
                        "c_code": "130533",
                        "c_name": "威县"
                    },
                    {
                        "c_code": "130534",
                        "c_name": "清河县"
                    },
                    {
                        "c_code": "130535",
                        "c_name": "临西县"
                    },
                    {
                        "c_code": "130581",
                        "c_name": "南宫市"
                    },
                    {
                        "c_code": "130582",
                        "c_name": "沙河市"
                    }
                ],
                "s_code": "130500"
            },
            {
                "s_name": "保定市",
                "c": [{
                        "c_code": "130602",
                        "c_name": "新市区"
                    },
                    {
                        "c_code": "130603",
                        "c_name": "北市区"
                    },
                    {
                        "c_code": "130604",
                        "c_name": "南市区"
                    },
                    {
                        "c_code": "130621",
                        "c_name": "满城县"
                    },
                    {
                        "c_code": "130622",
                        "c_name": "清苑县"
                    },
                    {
                        "c_code": "130623",
                        "c_name": "涞水县"
                    },
                    {
                        "c_code": "130624",
                        "c_name": "阜平县"
                    },
                    {
                        "c_code": "130625",
                        "c_name": "徐水县"
                    },
                    {
                        "c_code": "130626",
                        "c_name": "定兴县"
                    },
                    {
                        "c_code": "130627",
                        "c_name": "唐县"
                    },
                    {
                        "c_code": "130628",
                        "c_name": "高阳县"
                    },
                    {
                        "c_code": "130629",
                        "c_name": "容城县"
                    },
                    {
                        "c_code": "130630",
                        "c_name": "涞源县"
                    },
                    {
                        "c_code": "130631",
                        "c_name": "望都县"
                    },
                    {
                        "c_code": "130632",
                        "c_name": "安新县"
                    },
                    {
                        "c_code": "130633",
                        "c_name": "易县"
                    },
                    {
                        "c_code": "130634",
                        "c_name": "曲阳县"
                    },
                    {
                        "c_code": "130635",
                        "c_name": "蠡县"
                    },
                    {
                        "c_code": "130636",
                        "c_name": "顺平县"
                    },
                    {
                        "c_code": "130637",
                        "c_name": "博野县"
                    },
                    {
                        "c_code": "130638",
                        "c_name": "雄县"
                    },
                    {
                        "c_code": "130681",
                        "c_name": "涿州市"
                    },
                    {
                        "c_code": "130682",
                        "c_name": "定州市"
                    },
                    {
                        "c_code": "130683",
                        "c_name": "安国市"
                    },
                    {
                        "c_code": "130684",
                        "c_name": "高碑店市"
                    }
                ],
                "s_code": "130600"
            },
            {
                "s_name": "张家口市",
                "c": [{
                        "c_code": "130702",
                        "c_name": "桥东区"
                    },
                    {
                        "c_code": "130703",
                        "c_name": "桥西区"
                    },
                    {
                        "c_code": "130705",
                        "c_name": "宣化区"
                    },
                    {
                        "c_code": "130706",
                        "c_name": "下花园区"
                    },
                    {
                        "c_code": "130721",
                        "c_name": "宣化县"
                    },
                    {
                        "c_code": "130722",
                        "c_name": "张北县"
                    },
                    {
                        "c_code": "130723",
                        "c_name": "康保县"
                    },
                    {
                        "c_code": "130724",
                        "c_name": "沽源县"
                    },
                    {
                        "c_code": "130725",
                        "c_name": "尚义县"
                    },
                    {
                        "c_code": "130726",
                        "c_name": "蔚县"
                    },
                    {
                        "c_code": "130727",
                        "c_name": "阳原县"
                    },
                    {
                        "c_code": "130728",
                        "c_name": "怀安县"
                    },
                    {
                        "c_code": "130729",
                        "c_name": "万全县"
                    },
                    {
                        "c_code": "130730",
                        "c_name": "怀来县"
                    },
                    {
                        "c_code": "130731",
                        "c_name": "涿鹿县"
                    },
                    {
                        "c_code": "130732",
                        "c_name": "赤城县"
                    },
                    {
                        "c_code": "130733",
                        "c_name": "崇礼县"
                    }
                ],
                "s_code": "130700"
            },
            {
                "s_name": "承德市",
                "c": [{
                        "c_code": "130802",
                        "c_name": "双桥区"
                    },
                    {
                        "c_code": "130803",
                        "c_name": "双滦区"
                    },
                    {
                        "c_code": "130804",
                        "c_name": "鹰手营子矿区"
                    },
                    {
                        "c_code": "130821",
                        "c_name": "承德县"
                    },
                    {
                        "c_code": "130822",
                        "c_name": "兴隆县"
                    },
                    {
                        "c_code": "130823",
                        "c_name": "平泉县"
                    },
                    {
                        "c_code": "130824",
                        "c_name": "滦平县"
                    },
                    {
                        "c_code": "130825",
                        "c_name": "隆化县"
                    },
                    {
                        "c_code": "130826",
                        "c_name": "丰宁满族自治县"
                    },
                    {
                        "c_code": "130827",
                        "c_name": "宽城满族自治县"
                    },
                    {
                        "c_code": "130828",
                        "c_name": "围场满族蒙古族自治县"
                    }
                ],
                "s_code": "130800"
            },
            {
                "s_name": "沧州市",
                "c": [{
                        "c_code": "130902",
                        "c_name": "新华区"
                    },
                    {
                        "c_code": "130903",
                        "c_name": "运河区"
                    },
                    {
                        "c_code": "130921",
                        "c_name": "沧县"
                    },
                    {
                        "c_code": "130922",
                        "c_name": "青县"
                    },
                    {
                        "c_code": "130923",
                        "c_name": "东光县"
                    },
                    {
                        "c_code": "130924",
                        "c_name": "海兴县"
                    },
                    {
                        "c_code": "130925",
                        "c_name": "盐山县"
                    },
                    {
                        "c_code": "130926",
                        "c_name": "肃宁县"
                    },
                    {
                        "c_code": "130927",
                        "c_name": "南皮县"
                    },
                    {
                        "c_code": "130928",
                        "c_name": "吴桥县"
                    },
                    {
                        "c_code": "130929",
                        "c_name": "献县"
                    },
                    {
                        "c_code": "130930",
                        "c_name": "孟村回族自治县"
                    },
                    {
                        "c_code": "130981",
                        "c_name": "泊头市"
                    },
                    {
                        "c_code": "130982",
                        "c_name": "任丘市"
                    },
                    {
                        "c_code": "130983",
                        "c_name": "黄骅市"
                    },
                    {
                        "c_code": "130984",
                        "c_name": "河间市"
                    }
                ],
                "s_code": "130900"
            },
            {
                "s_name": "廊坊市",
                "c": [{
                        "c_code": "131002",
                        "c_name": "安次区"
                    },
                    {
                        "c_code": "131003",
                        "c_name": "广阳区"
                    },
                    {
                        "c_code": "131022",
                        "c_name": "固安县"
                    },
                    {
                        "c_code": "131023",
                        "c_name": "永清县"
                    },
                    {
                        "c_code": "131024",
                        "c_name": "香河县"
                    },
                    {
                        "c_code": "131025",
                        "c_name": "大城县"
                    },
                    {
                        "c_code": "131026",
                        "c_name": "文安县"
                    },
                    {
                        "c_code": "131028",
                        "c_name": "大厂回族自治县"
                    },
                    {
                        "c_code": "131081",
                        "c_name": "霸州市"
                    },
                    {
                        "c_code": "131082",
                        "c_name": "三河市"
                    }
                ],
                "s_code": "131000"
            },
            {
                "s_name": "衡水市",
                "c": [{
                        "c_code": "131102",
                        "c_name": "桃城区"
                    },
                    {
                        "c_code": "131121",
                        "c_name": "枣强县"
                    },
                    {
                        "c_code": "131122",
                        "c_name": "武邑县"
                    },
                    {
                        "c_code": "131123",
                        "c_name": "武强县"
                    },
                    {
                        "c_code": "131124",
                        "c_name": "饶阳县"
                    },
                    {
                        "c_code": "131125",
                        "c_name": "安平县"
                    },
                    {
                        "c_code": "131126",
                        "c_name": "故城县"
                    },
                    {
                        "c_code": "131127",
                        "c_name": "景县"
                    },
                    {
                        "c_code": "131128",
                        "c_name": "阜城县"
                    },
                    {
                        "c_code": "131181",
                        "c_name": "冀州市"
                    },
                    {
                        "c_code": "131182",
                        "c_name": "深州市"
                    }
                ],
                "s_code": "131100"
            }
        ],
        "p_code": "130000"
    },
    {
        "p_name": "山西省",
        "s": [{
                "s_name": "太原市",
                "c": [{
                        "c_code": "140105",
                        "c_name": "小店区"
                    },
                    {
                        "c_code": "140106",
                        "c_name": "迎泽区"
                    },
                    {
                        "c_code": "140107",
                        "c_name": "杏花岭区"
                    },
                    {
                        "c_code": "140108",
                        "c_name": "尖草坪区"
                    },
                    {
                        "c_code": "140109",
                        "c_name": "万柏林区"
                    },
                    {
                        "c_code": "140110",
                        "c_name": "晋源区"
                    },
                    {
                        "c_code": "140121",
                        "c_name": "清徐县"
                    },
                    {
                        "c_code": "140122",
                        "c_name": "阳曲县"
                    },
                    {
                        "c_code": "140123",
                        "c_name": "娄烦县"
                    },
                    {
                        "c_code": "140181",
                        "c_name": "古交市"
                    }
                ],
                "s_code": "140100"
            },
            {
                "s_name": "大同市",
                "c": [{
                        "c_code": "140202",
                        "c_name": "城区"
                    },
                    {
                        "c_code": "140203",
                        "c_name": "矿区"
                    },
                    {
                        "c_code": "140211",
                        "c_name": "南郊区"
                    },
                    {
                        "c_code": "140212",
                        "c_name": "新荣区"
                    },
                    {
                        "c_code": "140221",
                        "c_name": "阳高县"
                    },
                    {
                        "c_code": "140222",
                        "c_name": "天镇县"
                    },
                    {
                        "c_code": "140223",
                        "c_name": "广灵县"
                    },
                    {
                        "c_code": "140224",
                        "c_name": "灵丘县"
                    },
                    {
                        "c_code": "140225",
                        "c_name": "浑源县"
                    },
                    {
                        "c_code": "140226",
                        "c_name": "左云县"
                    },
                    {
                        "c_code": "140227",
                        "c_name": "大同县"
                    }
                ],
                "s_code": "140200"
            },
            {
                "s_name": "阳泉市",
                "c": [{
                        "c_code": "140302",
                        "c_name": "城区"
                    },
                    {
                        "c_code": "140303",
                        "c_name": "矿区"
                    },
                    {
                        "c_code": "140311",
                        "c_name": "郊区"
                    },
                    {
                        "c_code": "140321",
                        "c_name": "平定县"
                    },
                    {
                        "c_code": "140322",
                        "c_name": "盂县"
                    }
                ],
                "s_code": "140300"
            },
            {
                "s_name": "长治市",
                "c": [{
                        "c_code": "140402",
                        "c_name": "城区"
                    },
                    {
                        "c_code": "140411",
                        "c_name": "郊区"
                    },
                    {
                        "c_code": "140421",
                        "c_name": "长治县"
                    },
                    {
                        "c_code": "140423",
                        "c_name": "襄垣县"
                    },
                    {
                        "c_code": "140424",
                        "c_name": "屯留县"
                    },
                    {
                        "c_code": "140425",
                        "c_name": "平顺县"
                    },
                    {
                        "c_code": "140426",
                        "c_name": "黎城县"
                    },
                    {
                        "c_code": "140427",
                        "c_name": "壶关县"
                    },
                    {
                        "c_code": "140428",
                        "c_name": "长子县"
                    },
                    {
                        "c_code": "140429",
                        "c_name": "武乡县"
                    },
                    {
                        "c_code": "140430",
                        "c_name": "沁县"
                    },
                    {
                        "c_code": "140431",
                        "c_name": "沁源县"
                    },
                    {
                        "c_code": "140481",
                        "c_name": "潞城市"
                    }
                ],
                "s_code": "140400"
            },
            {
                "s_name": "晋城市",
                "c": [{
                        "c_code": "140502",
                        "c_name": "城区"
                    },
                    {
                        "c_code": "140521",
                        "c_name": "沁水县"
                    },
                    {
                        "c_code": "140522",
                        "c_name": "阳城县"
                    },
                    {
                        "c_code": "140524",
                        "c_name": "陵川县"
                    },
                    {
                        "c_code": "140525",
                        "c_name": "泽州县"
                    },
                    {
                        "c_code": "140581",
                        "c_name": "高平市"
                    }
                ],
                "s_code": "140500"
            },
            {
                "s_name": "朔州市",
                "c": [{
                        "c_code": "140602",
                        "c_name": "朔城区"
                    },
                    {
                        "c_code": "140603",
                        "c_name": "平鲁区"
                    },
                    {
                        "c_code": "140621",
                        "c_name": "山阴县"
                    },
                    {
                        "c_code": "140622",
                        "c_name": "应县"
                    },
                    {
                        "c_code": "140623",
                        "c_name": "右玉县"
                    },
                    {
                        "c_code": "140624",
                        "c_name": "怀仁县"
                    }
                ],
                "s_code": "140600"
            },
            {
                "s_name": "晋中市",
                "c": [{
                        "c_code": "140702",
                        "c_name": "榆次区"
                    },
                    {
                        "c_code": "140721",
                        "c_name": "榆社县"
                    },
                    {
                        "c_code": "140722",
                        "c_name": "左权县"
                    },
                    {
                        "c_code": "140723",
                        "c_name": "和顺县"
                    },
                    {
                        "c_code": "140724",
                        "c_name": "昔阳县"
                    },
                    {
                        "c_code": "140725",
                        "c_name": "寿阳县"
                    },
                    {
                        "c_code": "140726",
                        "c_name": "太谷县"
                    },
                    {
                        "c_code": "140727",
                        "c_name": "祁县"
                    },
                    {
                        "c_code": "140728",
                        "c_name": "平遥县"
                    },
                    {
                        "c_code": "140729",
                        "c_name": "灵石县"
                    },
                    {
                        "c_code": "140781",
                        "c_name": "介休市"
                    }
                ],
                "s_code": "140700"
            },
            {
                "s_name": "运城市",
                "c": [{
                        "c_code": "140802",
                        "c_name": "盐湖区"
                    },
                    {
                        "c_code": "140821",
                        "c_name": "临猗县"
                    },
                    {
                        "c_code": "140822",
                        "c_name": "万荣县"
                    },
                    {
                        "c_code": "140823",
                        "c_name": "闻喜县"
                    },
                    {
                        "c_code": "140824",
                        "c_name": "稷山县"
                    },
                    {
                        "c_code": "140825",
                        "c_name": "新绛县"
                    },
                    {
                        "c_code": "140826",
                        "c_name": "绛县"
                    },
                    {
                        "c_code": "140827",
                        "c_name": "垣曲县"
                    },
                    {
                        "c_code": "140828",
                        "c_name": "夏县"
                    },
                    {
                        "c_code": "140829",
                        "c_name": "平陆县"
                    },
                    {
                        "c_code": "140830",
                        "c_name": "芮城县"
                    },
                    {
                        "c_code": "140881",
                        "c_name": "永济市"
                    },
                    {
                        "c_code": "140882",
                        "c_name": "河津市"
                    }
                ],
                "s_code": "140800"
            },
            {
                "s_name": "忻州市",
                "c": [{
                        "c_code": "140902",
                        "c_name": "忻府区"
                    },
                    {
                        "c_code": "140921",
                        "c_name": "定襄县"
                    },
                    {
                        "c_code": "140922",
                        "c_name": "五台县"
                    },
                    {
                        "c_code": "140923",
                        "c_name": "代县"
                    },
                    {
                        "c_code": "140924",
                        "c_name": "繁峙县"
                    },
                    {
                        "c_code": "140925",
                        "c_name": "宁武县"
                    },
                    {
                        "c_code": "140926",
                        "c_name": "静乐县"
                    },
                    {
                        "c_code": "140927",
                        "c_name": "神池县"
                    },
                    {
                        "c_code": "140928",
                        "c_name": "五寨县"
                    },
                    {
                        "c_code": "140929",
                        "c_name": "岢岚县"
                    },
                    {
                        "c_code": "140930",
                        "c_name": "河曲县"
                    },
                    {
                        "c_code": "140931",
                        "c_name": "保德县"
                    },
                    {
                        "c_code": "140932",
                        "c_name": "偏关县"
                    },
                    {
                        "c_code": "140981",
                        "c_name": "原平市"
                    }
                ],
                "s_code": "140900"
            },
            {
                "s_name": "临汾市",
                "c": [{
                        "c_code": "141002",
                        "c_name": "尧都区"
                    },
                    {
                        "c_code": "141021",
                        "c_name": "曲沃县"
                    },
                    {
                        "c_code": "141022",
                        "c_name": "翼城县"
                    },
                    {
                        "c_code": "141023",
                        "c_name": "襄汾县"
                    },
                    {
                        "c_code": "141024",
                        "c_name": "洪洞县"
                    },
                    {
                        "c_code": "141025",
                        "c_name": "古县"
                    },
                    {
                        "c_code": "141026",
                        "c_name": "安泽县"
                    },
                    {
                        "c_code": "141027",
                        "c_name": "浮山县"
                    },
                    {
                        "c_code": "141028",
                        "c_name": "吉县"
                    },
                    {
                        "c_code": "141029",
                        "c_name": "乡宁县"
                    },
                    {
                        "c_code": "141030",
                        "c_name": "大宁县"
                    },
                    {
                        "c_code": "141031",
                        "c_name": "隰县"
                    },
                    {
                        "c_code": "141032",
                        "c_name": "永和县"
                    },
                    {
                        "c_code": "141033",
                        "c_name": "蒲县"
                    },
                    {
                        "c_code": "141034",
                        "c_name": "汾西县"
                    },
                    {
                        "c_code": "141081",
                        "c_name": "侯马市"
                    },
                    {
                        "c_code": "141082",
                        "c_name": "霍州市"
                    }
                ],
                "s_code": "141000"
            },
            {
                "s_name": "吕梁市",
                "c": [{
                        "c_code": "141102",
                        "c_name": "离石区"
                    },
                    {
                        "c_code": "141121",
                        "c_name": "文水县"
                    },
                    {
                        "c_code": "141122",
                        "c_name": "交城县"
                    },
                    {
                        "c_code": "141123",
                        "c_name": "兴县"
                    },
                    {
                        "c_code": "141124",
                        "c_name": "临县"
                    },
                    {
                        "c_code": "141125",
                        "c_name": "柳林县"
                    },
                    {
                        "c_code": "141126",
                        "c_name": "石楼县"
                    },
                    {
                        "c_code": "141127",
                        "c_name": "岚县"
                    },
                    {
                        "c_code": "141128",
                        "c_name": "方山县"
                    },
                    {
                        "c_code": "141129",
                        "c_name": "中阳县"
                    },
                    {
                        "c_code": "141130",
                        "c_name": "交口县"
                    },
                    {
                        "c_code": "141181",
                        "c_name": "孝义市"
                    },
                    {
                        "c_code": "141182",
                        "c_name": "汾阳市"
                    }
                ],
                "s_code": "141100"
            }
        ],
        "p_code": "140000"
    },
    {
        "p_name": "内蒙古自治区",
        "s": [{
                "s_name": "呼和浩特市",
                "c": [{
                        "c_code": "150102",
                        "c_name": "新城区"
                    },
                    {
                        "c_code": "150103",
                        "c_name": "回民区"
                    },
                    {
                        "c_code": "150104",
                        "c_name": "玉泉区"
                    },
                    {
                        "c_code": "150105",
                        "c_name": "赛罕区"
                    },
                    {
                        "c_code": "150121",
                        "c_name": "土默特左旗"
                    },
                    {
                        "c_code": "150122",
                        "c_name": "托克托县"
                    },
                    {
                        "c_code": "150123",
                        "c_name": "和林格尔县"
                    },
                    {
                        "c_code": "150124",
                        "c_name": "清水河县"
                    },
                    {
                        "c_code": "150125",
                        "c_name": "武川县"
                    }
                ],
                "s_code": "150100"
            },
            {
                "s_name": "包头市",
                "c": [{
                        "c_code": "150202",
                        "c_name": "东河区"
                    },
                    {
                        "c_code": "150203",
                        "c_name": "昆都仑区"
                    },
                    {
                        "c_code": "150204",
                        "c_name": "青山区"
                    },
                    {
                        "c_code": "150205",
                        "c_name": "石拐区"
                    },
                    {
                        "c_code": "150206",
                        "c_name": "白云鄂博矿区"
                    },
                    {
                        "c_code": "150207",
                        "c_name": "九原区"
                    },
                    {
                        "c_code": "150221",
                        "c_name": "土默特右旗"
                    },
                    {
                        "c_code": "150222",
                        "c_name": "固阳县"
                    },
                    {
                        "c_code": "150223",
                        "c_name": "达尔罕茂明安联合旗"
                    }
                ],
                "s_code": "150200"
            },
            {
                "s_name": "乌海市",
                "c": [{
                        "c_code": "150302",
                        "c_name": "海勃湾区"
                    },
                    {
                        "c_code": "150303",
                        "c_name": "海南区"
                    },
                    {
                        "c_code": "150304",
                        "c_name": "乌达区"
                    }
                ],
                "s_code": "150300"
            },
            {
                "s_name": "赤峰市",
                "c": [{
                        "c_code": "150402",
                        "c_name": "红山区"
                    },
                    {
                        "c_code": "150403",
                        "c_name": "元宝山区"
                    },
                    {
                        "c_code": "150404",
                        "c_name": "松山区"
                    },
                    {
                        "c_code": "150421",
                        "c_name": "阿鲁科尔沁旗"
                    },
                    {
                        "c_code": "150422",
                        "c_name": "巴林左旗"
                    },
                    {
                        "c_code": "150423",
                        "c_name": "巴林右旗"
                    },
                    {
                        "c_code": "150424",
                        "c_name": "林西县"
                    },
                    {
                        "c_code": "150425",
                        "c_name": "克什克腾旗"
                    },
                    {
                        "c_code": "150426",
                        "c_name": "翁牛特旗"
                    },
                    {
                        "c_code": "150428",
                        "c_name": "喀喇沁旗"
                    },
                    {
                        "c_code": "150429",
                        "c_name": "宁城县"
                    },
                    {
                        "c_code": "150430",
                        "c_name": "敖汉旗"
                    }
                ],
                "s_code": "150400"
            },
            {
                "s_name": "通辽市",
                "c": [{
                        "c_code": "150502",
                        "c_name": "科尔沁区"
                    },
                    {
                        "c_code": "150521",
                        "c_name": "科尔沁左翼中旗"
                    },
                    {
                        "c_code": "150522",
                        "c_name": "科尔沁左翼后旗"
                    },
                    {
                        "c_code": "150523",
                        "c_name": "开鲁县"
                    },
                    {
                        "c_code": "150524",
                        "c_name": "库伦旗"
                    },
                    {
                        "c_code": "150525",
                        "c_name": "奈曼旗"
                    },
                    {
                        "c_code": "150526",
                        "c_name": "扎鲁特旗"
                    },
                    {
                        "c_code": "150581",
                        "c_name": "霍林郭勒市"
                    }
                ],
                "s_code": "150500"
            },
            {
                "s_name": "鄂尔多斯市",
                "c": [{
                        "c_code": "150602",
                        "c_name": "东胜区"
                    },
                    {
                        "c_code": "150621",
                        "c_name": "达拉特旗"
                    },
                    {
                        "c_code": "150622",
                        "c_name": "准格尔旗"
                    },
                    {
                        "c_code": "150623",
                        "c_name": "鄂托克前旗"
                    },
                    {
                        "c_code": "150624",
                        "c_name": "鄂托克旗"
                    },
                    {
                        "c_code": "150625",
                        "c_name": "杭锦旗"
                    },
                    {
                        "c_code": "150626",
                        "c_name": "乌审旗"
                    },
                    {
                        "c_code": "150627",
                        "c_name": "伊金霍洛旗"
                    }
                ],
                "s_code": "150600"
            },
            {
                "s_name": "呼伦贝尔市",
                "c": [{
                        "c_code": "150702",
                        "c_name": "海拉尔区"
                    },
                    {
                        "c_code": "150721",
                        "c_name": "阿荣旗"
                    },
                    {
                        "c_code": "150722",
                        "c_name": "莫力达瓦达斡尔族自治旗"
                    },
                    {
                        "c_code": "150723",
                        "c_name": "鄂伦春自治旗"
                    },
                    {
                        "c_code": "150724",
                        "c_name": "鄂温克族自治旗"
                    },
                    {
                        "c_code": "150725",
                        "c_name": "陈巴尔虎旗"
                    },
                    {
                        "c_code": "150726",
                        "c_name": "新巴尔虎左旗"
                    },
                    {
                        "c_code": "150727",
                        "c_name": "新巴尔虎右旗"
                    },
                    {
                        "c_code": "150781",
                        "c_name": "满洲里市"
                    },
                    {
                        "c_code": "150782",
                        "c_name": "牙克石市"
                    },
                    {
                        "c_code": "150783",
                        "c_name": "扎兰屯市"
                    },
                    {
                        "c_code": "150784",
                        "c_name": "额尔古纳市"
                    },
                    {
                        "c_code": "150785",
                        "c_name": "根河市"
                    }
                ],
                "s_code": "150700"
            },
            {
                "s_name": "巴彦淖尔市",
                "c": [{
                        "c_code": "150802",
                        "c_name": "临河区"
                    },
                    {
                        "c_code": "150821",
                        "c_name": "五原县"
                    },
                    {
                        "c_code": "150822",
                        "c_name": "磴口县"
                    },
                    {
                        "c_code": "150823",
                        "c_name": "乌拉特前旗"
                    },
                    {
                        "c_code": "150824",
                        "c_name": "乌拉特中旗"
                    },
                    {
                        "c_code": "150825",
                        "c_name": "乌拉特后旗"
                    },
                    {
                        "c_code": "150826",
                        "c_name": "杭锦后旗"
                    }
                ],
                "s_code": "150800"
            },
            {
                "s_name": "乌兰察布市",
                "c": [{
                        "c_code": "150902",
                        "c_name": "集宁区"
                    },
                    {
                        "c_code": "150921",
                        "c_name": "卓资县"
                    },
                    {
                        "c_code": "150922",
                        "c_name": "化德县"
                    },
                    {
                        "c_code": "150923",
                        "c_name": "商都县"
                    },
                    {
                        "c_code": "150924",
                        "c_name": "兴和县"
                    },
                    {
                        "c_code": "150925",
                        "c_name": "凉城县"
                    },
                    {
                        "c_code": "150926",
                        "c_name": "察哈尔右翼前旗"
                    },
                    {
                        "c_code": "150927",
                        "c_name": "察哈尔右翼中旗"
                    },
                    {
                        "c_code": "150928",
                        "c_name": "察哈尔右翼后旗"
                    },
                    {
                        "c_code": "150929",
                        "c_name": "四子王旗"
                    },
                    {
                        "c_code": "150981",
                        "c_name": "丰镇市"
                    }
                ],
                "s_code": "150900"
            },
            {
                "s_name": "兴安盟",
                "c": [{
                        "c_code": "152201",
                        "c_name": "乌兰浩特市"
                    },
                    {
                        "c_code": "152202",
                        "c_name": "阿尔山市"
                    },
                    {
                        "c_code": "152221",
                        "c_name": "科尔沁右翼前旗"
                    },
                    {
                        "c_code": "152222",
                        "c_name": "科尔沁右翼中旗"
                    },
                    {
                        "c_code": "152223",
                        "c_name": "扎赉特旗"
                    },
                    {
                        "c_code": "152224",
                        "c_name": "突泉县"
                    }
                ],
                "s_code": "152200"
            },
            {
                "s_name": "锡林郭勒盟",
                "c": [{
                        "c_code": "152501",
                        "c_name": "二连浩特市"
                    },
                    {
                        "c_code": "152502",
                        "c_name": "锡林浩特市"
                    },
                    {
                        "c_code": "152522",
                        "c_name": "阿巴嘎旗"
                    },
                    {
                        "c_code": "152523",
                        "c_name": "苏尼特左旗"
                    },
                    {
                        "c_code": "152524",
                        "c_name": "苏尼特右旗"
                    },
                    {
                        "c_code": "152525",
                        "c_name": "东乌珠穆沁旗"
                    },
                    {
                        "c_code": "152526",
                        "c_name": "西乌珠穆沁旗"
                    },
                    {
                        "c_code": "152527",
                        "c_name": "太仆寺旗"
                    },
                    {
                        "c_code": "152528",
                        "c_name": "镶黄旗"
                    },
                    {
                        "c_code": "152529",
                        "c_name": "正镶白旗"
                    },
                    {
                        "c_code": "152530",
                        "c_name": "正蓝旗"
                    },
                    {
                        "c_code": "152531",
                        "c_name": "多伦县"
                    }
                ],
                "s_code": "152500"
            },
            {
                "s_name": "阿拉善盟",
                "c": [{
                        "c_code": "152921",
                        "c_name": "阿拉善左旗"
                    },
                    {
                        "c_code": "152922",
                        "c_name": "阿拉善右旗"
                    },
                    {
                        "c_code": "152923",
                        "c_name": "额济纳旗"
                    }
                ],
                "s_code": "152900"
            }
        ],
        "p_code": "150000"
    },
    {
        "p_name": "辽宁省",
        "s": [{
                "s_name": "沈阳市",
                "c": [{
                        "c_code": "210102",
                        "c_name": "和平区"
                    },
                    {
                        "c_code": "210103",
                        "c_name": "沈河区"
                    },
                    {
                        "c_code": "210104",
                        "c_name": "大东区"
                    },
                    {
                        "c_code": "210105",
                        "c_name": "皇姑区"
                    },
                    {
                        "c_code": "210106",
                        "c_name": "铁西区"
                    },
                    {
                        "c_code": "210111",
                        "c_name": "苏家屯区"
                    },
                    {
                        "c_code": "210112",
                        "c_name": "东陵区"
                    },
                    {
                        "c_code": "210113",
                        "c_name": "沈北新区"
                    },
                    {
                        "c_code": "210114",
                        "c_name": "于洪区"
                    },
                    {
                        "c_code": "210122",
                        "c_name": "辽中县"
                    },
                    {
                        "c_code": "210123",
                        "c_name": "康平县"
                    },
                    {
                        "c_code": "210124",
                        "c_name": "法库县"
                    },
                    {
                        "c_code": "210181",
                        "c_name": "新民市"
                    }
                ],
                "s_code": "210100"
            },
            {
                "s_name": "大连市",
                "c": [{
                        "c_code": "210202",
                        "c_name": "中山区"
                    },
                    {
                        "c_code": "210203",
                        "c_name": "西岗区"
                    },
                    {
                        "c_code": "210204",
                        "c_name": "沙河口区"
                    },
                    {
                        "c_code": "210211",
                        "c_name": "甘井子区"
                    },
                    {
                        "c_code": "210212",
                        "c_name": "旅顺口区"
                    },
                    {
                        "c_code": "210213",
                        "c_name": "金州区"
                    },
                    {
                        "c_code": "210224",
                        "c_name": "长海县"
                    },
                    {
                        "c_code": "210281",
                        "c_name": "瓦房店市"
                    },
                    {
                        "c_code": "210282",
                        "c_name": "普兰店市"
                    },
                    {
                        "c_code": "210283",
                        "c_name": "庄河市"
                    }
                ],
                "s_code": "210200"
            },
            {
                "s_name": "鞍山市",
                "c": [{
                        "c_code": "210302",
                        "c_name": "铁东区"
                    },
                    {
                        "c_code": "210303",
                        "c_name": "铁西区"
                    },
                    {
                        "c_code": "210304",
                        "c_name": "立山区"
                    },
                    {
                        "c_code": "210311",
                        "c_name": "千山区"
                    },
                    {
                        "c_code": "210321",
                        "c_name": "台安县"
                    },
                    {
                        "c_code": "210323",
                        "c_name": "岫岩满族自治县"
                    },
                    {
                        "c_code": "210381",
                        "c_name": "海城市"
                    }
                ],
                "s_code": "210300"
            },
            {
                "s_name": "抚顺市",
                "c": [{
                        "c_code": "210402",
                        "c_name": "新抚区"
                    },
                    {
                        "c_code": "210403",
                        "c_name": "东洲区"
                    },
                    {
                        "c_code": "210404",
                        "c_name": "望花区"
                    },
                    {
                        "c_code": "210411",
                        "c_name": "顺城区"
                    },
                    {
                        "c_code": "210421",
                        "c_name": "抚顺县"
                    },
                    {
                        "c_code": "210422",
                        "c_name": "新宾满族自治县"
                    },
                    {
                        "c_code": "210423",
                        "c_name": "清原满族自治县"
                    }
                ],
                "s_code": "210400"
            },
            {
                "s_name": "本溪市",
                "c": [{
                        "c_code": "210502",
                        "c_name": "平山区"
                    },
                    {
                        "c_code": "210503",
                        "c_name": "溪湖区"
                    },
                    {
                        "c_code": "210504",
                        "c_name": "明山区"
                    },
                    {
                        "c_code": "210505",
                        "c_name": "南芬区"
                    },
                    {
                        "c_code": "210521",
                        "c_name": "本溪满族自治县"
                    },
                    {
                        "c_code": "210522",
                        "c_name": "桓仁满族自治县"
                    }
                ],
                "s_code": "210500"
            },
            {
                "s_name": "丹东市",
                "c": [{
                        "c_code": "210602",
                        "c_name": "元宝区"
                    },
                    {
                        "c_code": "210603",
                        "c_name": "振兴区"
                    },
                    {
                        "c_code": "210604",
                        "c_name": "振安区"
                    },
                    {
                        "c_code": "210624",
                        "c_name": "宽甸满族自治县"
                    },
                    {
                        "c_code": "210681",
                        "c_name": "东港市"
                    },
                    {
                        "c_code": "210682",
                        "c_name": "凤城市"
                    }
                ],
                "s_code": "210600"
            },
            {
                "s_name": "锦州市",
                "c": [{
                        "c_code": "210702",
                        "c_name": "古塔区"
                    },
                    {
                        "c_code": "210703",
                        "c_name": "凌河区"
                    },
                    {
                        "c_code": "210711",
                        "c_name": "太和区"
                    },
                    {
                        "c_code": "210726",
                        "c_name": "黑山县"
                    },
                    {
                        "c_code": "210727",
                        "c_name": "义县"
                    },
                    {
                        "c_code": "210781",
                        "c_name": "凌海市"
                    },
                    {
                        "c_code": "210782",
                        "c_name": "北镇市"
                    }
                ],
                "s_code": "210700"
            },
            {
                "s_name": "营口市",
                "c": [{
                        "c_code": "210802",
                        "c_name": "站前区"
                    },
                    {
                        "c_code": "210803",
                        "c_name": "西市区"
                    },
                    {
                        "c_code": "210804",
                        "c_name": "鲅鱼圈区"
                    },
                    {
                        "c_code": "210811",
                        "c_name": "老边区"
                    },
                    {
                        "c_code": "210881",
                        "c_name": "盖州市"
                    },
                    {
                        "c_code": "210882",
                        "c_name": "大石桥市"
                    }
                ],
                "s_code": "210800"
            },
            {
                "s_name": "阜新市",
                "c": [{
                        "c_code": "210902",
                        "c_name": "海州区"
                    },
                    {
                        "c_code": "210903",
                        "c_name": "新邱区"
                    },
                    {
                        "c_code": "210904",
                        "c_name": "太平区"
                    },
                    {
                        "c_code": "210905",
                        "c_name": "清河门区"
                    },
                    {
                        "c_code": "210911",
                        "c_name": "细河区"
                    },
                    {
                        "c_code": "210921",
                        "c_name": "阜新蒙古族自治县"
                    },
                    {
                        "c_code": "210922",
                        "c_name": "彰武县"
                    }
                ],
                "s_code": "210900"
            },
            {
                "s_name": "辽阳市",
                "c": [{
                        "c_code": "211002",
                        "c_name": "白塔区"
                    },
                    {
                        "c_code": "211003",
                        "c_name": "文圣区"
                    },
                    {
                        "c_code": "211004",
                        "c_name": "宏伟区"
                    },
                    {
                        "c_code": "211005",
                        "c_name": "弓长岭区"
                    },
                    {
                        "c_code": "211011",
                        "c_name": "太子河区"
                    },
                    {
                        "c_code": "211021",
                        "c_name": "辽阳县"
                    },
                    {
                        "c_code": "211081",
                        "c_name": "灯塔市"
                    }
                ],
                "s_code": "211000"
            },
            {
                "s_name": "盘锦市",
                "c": [{
                        "c_code": "211102",
                        "c_name": "双台子区"
                    },
                    {
                        "c_code": "211103",
                        "c_name": "兴隆台区"
                    },
                    {
                        "c_code": "211121",
                        "c_name": "大洼县"
                    },
                    {
                        "c_code": "211122",
                        "c_name": "盘山县"
                    }
                ],
                "s_code": "211100"
            },
            {
                "s_name": "铁岭市",
                "c": [{
                        "c_code": "211202",
                        "c_name": "银州区"
                    },
                    {
                        "c_code": "211204",
                        "c_name": "清河区"
                    },
                    {
                        "c_code": "211221",
                        "c_name": "铁岭县"
                    },
                    {
                        "c_code": "211223",
                        "c_name": "西丰县"
                    },
                    {
                        "c_code": "211224",
                        "c_name": "昌图县"
                    },
                    {
                        "c_code": "211281",
                        "c_name": "调兵山市"
                    },
                    {
                        "c_code": "211282",
                        "c_name": "开原市"
                    }
                ],
                "s_code": "211200"
            },
            {
                "s_name": "朝阳市",
                "c": [{
                        "c_code": "211302",
                        "c_name": "双塔区"
                    },
                    {
                        "c_code": "211303",
                        "c_name": "龙城区"
                    },
                    {
                        "c_code": "211321",
                        "c_name": "朝阳县"
                    },
                    {
                        "c_code": "211322",
                        "c_name": "建平县"
                    },
                    {
                        "c_code": "211324",
                        "c_name": "喀喇沁左翼蒙古族自治县"
                    },
                    {
                        "c_code": "211381",
                        "c_name": "北票市"
                    },
                    {
                        "c_code": "211382",
                        "c_name": "凌源市"
                    }
                ],
                "s_code": "211300"
            },
            {
                "s_name": "葫芦岛市",
                "c": [{
                        "c_code": "211402",
                        "c_name": "连山区"
                    },
                    {
                        "c_code": "211403",
                        "c_name": "龙港区"
                    },
                    {
                        "c_code": "211404",
                        "c_name": "南票区"
                    },
                    {
                        "c_code": "211421",
                        "c_name": "绥中县"
                    },
                    {
                        "c_code": "211422",
                        "c_name": "建昌县"
                    },
                    {
                        "c_code": "211481",
                        "c_name": "兴城市"
                    }
                ],
                "s_code": "211400"
            }
        ],
        "p_code": "210000"
    },
    {
        "p_name": "吉林省",
        "s": [{
                "s_name": "长春市",
                "c": [{
                        "c_code": "220102",
                        "c_name": "南关区"
                    },
                    {
                        "c_code": "220103",
                        "c_name": "宽城区"
                    },
                    {
                        "c_code": "220104",
                        "c_name": "朝阳区"
                    },
                    {
                        "c_code": "220105",
                        "c_name": "二道区"
                    },
                    {
                        "c_code": "220106",
                        "c_name": "绿园区"
                    },
                    {
                        "c_code": "220112",
                        "c_name": "双阳区"
                    },
                    {
                        "c_code": "220122",
                        "c_name": "农安县"
                    },
                    {
                        "c_code": "220181",
                        "c_name": "九台市"
                    },
                    {
                        "c_code": "220182",
                        "c_name": "榆树市"
                    },
                    {
                        "c_code": "220183",
                        "c_name": "德惠市"
                    }
                ],
                "s_code": "220100"
            },
            {
                "s_name": "吉林市",
                "c": [{
                        "c_code": "220202",
                        "c_name": "昌邑区"
                    },
                    {
                        "c_code": "220203",
                        "c_name": "龙潭区"
                    },
                    {
                        "c_code": "220204",
                        "c_name": "船营区"
                    },
                    {
                        "c_code": "220211",
                        "c_name": "丰满区"
                    },
                    {
                        "c_code": "220221",
                        "c_name": "永吉县"
                    },
                    {
                        "c_code": "220281",
                        "c_name": "蛟河市"
                    },
                    {
                        "c_code": "220282",
                        "c_name": "桦甸市"
                    },
                    {
                        "c_code": "220283",
                        "c_name": "舒兰市"
                    },
                    {
                        "c_code": "220284",
                        "c_name": "磐石市"
                    }
                ],
                "s_code": "220200"
            },
            {
                "s_name": "四平市",
                "c": [{
                        "c_code": "220302",
                        "c_name": "铁西区"
                    },
                    {
                        "c_code": "220303",
                        "c_name": "铁东区"
                    },
                    {
                        "c_code": "220322",
                        "c_name": "梨树县"
                    },
                    {
                        "c_code": "220323",
                        "c_name": "伊通满族自治县"
                    },
                    {
                        "c_code": "220381",
                        "c_name": "公主岭市"
                    },
                    {
                        "c_code": "220382",
                        "c_name": "双辽市"
                    }
                ],
                "s_code": "220300"
            },
            {
                "s_name": "辽源市",
                "c": [{
                        "c_code": "220402",
                        "c_name": "龙山区"
                    },
                    {
                        "c_code": "220403",
                        "c_name": "西安区"
                    },
                    {
                        "c_code": "220421",
                        "c_name": "东丰县"
                    },
                    {
                        "c_code": "220422",
                        "c_name": "东辽县"
                    }
                ],
                "s_code": "220400"
            },
            {
                "s_name": "通化市",
                "c": [{
                        "c_code": "220502",
                        "c_name": "东昌区"
                    },
                    {
                        "c_code": "220503",
                        "c_name": "二道江区"
                    },
                    {
                        "c_code": "220521",
                        "c_name": "通化县"
                    },
                    {
                        "c_code": "220523",
                        "c_name": "辉南县"
                    },
                    {
                        "c_code": "220524",
                        "c_name": "柳河县"
                    },
                    {
                        "c_code": "220581",
                        "c_name": "梅河口市"
                    },
                    {
                        "c_code": "220582",
                        "c_name": "集安市"
                    }
                ],
                "s_code": "220500"
            },
            {
                "s_name": "白山市",
                "c": [{
                        "c_code": "220602",
                        "c_name": "八道江区"
                    },
                    {
                        "c_code": "220605",
                        "c_name": "江源区"
                    },
                    {
                        "c_code": "220621",
                        "c_name": "抚松县"
                    },
                    {
                        "c_code": "220622",
                        "c_name": "靖宇县"
                    },
                    {
                        "c_code": "220623",
                        "c_name": "长白朝鲜族自治县"
                    },
                    {
                        "c_code": "220681",
                        "c_name": "临江市"
                    }
                ],
                "s_code": "220600"
            },
            {
                "s_name": "松原市",
                "c": [{
                        "c_code": "220702",
                        "c_name": "宁江区"
                    },
                    {
                        "c_code": "220721",
                        "c_name": "前郭尔罗斯蒙古族自治县"
                    },
                    {
                        "c_code": "220722",
                        "c_name": "长岭县"
                    },
                    {
                        "c_code": "220723",
                        "c_name": "乾安县"
                    },
                    {
                        "c_code": "220724",
                        "c_name": "扶余县"
                    }
                ],
                "s_code": "220700"
            },
            {
                "s_name": "白城市",
                "c": [{
                        "c_code": "220802",
                        "c_name": "洮北区"
                    },
                    {
                        "c_code": "220821",
                        "c_name": "镇赉县"
                    },
                    {
                        "c_code": "220822",
                        "c_name": "通榆县"
                    },
                    {
                        "c_code": "220881",
                        "c_name": "洮南市"
                    },
                    {
                        "c_code": "220882",
                        "c_name": "大安市"
                    }
                ],
                "s_code": "220800"
            },
            {
                "s_name": "延边朝鲜族自治州",
                "c": [{
                        "c_code": "222401",
                        "c_name": "延吉市"
                    },
                    {
                        "c_code": "222402",
                        "c_name": "图们市"
                    },
                    {
                        "c_code": "222403",
                        "c_name": "敦化市"
                    },
                    {
                        "c_code": "222404",
                        "c_name": "珲春市"
                    },
                    {
                        "c_code": "222405",
                        "c_name": "龙井市"
                    },
                    {
                        "c_code": "222406",
                        "c_name": "和龙市"
                    },
                    {
                        "c_code": "222424",
                        "c_name": "汪清县"
                    },
                    {
                        "c_code": "222426",
                        "c_name": "安图县"
                    }
                ],
                "s_code": "222400"
            }
        ],
        "p_code": "220000"
    },
    {
        "p_name": "黑龙江省",
        "s": [{
                "s_name": "哈尔滨市",
                "c": [{
                        "c_code": "230102",
                        "c_name": "道里区"
                    },
                    {
                        "c_code": "230103",
                        "c_name": "南岗区"
                    },
                    {
                        "c_code": "230104",
                        "c_name": "道外区"
                    },
                    {
                        "c_code": "230108",
                        "c_name": "平房区"
                    },
                    {
                        "c_code": "230109",
                        "c_name": "松北区"
                    },
                    {
                        "c_code": "230110",
                        "c_name": "香坊区"
                    },
                    {
                        "c_code": "230111",
                        "c_name": "呼兰区"
                    },
                    {
                        "c_code": "230112",
                        "c_name": "阿城区"
                    },
                    {
                        "c_code": "230123",
                        "c_name": "依兰县"
                    },
                    {
                        "c_code": "230124",
                        "c_name": "方正县"
                    },
                    {
                        "c_code": "230125",
                        "c_name": "宾县"
                    },
                    {
                        "c_code": "230126",
                        "c_name": "巴彦县"
                    },
                    {
                        "c_code": "230127",
                        "c_name": "木兰县"
                    },
                    {
                        "c_code": "230128",
                        "c_name": "通河县"
                    },
                    {
                        "c_code": "230129",
                        "c_name": "延寿县"
                    },
                    {
                        "c_code": "230182",
                        "c_name": "双城市"
                    },
                    {
                        "c_code": "230183",
                        "c_name": "尚志市"
                    },
                    {
                        "c_code": "230184",
                        "c_name": "五常市"
                    }
                ],
                "s_code": "230100"
            },
            {
                "s_name": "齐齐哈尔市",
                "c": [{
                        "c_code": "230202",
                        "c_name": "龙沙区"
                    },
                    {
                        "c_code": "230203",
                        "c_name": "建华区"
                    },
                    {
                        "c_code": "230204",
                        "c_name": "铁锋区"
                    },
                    {
                        "c_code": "230205",
                        "c_name": "昂昂溪区"
                    },
                    {
                        "c_code": "230206",
                        "c_name": "富拉尔基区"
                    },
                    {
                        "c_code": "230207",
                        "c_name": "碾子山区"
                    },
                    {
                        "c_code": "230208",
                        "c_name": "梅里斯达斡尔族区"
                    },
                    {
                        "c_code": "230221",
                        "c_name": "龙江县"
                    },
                    {
                        "c_code": "230223",
                        "c_name": "依安县"
                    },
                    {
                        "c_code": "230224",
                        "c_name": "泰来县"
                    },
                    {
                        "c_code": "230225",
                        "c_name": "甘南县"
                    },
                    {
                        "c_code": "230227",
                        "c_name": "富裕县"
                    },
                    {
                        "c_code": "230229",
                        "c_name": "克山县"
                    },
                    {
                        "c_code": "230230",
                        "c_name": "克东县"
                    },
                    {
                        "c_code": "230231",
                        "c_name": "拜泉县"
                    },
                    {
                        "c_code": "230281",
                        "c_name": "讷河市"
                    }
                ],
                "s_code": "230200"
            },
            {
                "s_name": "鸡西市",
                "c": [{
                        "c_code": "230302",
                        "c_name": "鸡冠区"
                    },
                    {
                        "c_code": "230303",
                        "c_name": "恒山区"
                    },
                    {
                        "c_code": "230304",
                        "c_name": "滴道区"
                    },
                    {
                        "c_code": "230305",
                        "c_name": "梨树区"
                    },
                    {
                        "c_code": "230306",
                        "c_name": "城子河区"
                    },
                    {
                        "c_code": "230307",
                        "c_name": "麻山区"
                    },
                    {
                        "c_code": "230321",
                        "c_name": "鸡东县"
                    },
                    {
                        "c_code": "230381",
                        "c_name": "虎林市"
                    },
                    {
                        "c_code": "230382",
                        "c_name": "密山市"
                    }
                ],
                "s_code": "230300"
            },
            {
                "s_name": "鹤岗市",
                "c": [{
                        "c_code": "230402",
                        "c_name": "向阳区"
                    },
                    {
                        "c_code": "230403",
                        "c_name": "工农区"
                    },
                    {
                        "c_code": "230404",
                        "c_name": "南山区"
                    },
                    {
                        "c_code": "230405",
                        "c_name": "兴安区"
                    },
                    {
                        "c_code": "230406",
                        "c_name": "东山区"
                    },
                    {
                        "c_code": "230407",
                        "c_name": "兴山区"
                    },
                    {
                        "c_code": "230421",
                        "c_name": "萝北县"
                    },
                    {
                        "c_code": "230422",
                        "c_name": "绥滨县"
                    }
                ],
                "s_code": "230400"
            },
            {
                "s_name": "双鸭山市",
                "c": [{
                        "c_code": "230502",
                        "c_name": "尖山区"
                    },
                    {
                        "c_code": "230503",
                        "c_name": "岭东区"
                    },
                    {
                        "c_code": "230505",
                        "c_name": "四方台区"
                    },
                    {
                        "c_code": "230506",
                        "c_name": "宝山区"
                    },
                    {
                        "c_code": "230521",
                        "c_name": "集贤县"
                    },
                    {
                        "c_code": "230522",
                        "c_name": "友谊县"
                    },
                    {
                        "c_code": "230523",
                        "c_name": "宝清县"
                    },
                    {
                        "c_code": "230524",
                        "c_name": "饶河县"
                    }
                ],
                "s_code": "230500"
            },
            {
                "s_name": "大庆市",
                "c": [{
                        "c_code": "230602",
                        "c_name": "萨尔图区"
                    },
                    {
                        "c_code": "230603",
                        "c_name": "龙凤区"
                    },
                    {
                        "c_code": "230604",
                        "c_name": "让胡路区"
                    },
                    {
                        "c_code": "230605",
                        "c_name": "红岗区"
                    },
                    {
                        "c_code": "230606",
                        "c_name": "大同区"
                    },
                    {
                        "c_code": "230621",
                        "c_name": "肇州县"
                    },
                    {
                        "c_code": "230622",
                        "c_name": "肇源县"
                    },
                    {
                        "c_code": "230623",
                        "c_name": "林甸县"
                    },
                    {
                        "c_code": "230624",
                        "c_name": "杜尔伯特蒙古族自治县"
                    }
                ],
                "s_code": "230600"
            },
            {
                "s_name": "伊春市",
                "c": [{
                        "c_code": "230702",
                        "c_name": "伊春区"
                    },
                    {
                        "c_code": "230703",
                        "c_name": "南岔区"
                    },
                    {
                        "c_code": "230704",
                        "c_name": "友好区"
                    },
                    {
                        "c_code": "230705",
                        "c_name": "西林区"
                    },
                    {
                        "c_code": "230706",
                        "c_name": "翠峦区"
                    },
                    {
                        "c_code": "230707",
                        "c_name": "新青区"
                    },
                    {
                        "c_code": "230708",
                        "c_name": "美溪区"
                    },
                    {
                        "c_code": "230709",
                        "c_name": "金山屯区"
                    },
                    {
                        "c_code": "230710",
                        "c_name": "五营区"
                    },
                    {
                        "c_code": "230711",
                        "c_name": "乌马河区"
                    },
                    {
                        "c_code": "230712",
                        "c_name": "汤旺河区"
                    },
                    {
                        "c_code": "230713",
                        "c_name": "带岭区"
                    },
                    {
                        "c_code": "230714",
                        "c_name": "乌伊岭区"
                    },
                    {
                        "c_code": "230715",
                        "c_name": "红星区"
                    },
                    {
                        "c_code": "230716",
                        "c_name": "上甘岭区"
                    },
                    {
                        "c_code": "230722",
                        "c_name": "嘉荫县"
                    },
                    {
                        "c_code": "230781",
                        "c_name": "铁力市"
                    }
                ],
                "s_code": "230700"
            },
            {
                "s_name": "佳木斯市",
                "c": [{
                        "c_code": "230803",
                        "c_name": "向阳区"
                    },
                    {
                        "c_code": "230804",
                        "c_name": "前进区"
                    },
                    {
                        "c_code": "230805",
                        "c_name": "东风区"
                    },
                    {
                        "c_code": "230811",
                        "c_name": "郊区"
                    },
                    {
                        "c_code": "230822",
                        "c_name": "桦南县"
                    },
                    {
                        "c_code": "230826",
                        "c_name": "桦川县"
                    },
                    {
                        "c_code": "230828",
                        "c_name": "汤原县"
                    },
                    {
                        "c_code": "230833",
                        "c_name": "抚远县"
                    },
                    {
                        "c_code": "230881",
                        "c_name": "同江市"
                    },
                    {
                        "c_code": "230882",
                        "c_name": "富锦市"
                    }
                ],
                "s_code": "230800"
            },
            {
                "s_name": "七台河市",
                "c": [{
                        "c_code": "230902",
                        "c_name": "新兴区"
                    },
                    {
                        "c_code": "230903",
                        "c_name": "桃山区"
                    },
                    {
                        "c_code": "230904",
                        "c_name": "茄子河区"
                    },
                    {
                        "c_code": "230921",
                        "c_name": "勃利县"
                    }
                ],
                "s_code": "230900"
            },
            {
                "s_name": "牡丹江市",
                "c": [{
                        "c_code": "231002",
                        "c_name": "东安区"
                    },
                    {
                        "c_code": "231003",
                        "c_name": "阳明区"
                    },
                    {
                        "c_code": "231004",
                        "c_name": "爱民区"
                    },
                    {
                        "c_code": "231005",
                        "c_name": "西安区"
                    },
                    {
                        "c_code": "231024",
                        "c_name": "东宁县"
                    },
                    {
                        "c_code": "231025",
                        "c_name": "林口县"
                    },
                    {
                        "c_code": "231081",
                        "c_name": "绥芬河市"
                    },
                    {
                        "c_code": "231083",
                        "c_name": "海林市"
                    },
                    {
                        "c_code": "231084",
                        "c_name": "宁安市"
                    },
                    {
                        "c_code": "231085",
                        "c_name": "穆棱市"
                    }
                ],
                "s_code": "231000"
            },
            {
                "s_name": "黑河市",
                "c": [{
                        "c_code": "231102",
                        "c_name": "爱辉区"
                    },
                    {
                        "c_code": "231121",
                        "c_name": "嫩江县"
                    },
                    {
                        "c_code": "231123",
                        "c_name": "逊克县"
                    },
                    {
                        "c_code": "231124",
                        "c_name": "孙吴县"
                    },
                    {
                        "c_code": "231181",
                        "c_name": "北安市"
                    },
                    {
                        "c_code": "231182",
                        "c_name": "五大连池市"
                    }
                ],
                "s_code": "231100"
            },
            {
                "s_name": "绥化市",
                "c": [{
                        "c_code": "231202",
                        "c_name": "北林区"
                    },
                    {
                        "c_code": "231221",
                        "c_name": "望奎县"
                    },
                    {
                        "c_code": "231222",
                        "c_name": "兰西县"
                    },
                    {
                        "c_code": "231223",
                        "c_name": "青冈县"
                    },
                    {
                        "c_code": "231224",
                        "c_name": "庆安县"
                    },
                    {
                        "c_code": "231225",
                        "c_name": "明水县"
                    },
                    {
                        "c_code": "231226",
                        "c_name": "绥棱县"
                    },
                    {
                        "c_code": "231281",
                        "c_name": "安达市"
                    },
                    {
                        "c_code": "231282",
                        "c_name": "肇东市"
                    },
                    {
                        "c_code": "231283",
                        "c_name": "海伦市"
                    }
                ],
                "s_code": "231200"
            },
            {
                "s_name": "大兴安岭地区",
                "c": [{
                        "c_code": "232721",
                        "c_name": "呼玛县"
                    },
                    {
                        "c_code": "232722",
                        "c_name": "塔河县"
                    },
                    {
                        "c_code": "232723",
                        "c_name": "漠河县"
                    }
                ],
                "s_code": "232700"
            }
        ],
        "p_code": "230000"
    },
    {
        "p_name": "江苏省",
        "s": [{
                "s_name": "南京市",
                "c": [{
                        "c_code": "320102",
                        "c_name": "玄武区"
                    },
                    {
                        "c_code": "320103",
                        "c_name": "白下区"
                    },
                    {
                        "c_code": "320104",
                        "c_name": "秦淮区"
                    },
                    {
                        "c_code": "320105",
                        "c_name": "建邺区"
                    },
                    {
                        "c_code": "320106",
                        "c_name": "鼓楼区"
                    },
                    {
                        "c_code": "320107",
                        "c_name": "下关区"
                    },
                    {
                        "c_code": "320111",
                        "c_name": "浦口区"
                    },
                    {
                        "c_code": "320113",
                        "c_name": "栖霞区"
                    },
                    {
                        "c_code": "320114",
                        "c_name": "雨花台区"
                    },
                    {
                        "c_code": "320115",
                        "c_name": "江宁区"
                    },
                    {
                        "c_code": "320116",
                        "c_name": "六合区"
                    },
                    {
                        "c_code": "320124",
                        "c_name": "溧水县"
                    },
                    {
                        "c_code": "320125",
                        "c_name": "高淳县"
                    }
                ],
                "s_code": "320100"
            },
            {
                "s_name": "无锡市",
                "c": [{
                        "c_code": "320202",
                        "c_name": "崇安区"
                    },
                    {
                        "c_code": "320203",
                        "c_name": "南长区"
                    },
                    {
                        "c_code": "320204",
                        "c_name": "北塘区"
                    },
                    {
                        "c_code": "320205",
                        "c_name": "锡山区"
                    },
                    {
                        "c_code": "320206",
                        "c_name": "惠山区"
                    },
                    {
                        "c_code": "320211",
                        "c_name": "滨湖区"
                    },
                    {
                        "c_code": "320281",
                        "c_name": "江阴市"
                    },
                    {
                        "c_code": "320282",
                        "c_name": "宜兴市"
                    }
                ],
                "s_code": "320200"
            },
            {
                "s_name": "徐州市",
                "c": [{
                        "c_code": "320302",
                        "c_name": "鼓楼区"
                    },
                    {
                        "c_code": "320303",
                        "c_name": "云龙区"
                    },
                    {
                        "c_code": "320304",
                        "c_name": "九里区"
                    },
                    {
                        "c_code": "320305",
                        "c_name": "贾汪区"
                    },
                    {
                        "c_code": "320311",
                        "c_name": "泉山区"
                    },
                    {
                        "c_code": "320321",
                        "c_name": "丰县"
                    },
                    {
                        "c_code": "320322",
                        "c_name": "沛县"
                    },
                    {
                        "c_code": "320323",
                        "c_name": "铜山县"
                    },
                    {
                        "c_code": "320324",
                        "c_name": "睢宁县"
                    },
                    {
                        "c_code": "320381",
                        "c_name": "新沂市"
                    },
                    {
                        "c_code": "320382",
                        "c_name": "邳州市"
                    }
                ],
                "s_code": "320300"
            },
            {
                "s_name": "常州市",
                "c": [{
                        "c_code": "320402",
                        "c_name": "天宁区"
                    },
                    {
                        "c_code": "320404",
                        "c_name": "钟楼区"
                    },
                    {
                        "c_code": "320405",
                        "c_name": "戚墅堰区"
                    },
                    {
                        "c_code": "320411",
                        "c_name": "新北区"
                    },
                    {
                        "c_code": "320412",
                        "c_name": "武进区"
                    },
                    {
                        "c_code": "320481",
                        "c_name": "溧阳市"
                    },
                    {
                        "c_code": "320482",
                        "c_name": "金坛市"
                    }
                ],
                "s_code": "320400"
            },
            {
                "s_name": "苏州市",
                "c": [{
                        "c_code": "320502",
                        "c_name": "沧浪区"
                    },
                    {
                        "c_code": "320503",
                        "c_name": "平江区"
                    },
                    {
                        "c_code": "320504",
                        "c_name": "金阊区"
                    },
                    {
                        "c_code": "320505",
                        "c_name": "虎丘区"
                    },
                    {
                        "c_code": "320506",
                        "c_name": "吴中区"
                    },
                    {
                        "c_code": "320507",
                        "c_name": "相城区"
                    },
                    {
                        "c_code": "320581",
                        "c_name": "常熟市"
                    },
                    {
                        "c_code": "320582",
                        "c_name": "张家港市"
                    },
                    {
                        "c_code": "320583",
                        "c_name": "昆山市"
                    },
                    {
                        "c_code": "320584",
                        "c_name": "吴江市"
                    },
                    {
                        "c_code": "320585",
                        "c_name": "太仓市"
                    }
                ],
                "s_code": "320500"
            },
            {
                "s_name": "南通市",
                "c": [{
                        "c_code": "320602",
                        "c_name": "崇川区"
                    },
                    {
                        "c_code": "320611",
                        "c_name": "港闸区"
                    },
                    {
                        "c_code": "320612",
                        "c_name": "通州区"
                    },
                    {
                        "c_code": "320621",
                        "c_name": "海安县"
                    },
                    {
                        "c_code": "320623",
                        "c_name": "如东县"
                    },
                    {
                        "c_code": "320681",
                        "c_name": "启东市"
                    },
                    {
                        "c_code": "320682",
                        "c_name": "如皋市"
                    },
                    {
                        "c_code": "320684",
                        "c_name": "海门市"
                    }
                ],
                "s_code": "320600"
            },
            {
                "s_name": "连云港市",
                "c": [{
                        "c_code": "320703",
                        "c_name": "连云区"
                    },
                    {
                        "c_code": "320705",
                        "c_name": "新浦区"
                    },
                    {
                        "c_code": "320706",
                        "c_name": "海州区"
                    },
                    {
                        "c_code": "320721",
                        "c_name": "赣榆县"
                    },
                    {
                        "c_code": "320722",
                        "c_name": "东海县"
                    },
                    {
                        "c_code": "320723",
                        "c_name": "灌云县"
                    },
                    {
                        "c_code": "320724",
                        "c_name": "灌南县"
                    }
                ],
                "s_code": "320700"
            },
            {
                "s_name": "淮安市",
                "c": [{
                        "c_code": "320802",
                        "c_name": "清河区"
                    },
                    {
                        "c_code": "320803",
                        "c_name": "楚州区"
                    },
                    {
                        "c_code": "320804",
                        "c_name": "淮阴区"
                    },
                    {
                        "c_code": "320811",
                        "c_name": "清浦区"
                    },
                    {
                        "c_code": "320826",
                        "c_name": "涟水县"
                    },
                    {
                        "c_code": "320829",
                        "c_name": "洪泽县"
                    },
                    {
                        "c_code": "320830",
                        "c_name": "盱眙县"
                    },
                    {
                        "c_code": "320831",
                        "c_name": "金湖县"
                    }
                ],
                "s_code": "320800"
            },
            {
                "s_name": "盐城市",
                "c": [{
                        "c_code": "320902",
                        "c_name": "亭湖区"
                    },
                    {
                        "c_code": "320903",
                        "c_name": "盐都区"
                    },
                    {
                        "c_code": "320921",
                        "c_name": "响水县"
                    },
                    {
                        "c_code": "320922",
                        "c_name": "滨海县"
                    },
                    {
                        "c_code": "320923",
                        "c_name": "阜宁县"
                    },
                    {
                        "c_code": "320924",
                        "c_name": "射阳县"
                    },
                    {
                        "c_code": "320925",
                        "c_name": "建湖县"
                    },
                    {
                        "c_code": "320981",
                        "c_name": "东台市"
                    },
                    {
                        "c_code": "320982",
                        "c_name": "大丰市"
                    }
                ],
                "s_code": "320900"
            },
            {
                "s_name": "扬州市",
                "c": [{
                        "c_code": "321002",
                        "c_name": "广陵区"
                    },
                    {
                        "c_code": "321003",
                        "c_name": "邗江区"
                    },
                    {
                        "c_code": "321011",
                        "c_name": "维扬区"
                    },
                    {
                        "c_code": "321023",
                        "c_name": "宝应县"
                    },
                    {
                        "c_code": "321081",
                        "c_name": "仪征市"
                    },
                    {
                        "c_code": "321084",
                        "c_name": "高邮市"
                    },
                    {
                        "c_code": "321088",
                        "c_name": "江都市"
                    }
                ],
                "s_code": "321000"
            },
            {
                "s_name": "镇江市",
                "c": [{
                        "c_code": "321102",
                        "c_name": "京口区"
                    },
                    {
                        "c_code": "321111",
                        "c_name": "润州区"
                    },
                    {
                        "c_code": "321112",
                        "c_name": "丹徒区"
                    },
                    {
                        "c_code": "321181",
                        "c_name": "丹阳市"
                    },
                    {
                        "c_code": "321182",
                        "c_name": "扬中市"
                    },
                    {
                        "c_code": "321183",
                        "c_name": "句容市"
                    }
                ],
                "s_code": "321100"
            },
            {
                "s_name": "泰州市",
                "c": [{
                        "c_code": "321202",
                        "c_name": "海陵区"
                    },
                    {
                        "c_code": "321203",
                        "c_name": "高港区"
                    },
                    {
                        "c_code": "321281",
                        "c_name": "兴化市"
                    },
                    {
                        "c_code": "321282",
                        "c_name": "靖江市"
                    },
                    {
                        "c_code": "321283",
                        "c_name": "泰兴市"
                    },
                    {
                        "c_code": "321284",
                        "c_name": "姜堰市"
                    }
                ],
                "s_code": "321200"
            },
            {
                "s_name": "宿迁市",
                "c": [{
                        "c_code": "321301",
                        "c_name": "市辖区"
                    },
                    {
                        "c_code": "321302",
                        "c_name": "宿城区"
                    },
                    {
                        "c_code": "321311",
                        "c_name": "宿豫区"
                    },
                    {
                        "c_code": "321322",
                        "c_name": "沭阳县"
                    },
                    {
                        "c_code": "321323",
                        "c_name": "泗阳县"
                    },
                    {
                        "c_code": "321324",
                        "c_name": "泗洪县"
                    }
                ],
                "s_code": "321300"
            }
        ],
        "p_code": "320000"
    },
    {
        "p_name": "浙江省",
        "s": [{
                "s_name": "杭州市",
                "c": [{
                        "c_code": "330102",
                        "c_name": "上城区"
                    },
                    {
                        "c_code": "330103",
                        "c_name": "下城区"
                    },
                    {
                        "c_code": "330104",
                        "c_name": "江干区"
                    },
                    {
                        "c_code": "330105",
                        "c_name": "拱墅区"
                    },
                    {
                        "c_code": "330106",
                        "c_name": "西湖区"
                    },
                    {
                        "c_code": "330108",
                        "c_name": "滨江区"
                    },
                    {
                        "c_code": "330109",
                        "c_name": "萧山区"
                    },
                    {
                        "c_code": "330110",
                        "c_name": "余杭区"
                    },
                    {
                        "c_code": "330122",
                        "c_name": "桐庐县"
                    },
                    {
                        "c_code": "330127",
                        "c_name": "淳安县"
                    },
                    {
                        "c_code": "330182",
                        "c_name": "建德市"
                    },
                    {
                        "c_code": "330183",
                        "c_name": "富阳市"
                    },
                    {
                        "c_code": "330185",
                        "c_name": "临安市"
                    }
                ],
                "s_code": "330100"
            },
            {
                "s_name": "宁波市",
                "c": [{
                        "c_code": "330203",
                        "c_name": "海曙区"
                    },
                    {
                        "c_code": "330204",
                        "c_name": "江东区"
                    },
                    {
                        "c_code": "330205",
                        "c_name": "江北区"
                    },
                    {
                        "c_code": "330206",
                        "c_name": "北仑区"
                    },
                    {
                        "c_code": "330211",
                        "c_name": "镇海区"
                    },
                    {
                        "c_code": "330212",
                        "c_name": "鄞州区"
                    },
                    {
                        "c_code": "330225",
                        "c_name": "象山县"
                    },
                    {
                        "c_code": "330226",
                        "c_name": "宁海县"
                    },
                    {
                        "c_code": "330281",
                        "c_name": "余姚市"
                    },
                    {
                        "c_code": "330282",
                        "c_name": "慈溪市"
                    },
                    {
                        "c_code": "330283",
                        "c_name": "奉化市"
                    }
                ],
                "s_code": "330200"
            },
            {
                "s_name": "温州市",
                "c": [{
                        "c_code": "330302",
                        "c_name": "鹿城区"
                    },
                    {
                        "c_code": "330303",
                        "c_name": "龙湾区"
                    },
                    {
                        "c_code": "330304",
                        "c_name": "瓯海区"
                    },
                    {
                        "c_code": "330322",
                        "c_name": "洞头县"
                    },
                    {
                        "c_code": "330324",
                        "c_name": "永嘉县"
                    },
                    {
                        "c_code": "330326",
                        "c_name": "平阳县"
                    },
                    {
                        "c_code": "330327",
                        "c_name": "苍南县"
                    },
                    {
                        "c_code": "330328",
                        "c_name": "文成县"
                    },
                    {
                        "c_code": "330329",
                        "c_name": "泰顺县"
                    },
                    {
                        "c_code": "330381",
                        "c_name": "瑞安市"
                    },
                    {
                        "c_code": "330382",
                        "c_name": "乐清市"
                    }
                ],
                "s_code": "330300"
            },
            {
                "s_name": "嘉兴市",
                "c": [{
                        "c_code": "330402",
                        "c_name": "南湖区"
                    },
                    {
                        "c_code": "330411",
                        "c_name": "秀洲区"
                    },
                    {
                        "c_code": "330421",
                        "c_name": "嘉善县"
                    },
                    {
                        "c_code": "330424",
                        "c_name": "海盐县"
                    },
                    {
                        "c_code": "330481",
                        "c_name": "海宁市"
                    },
                    {
                        "c_code": "330482",
                        "c_name": "平湖市"
                    },
                    {
                        "c_code": "330483",
                        "c_name": "桐乡市"
                    }
                ],
                "s_code": "330400"
            },
            {
                "s_name": "湖州市",
                "c": [{
                        "c_code": "330502",
                        "c_name": "吴兴区"
                    },
                    {
                        "c_code": "330503",
                        "c_name": "南浔区"
                    },
                    {
                        "c_code": "330521",
                        "c_name": "德清县"
                    },
                    {
                        "c_code": "330522",
                        "c_name": "长兴县"
                    },
                    {
                        "c_code": "330523",
                        "c_name": "安吉县"
                    }
                ],
                "s_code": "330500"
            },
            {
                "s_name": "绍兴市",
                "c": [{
                        "c_code": "330602",
                        "c_name": "越城区"
                    },
                    {
                        "c_code": "330621",
                        "c_name": "绍兴县"
                    },
                    {
                        "c_code": "330624",
                        "c_name": "新昌县"
                    },
                    {
                        "c_code": "330681",
                        "c_name": "诸暨市"
                    },
                    {
                        "c_code": "330682",
                        "c_name": "上虞市"
                    },
                    {
                        "c_code": "330683",
                        "c_name": "嵊州市"
                    }
                ],
                "s_code": "330600"
            },
            {
                "s_name": "金华市",
                "c": [{
                        "c_code": "330702",
                        "c_name": "婺城区"
                    },
                    {
                        "c_code": "330703",
                        "c_name": "金东区"
                    },
                    {
                        "c_code": "330723",
                        "c_name": "武义县"
                    },
                    {
                        "c_code": "330726",
                        "c_name": "浦江县"
                    },
                    {
                        "c_code": "330727",
                        "c_name": "磐安县"
                    },
                    {
                        "c_code": "330781",
                        "c_name": "兰溪市"
                    },
                    {
                        "c_code": "330782",
                        "c_name": "义乌市"
                    },
                    {
                        "c_code": "330783",
                        "c_name": "东阳市"
                    },
                    {
                        "c_code": "330784",
                        "c_name": "永康市"
                    }
                ],
                "s_code": "330700"
            },
            {
                "s_name": "衢州市",
                "c": [{
                        "c_code": "330802",
                        "c_name": "柯城区"
                    },
                    {
                        "c_code": "330803",
                        "c_name": "衢江区"
                    },
                    {
                        "c_code": "330822",
                        "c_name": "常山县"
                    },
                    {
                        "c_code": "330824",
                        "c_name": "开化县"
                    },
                    {
                        "c_code": "330825",
                        "c_name": "龙游县"
                    },
                    {
                        "c_code": "330881",
                        "c_name": "江山市"
                    }
                ],
                "s_code": "330800"
            },
            {
                "s_name": "舟山市",
                "c": [{
                        "c_code": "330902",
                        "c_name": "定海区"
                    },
                    {
                        "c_code": "330903",
                        "c_name": "普陀区"
                    },
                    {
                        "c_code": "330921",
                        "c_name": "岱山县"
                    },
                    {
                        "c_code": "330922",
                        "c_name": "嵊泗县"
                    }
                ],
                "s_code": "330900"
            },
            {
                "s_name": "台州市",
                "c": [{
                        "c_code": "331002",
                        "c_name": "椒江区"
                    },
                    {
                        "c_code": "331003",
                        "c_name": "黄岩区"
                    },
                    {
                        "c_code": "331004",
                        "c_name": "路桥区"
                    },
                    {
                        "c_code": "331021",
                        "c_name": "玉环县"
                    },
                    {
                        "c_code": "331022",
                        "c_name": "三门县"
                    },
                    {
                        "c_code": "331023",
                        "c_name": "天台县"
                    },
                    {
                        "c_code": "331024",
                        "c_name": "仙居县"
                    },
                    {
                        "c_code": "331081",
                        "c_name": "温岭市"
                    },
                    {
                        "c_code": "331082",
                        "c_name": "临海市"
                    }
                ],
                "s_code": "331000"
            },
            {
                "s_name": "丽水市",
                "c": [{
                        "c_code": "331102",
                        "c_name": "莲都区"
                    },
                    {
                        "c_code": "331121",
                        "c_name": "青田县"
                    },
                    {
                        "c_code": "331122",
                        "c_name": "缙云县"
                    },
                    {
                        "c_code": "331123",
                        "c_name": "遂昌县"
                    },
                    {
                        "c_code": "331124",
                        "c_name": "松阳县"
                    },
                    {
                        "c_code": "331125",
                        "c_name": "云和县"
                    },
                    {
                        "c_code": "331126",
                        "c_name": "庆元县"
                    },
                    {
                        "c_code": "331127",
                        "c_name": "景宁畲族自治县"
                    },
                    {
                        "c_code": "331181",
                        "c_name": "龙泉市"
                    }
                ],
                "s_code": "331100"
            }
        ],
        "p_code": "330000"
    },
    {
        "p_name": "安徽省",
        "s": [{
                "s_name": "合肥市",
                "c": [{
                        "c_code": "340102",
                        "c_name": "瑶海区"
                    },
                    {
                        "c_code": "340103",
                        "c_name": "庐阳区"
                    },
                    {
                        "c_code": "340104",
                        "c_name": "蜀山区"
                    },
                    {
                        "c_code": "340111",
                        "c_name": "包河区"
                    },
                    {
                        "c_code": "340121",
                        "c_name": "长丰县"
                    },
                    {
                        "c_code": "340122",
                        "c_name": "肥东县"
                    },
                    {
                        "c_code": "340123",
                        "c_name": "肥西县"
                    }
                ],
                "s_code": "340100"
            },
            {
                "s_name": "芜湖市",
                "c": [{
                        "c_code": "340202",
                        "c_name": "镜湖区"
                    },
                    {
                        "c_code": "340203",
                        "c_name": "弋江区"
                    },
                    {
                        "c_code": "340207",
                        "c_name": "鸠江区"
                    },
                    {
                        "c_code": "340208",
                        "c_name": "三山区"
                    },
                    {
                        "c_code": "340221",
                        "c_name": "芜湖县"
                    },
                    {
                        "c_code": "340222",
                        "c_name": "繁昌县"
                    },
                    {
                        "c_code": "340223",
                        "c_name": "南陵县"
                    }
                ],
                "s_code": "340200"
            },
            {
                "s_name": "蚌埠市",
                "c": [{
                        "c_code": "340302",
                        "c_name": "龙子湖区"
                    },
                    {
                        "c_code": "340303",
                        "c_name": "蚌山区"
                    },
                    {
                        "c_code": "340304",
                        "c_name": "禹会区"
                    },
                    {
                        "c_code": "340311",
                        "c_name": "淮上区"
                    },
                    {
                        "c_code": "340321",
                        "c_name": "怀远县"
                    },
                    {
                        "c_code": "340322",
                        "c_name": "五河县"
                    },
                    {
                        "c_code": "340323",
                        "c_name": "固镇县"
                    }
                ],
                "s_code": "340300"
            },
            {
                "s_name": "淮南市",
                "c": [{
                        "c_code": "340402",
                        "c_name": "大通区"
                    },
                    {
                        "c_code": "340403",
                        "c_name": "田家庵区"
                    },
                    {
                        "c_code": "340404",
                        "c_name": "谢家集区"
                    },
                    {
                        "c_code": "340405",
                        "c_name": "八公山区"
                    },
                    {
                        "c_code": "340406",
                        "c_name": "潘集区"
                    },
                    {
                        "c_code": "340421",
                        "c_name": "凤台县"
                    }
                ],
                "s_code": "340400"
            },
            {
                "s_name": "马鞍山市",
                "c": [{
                        "c_code": "340502",
                        "c_name": "金家庄区"
                    },
                    {
                        "c_code": "340503",
                        "c_name": "花山区"
                    },
                    {
                        "c_code": "340504",
                        "c_name": "雨山区"
                    },
                    {
                        "c_code": "340521",
                        "c_name": "当涂县"
                    }
                ],
                "s_code": "340500"
            },
            {
                "s_name": "淮北市",
                "c": [{
                        "c_code": "340602",
                        "c_name": "杜集区"
                    },
                    {
                        "c_code": "340603",
                        "c_name": "相山区"
                    },
                    {
                        "c_code": "340604",
                        "c_name": "烈山区"
                    },
                    {
                        "c_code": "340621",
                        "c_name": "濉溪县"
                    }
                ],
                "s_code": "340600"
            },
            {
                "s_name": "铜陵市",
                "c": [{
                        "c_code": "340702",
                        "c_name": "铜官山区"
                    },
                    {
                        "c_code": "340703",
                        "c_name": "狮子山区"
                    },
                    {
                        "c_code": "340711",
                        "c_name": "郊区"
                    },
                    {
                        "c_code": "340721",
                        "c_name": "铜陵县"
                    }
                ],
                "s_code": "340700"
            },
            {
                "s_name": "安庆市",
                "c": [{
                        "c_code": "340802",
                        "c_name": "迎江区"
                    },
                    {
                        "c_code": "340803",
                        "c_name": "大观区"
                    },
                    {
                        "c_code": "340811",
                        "c_name": "宜秀区"
                    },
                    {
                        "c_code": "340822",
                        "c_name": "怀宁县"
                    },
                    {
                        "c_code": "340823",
                        "c_name": "枞阳县"
                    },
                    {
                        "c_code": "340824",
                        "c_name": "潜山县"
                    },
                    {
                        "c_code": "340825",
                        "c_name": "太湖县"
                    },
                    {
                        "c_code": "340826",
                        "c_name": "宿松县"
                    },
                    {
                        "c_code": "340827",
                        "c_name": "望江县"
                    },
                    {
                        "c_code": "340828",
                        "c_name": "岳西县"
                    },
                    {
                        "c_code": "340881",
                        "c_name": "桐城市"
                    }
                ],
                "s_code": "340800"
            },
            {
                "s_name": "黄山市",
                "c": [{
                        "c_code": "341002",
                        "c_name": "屯溪区"
                    },
                    {
                        "c_code": "341003",
                        "c_name": "黄山区"
                    },
                    {
                        "c_code": "341004",
                        "c_name": "徽州区"
                    },
                    {
                        "c_code": "341021",
                        "c_name": "歙县"
                    },
                    {
                        "c_code": "341022",
                        "c_name": "休宁县"
                    },
                    {
                        "c_code": "341023",
                        "c_name": "黟县"
                    },
                    {
                        "c_code": "341024",
                        "c_name": "祁门县"
                    }
                ],
                "s_code": "341000"
            },
            {
                "s_name": "滁州市",
                "c": [{
                        "c_code": "341102",
                        "c_name": "琅琊区"
                    },
                    {
                        "c_code": "341103",
                        "c_name": "南谯区"
                    },
                    {
                        "c_code": "341122",
                        "c_name": "来安县"
                    },
                    {
                        "c_code": "341124",
                        "c_name": "全椒县"
                    },
                    {
                        "c_code": "341125",
                        "c_name": "定远县"
                    },
                    {
                        "c_code": "341126",
                        "c_name": "凤阳县"
                    },
                    {
                        "c_code": "341181",
                        "c_name": "天长市"
                    },
                    {
                        "c_code": "341182",
                        "c_name": "明光市"
                    }
                ],
                "s_code": "341100"
            },
            {
                "s_name": "阜阳市",
                "c": [{
                        "c_code": "341202",
                        "c_name": "颍州区"
                    },
                    {
                        "c_code": "341203",
                        "c_name": "颍东区"
                    },
                    {
                        "c_code": "341204",
                        "c_name": "颍泉区"
                    },
                    {
                        "c_code": "341221",
                        "c_name": "临泉县"
                    },
                    {
                        "c_code": "341222",
                        "c_name": "太和县"
                    },
                    {
                        "c_code": "341225",
                        "c_name": "阜南县"
                    },
                    {
                        "c_code": "341226",
                        "c_name": "颍上县"
                    },
                    {
                        "c_code": "341282",
                        "c_name": "界首市"
                    }
                ],
                "s_code": "341200"
            },
            {
                "s_name": "宿州市",
                "c": [{
                        "c_code": "341320",
                        "c_name": "埇桥区"
                    },
                    {
                        "c_code": "341321",
                        "c_name": "砀山县"
                    },
                    {
                        "c_code": "341322",
                        "c_name": "萧县"
                    },
                    {
                        "c_code": "341323",
                        "c_name": "灵璧县"
                    },
                    {
                        "c_code": "341324",
                        "c_name": "泗县"
                    }
                ],
                "s_code": "341300"
            },
            {
                "s_name": "巢湖市",
                "c": [{
                        "c_code": "341402",
                        "c_name": "居巢区"
                    },
                    {
                        "c_code": "341421",
                        "c_name": "庐江县"
                    },
                    {
                        "c_code": "341422",
                        "c_name": "无为县"
                    },
                    {
                        "c_code": "341423",
                        "c_name": "含山县"
                    },
                    {
                        "c_code": "341424",
                        "c_name": "和县"
                    }
                ],
                "s_code": "341400"
            },
            {
                "s_name": "六安市",
                "c": [{
                        "c_code": "341502",
                        "c_name": "金安区"
                    },
                    {
                        "c_code": "341503",
                        "c_name": "裕安区"
                    },
                    {
                        "c_code": "341521",
                        "c_name": "寿县"
                    },
                    {
                        "c_code": "341522",
                        "c_name": "霍邱县"
                    },
                    {
                        "c_code": "341523",
                        "c_name": "舒城县"
                    },
                    {
                        "c_code": "341524",
                        "c_name": "金寨县"
                    },
                    {
                        "c_code": "341525",
                        "c_name": "霍山县"
                    }
                ],
                "s_code": "341500"
            },
            {
                "s_name": "亳州市",
                "c": [{
                        "c_code": "341602",
                        "c_name": "谯城区"
                    },
                    {
                        "c_code": "341621",
                        "c_name": "涡阳县"
                    },
                    {
                        "c_code": "341622",
                        "c_name": "蒙城县"
                    },
                    {
                        "c_code": "341623",
                        "c_name": "利辛县"
                    }
                ],
                "s_code": "341600"
            },
            {
                "s_name": "池州市",
                "c": [{
                        "c_code": "341702",
                        "c_name": "贵池区"
                    },
                    {
                        "c_code": "341721",
                        "c_name": "东至县"
                    },
                    {
                        "c_code": "341722",
                        "c_name": "石台县"
                    },
                    {
                        "c_code": "341723",
                        "c_name": "青阳县"
                    }
                ],
                "s_code": "341700"
            },
            {
                "s_name": "宣城市",
                "c": [{
                        "c_code": "341802",
                        "c_name": "宣州区"
                    },
                    {
                        "c_code": "341821",
                        "c_name": "郎溪县"
                    },
                    {
                        "c_code": "341822",
                        "c_name": "广德县"
                    },
                    {
                        "c_code": "341823",
                        "c_name": "泾县"
                    },
                    {
                        "c_code": "341824",
                        "c_name": "绩溪县"
                    },
                    {
                        "c_code": "341825",
                        "c_name": "旌德县"
                    },
                    {
                        "c_code": "341881",
                        "c_name": "宁国市"
                    }
                ],
                "s_code": "341800"
            }
        ],
        "p_code": "340000"
    },
    {
        "p_name": "福建省",
        "s": [{
                "s_name": "福州市",
                "c": [{
                        "c_code": "350102",
                        "c_name": "鼓楼区"
                    },
                    {
                        "c_code": "350103",
                        "c_name": "台江区"
                    },
                    {
                        "c_code": "350104",
                        "c_name": "仓山区"
                    },
                    {
                        "c_code": "350105",
                        "c_name": "马尾区"
                    },
                    {
                        "c_code": "350111",
                        "c_name": "晋安区"
                    },
                    {
                        "c_code": "350121",
                        "c_name": "闽侯县"
                    },
                    {
                        "c_code": "350122",
                        "c_name": "连江县"
                    },
                    {
                        "c_code": "350123",
                        "c_name": "罗源县"
                    },
                    {
                        "c_code": "350124",
                        "c_name": "闽清县"
                    },
                    {
                        "c_code": "350125",
                        "c_name": "永泰县"
                    },
                    {
                        "c_code": "350128",
                        "c_name": "平潭县"
                    },
                    {
                        "c_code": "350181",
                        "c_name": "福清市"
                    },
                    {
                        "c_code": "350182",
                        "c_name": "长乐市"
                    }
                ],
                "s_code": "350100"
            },
            {
                "s_name": "厦门市",
                "c": [{
                        "c_code": "350203",
                        "c_name": "思明区"
                    },
                    {
                        "c_code": "350205",
                        "c_name": "海沧区"
                    },
                    {
                        "c_code": "350206",
                        "c_name": "湖里区"
                    },
                    {
                        "c_code": "350211",
                        "c_name": "集美区"
                    },
                    {
                        "c_code": "350212",
                        "c_name": "同安区"
                    },
                    {
                        "c_code": "350213",
                        "c_name": "翔安区"
                    }
                ],
                "s_code": "350200"
            },
            {
                "s_name": "莆田市",
                "c": [{
                        "c_code": "350302",
                        "c_name": "城厢区"
                    },
                    {
                        "c_code": "350303",
                        "c_name": "涵江区"
                    },
                    {
                        "c_code": "350304",
                        "c_name": "荔城区"
                    },
                    {
                        "c_code": "350305",
                        "c_name": "秀屿区"
                    },
                    {
                        "c_code": "350322",
                        "c_name": "仙游县"
                    }
                ],
                "s_code": "350300"
            },
            {
                "s_name": "三明市",
                "c": [{
                        "c_code": "350402",
                        "c_name": "梅列区"
                    },
                    {
                        "c_code": "350403",
                        "c_name": "三元区"
                    },
                    {
                        "c_code": "350421",
                        "c_name": "明溪县"
                    },
                    {
                        "c_code": "350423",
                        "c_name": "清流县"
                    },
                    {
                        "c_code": "350424",
                        "c_name": "宁化县"
                    },
                    {
                        "c_code": "350425",
                        "c_name": "大田县"
                    },
                    {
                        "c_code": "350426",
                        "c_name": "尤溪县"
                    },
                    {
                        "c_code": "350427",
                        "c_name": "沙县"
                    },
                    {
                        "c_code": "350428",
                        "c_name": "将乐县"
                    },
                    {
                        "c_code": "350429",
                        "c_name": "泰宁县"
                    },
                    {
                        "c_code": "350430",
                        "c_name": "建宁县"
                    },
                    {
                        "c_code": "350481",
                        "c_name": "永安市"
                    }
                ],
                "s_code": "350400"
            },
            {
                "s_name": "泉州市",
                "c": [{
                        "c_code": "350502",
                        "c_name": "鲤城区"
                    },
                    {
                        "c_code": "350503",
                        "c_name": "丰泽区"
                    },
                    {
                        "c_code": "350504",
                        "c_name": "洛江区"
                    },
                    {
                        "c_code": "350505",
                        "c_name": "泉港区"
                    },
                    {
                        "c_code": "350521",
                        "c_name": "惠安县"
                    },
                    {
                        "c_code": "350524",
                        "c_name": "安溪县"
                    },
                    {
                        "c_code": "350525",
                        "c_name": "永春县"
                    },
                    {
                        "c_code": "350526",
                        "c_name": "德化县"
                    },
                    {
                        "c_code": "350527",
                        "c_name": "金门县"
                    },
                    {
                        "c_code": "350581",
                        "c_name": "石狮市"
                    },
                    {
                        "c_code": "350582",
                        "c_name": "晋江市"
                    },
                    {
                        "c_code": "350583",
                        "c_name": "南安市"
                    }
                ],
                "s_code": "350500"
            },
            {
                "s_name": "漳州市",
                "c": [{
                        "c_code": "350602",
                        "c_name": "芗城区"
                    },
                    {
                        "c_code": "350603",
                        "c_name": "龙文区"
                    },
                    {
                        "c_code": "350622",
                        "c_name": "云霄县"
                    },
                    {
                        "c_code": "350623",
                        "c_name": "漳浦县"
                    },
                    {
                        "c_code": "350624",
                        "c_name": "诏安县"
                    },
                    {
                        "c_code": "350625",
                        "c_name": "长泰县"
                    },
                    {
                        "c_code": "350626",
                        "c_name": "东山县"
                    },
                    {
                        "c_code": "350627",
                        "c_name": "南靖县"
                    },
                    {
                        "c_code": "350628",
                        "c_name": "平和县"
                    },
                    {
                        "c_code": "350629",
                        "c_name": "华安县"
                    },
                    {
                        "c_code": "350681",
                        "c_name": "龙海市"
                    }
                ],
                "s_code": "350600"
            },
            {
                "s_name": "南平市",
                "c": [{
                        "c_code": "350702",
                        "c_name": "延平区"
                    },
                    {
                        "c_code": "350721",
                        "c_name": "顺昌县"
                    },
                    {
                        "c_code": "350722",
                        "c_name": "浦城县"
                    },
                    {
                        "c_code": "350723",
                        "c_name": "光泽县"
                    },
                    {
                        "c_code": "350724",
                        "c_name": "松溪县"
                    },
                    {
                        "c_code": "350725",
                        "c_name": "政和县"
                    },
                    {
                        "c_code": "350781",
                        "c_name": "邵武市"
                    },
                    {
                        "c_code": "350782",
                        "c_name": "武夷山市"
                    },
                    {
                        "c_code": "350783",
                        "c_name": "建瓯市"
                    },
                    {
                        "c_code": "350784",
                        "c_name": "建阳市"
                    }
                ],
                "s_code": "350700"
            },
            {
                "s_name": "龙岩市",
                "c": [{
                        "c_code": "350802",
                        "c_name": "新罗区"
                    },
                    {
                        "c_code": "350821",
                        "c_name": "长汀县"
                    },
                    {
                        "c_code": "350822",
                        "c_name": "永定县"
                    },
                    {
                        "c_code": "350823",
                        "c_name": "上杭县"
                    },
                    {
                        "c_code": "350824",
                        "c_name": "武平县"
                    },
                    {
                        "c_code": "350825",
                        "c_name": "连城县"
                    },
                    {
                        "c_code": "350881",
                        "c_name": "漳平市"
                    }
                ],
                "s_code": "350800"
            },
            {
                "s_name": "宁德市",
                "c": [{
                        "c_code": "350902",
                        "c_name": "蕉城区"
                    },
                    {
                        "c_code": "350921",
                        "c_name": "霞浦县"
                    },
                    {
                        "c_code": "350922",
                        "c_name": "古田县"
                    },
                    {
                        "c_code": "350923",
                        "c_name": "屏南县"
                    },
                    {
                        "c_code": "350924",
                        "c_name": "寿宁县"
                    },
                    {
                        "c_code": "350925",
                        "c_name": "周宁县"
                    },
                    {
                        "c_code": "350926",
                        "c_name": "柘荣县"
                    },
                    {
                        "c_code": "350981",
                        "c_name": "福安市"
                    },
                    {
                        "c_code": "350982",
                        "c_name": "福鼎市"
                    }
                ],
                "s_code": "350900"
            }
        ],
        "p_code": "350000"
    },
    {
        "p_name": "江西省",
        "s": [{
                "s_name": "南昌市",
                "c": [{
                        "c_code": "360102",
                        "c_name": "东湖区"
                    },
                    {
                        "c_code": "360103",
                        "c_name": "西湖区"
                    },
                    {
                        "c_code": "360104",
                        "c_name": "青云谱区"
                    },
                    {
                        "c_code": "360105",
                        "c_name": "湾里区"
                    },
                    {
                        "c_code": "360111",
                        "c_name": "青山湖区"
                    },
                    {
                        "c_code": "360121",
                        "c_name": "南昌县"
                    },
                    {
                        "c_code": "360122",
                        "c_name": "新建县"
                    },
                    {
                        "c_code": "360123",
                        "c_name": "安义县"
                    },
                    {
                        "c_code": "360124",
                        "c_name": "进贤县"
                    }
                ],
                "s_code": "360100"
            },
            {
                "s_name": "景德镇市",
                "c": [{
                        "c_code": "360202",
                        "c_name": "昌江区"
                    },
                    {
                        "c_code": "360203",
                        "c_name": "珠山区"
                    },
                    {
                        "c_code": "360222",
                        "c_name": "浮梁县"
                    },
                    {
                        "c_code": "360281",
                        "c_name": "乐平市"
                    }
                ],
                "s_code": "360200"
            },
            {
                "s_name": "萍乡市",
                "c": [{
                        "c_code": "360302",
                        "c_name": "安源区"
                    },
                    {
                        "c_code": "360313",
                        "c_name": "湘东区"
                    },
                    {
                        "c_code": "360321",
                        "c_name": "莲花县"
                    },
                    {
                        "c_code": "360322",
                        "c_name": "上栗县"
                    },
                    {
                        "c_code": "360323",
                        "c_name": "芦溪县"
                    }
                ],
                "s_code": "360300"
            },
            {
                "s_name": "九江市",
                "c": [{
                        "c_code": "360402",
                        "c_name": "庐山区"
                    },
                    {
                        "c_code": "360403",
                        "c_name": "浔阳区"
                    },
                    {
                        "c_code": "360421",
                        "c_name": "九江县"
                    },
                    {
                        "c_code": "360423",
                        "c_name": "武宁县"
                    },
                    {
                        "c_code": "360424",
                        "c_name": "修水县"
                    },
                    {
                        "c_code": "360425",
                        "c_name": "永修县"
                    },
                    {
                        "c_code": "360426",
                        "c_name": "德安县"
                    },
                    {
                        "c_code": "360427",
                        "c_name": "星子县"
                    },
                    {
                        "c_code": "360428",
                        "c_name": "都昌县"
                    },
                    {
                        "c_code": "360429",
                        "c_name": "湖口县"
                    },
                    {
                        "c_code": "360430",
                        "c_name": "彭泽县"
                    },
                    {
                        "c_code": "360481",
                        "c_name": "瑞昌市"
                    }
                ],
                "s_code": "360400"
            },
            {
                "s_name": "新余市",
                "c": [{
                        "c_code": "360502",
                        "c_name": "渝水区"
                    },
                    {
                        "c_code": "360521",
                        "c_name": "分宜县"
                    }
                ],
                "s_code": "360500"
            },
            {
                "s_name": "鹰潭市",
                "c": [{
                        "c_code": "360602",
                        "c_name": "月湖区"
                    },
                    {
                        "c_code": "360622",
                        "c_name": "余江县"
                    },
                    {
                        "c_code": "360681",
                        "c_name": "贵溪市"
                    }
                ],
                "s_code": "360600"
            },
            {
                "s_name": "赣州市",
                "c": [{
                        "c_code": "360702",
                        "c_name": "章贡区"
                    },
                    {
                        "c_code": "360721",
                        "c_name": "赣县"
                    },
                    {
                        "c_code": "360722",
                        "c_name": "信丰县"
                    },
                    {
                        "c_code": "360723",
                        "c_name": "大余县"
                    },
                    {
                        "c_code": "360724",
                        "c_name": "上犹县"
                    },
                    {
                        "c_code": "360725",
                        "c_name": "崇义县"
                    },
                    {
                        "c_code": "360726",
                        "c_name": "安远县"
                    },
                    {
                        "c_code": "360727",
                        "c_name": "龙南县"
                    },
                    {
                        "c_code": "360728",
                        "c_name": "定南县"
                    },
                    {
                        "c_code": "360729",
                        "c_name": "全南县"
                    },
                    {
                        "c_code": "360730",
                        "c_name": "宁都县"
                    },
                    {
                        "c_code": "360731",
                        "c_name": "于都县"
                    },
                    {
                        "c_code": "360732",
                        "c_name": "兴国县"
                    },
                    {
                        "c_code": "360733",
                        "c_name": "会昌县"
                    },
                    {
                        "c_code": "360734",
                        "c_name": "寻乌县"
                    },
                    {
                        "c_code": "360735",
                        "c_name": "石城县"
                    },
                    {
                        "c_code": "360781",
                        "c_name": "瑞金市"
                    },
                    {
                        "c_code": "360782",
                        "c_name": "南康市"
                    }
                ],
                "s_code": "360700"
            },
            {
                "s_name": "吉安市",
                "c": [{
                        "c_code": "360802",
                        "c_name": "吉州区"
                    },
                    {
                        "c_code": "360803",
                        "c_name": "青原区"
                    },
                    {
                        "c_code": "360821",
                        "c_name": "吉安县"
                    },
                    {
                        "c_code": "360822",
                        "c_name": "吉水县"
                    },
                    {
                        "c_code": "360823",
                        "c_name": "峡江县"
                    },
                    {
                        "c_code": "360824",
                        "c_name": "新干县"
                    },
                    {
                        "c_code": "360825",
                        "c_name": "永丰县"
                    },
                    {
                        "c_code": "360826",
                        "c_name": "泰和县"
                    },
                    {
                        "c_code": "360827",
                        "c_name": "遂川县"
                    },
                    {
                        "c_code": "360828",
                        "c_name": "万安县"
                    },
                    {
                        "c_code": "360829",
                        "c_name": "安福县"
                    },
                    {
                        "c_code": "360830",
                        "c_name": "永新县"
                    },
                    {
                        "c_code": "360881",
                        "c_name": "井冈山市"
                    }
                ],
                "s_code": "360800"
            },
            {
                "s_name": "宜春市",
                "c": [{
                        "c_code": "360902",
                        "c_name": "袁州区"
                    },
                    {
                        "c_code": "360921",
                        "c_name": "奉新县"
                    },
                    {
                        "c_code": "360922",
                        "c_name": "万载县"
                    },
                    {
                        "c_code": "360923",
                        "c_name": "上高县"
                    },
                    {
                        "c_code": "360924",
                        "c_name": "宜丰县"
                    },
                    {
                        "c_code": "360925",
                        "c_name": "靖安县"
                    },
                    {
                        "c_code": "360926",
                        "c_name": "铜鼓县"
                    },
                    {
                        "c_code": "360981",
                        "c_name": "丰城市"
                    },
                    {
                        "c_code": "360982",
                        "c_name": "樟树市"
                    },
                    {
                        "c_code": "360983",
                        "c_name": "高安市"
                    }
                ],
                "s_code": "360900"
            },
            {
                "s_name": "抚州市",
                "c": [{
                        "c_code": "361002",
                        "c_name": "临川区"
                    },
                    {
                        "c_code": "361021",
                        "c_name": "南城县"
                    },
                    {
                        "c_code": "361022",
                        "c_name": "黎川县"
                    },
                    {
                        "c_code": "361023",
                        "c_name": "南丰县"
                    },
                    {
                        "c_code": "361024",
                        "c_name": "崇仁县"
                    },
                    {
                        "c_code": "361025",
                        "c_name": "乐安县"
                    },
                    {
                        "c_code": "361026",
                        "c_name": "宜黄县"
                    },
                    {
                        "c_code": "361027",
                        "c_name": "金溪县"
                    },
                    {
                        "c_code": "361028",
                        "c_name": "资溪县"
                    },
                    {
                        "c_code": "361029",
                        "c_name": "东乡县"
                    },
                    {
                        "c_code": "361030",
                        "c_name": "广昌县"
                    }
                ],
                "s_code": "361000"
            },
            {
                "s_name": "上饶市",
                "c": [{
                        "c_code": "361102",
                        "c_name": "信州区"
                    },
                    {
                        "c_code": "361121",
                        "c_name": "上饶县"
                    },
                    {
                        "c_code": "361122",
                        "c_name": "广丰县"
                    },
                    {
                        "c_code": "361123",
                        "c_name": "玉山县"
                    },
                    {
                        "c_code": "361124",
                        "c_name": "铅山县"
                    },
                    {
                        "c_code": "361125",
                        "c_name": "横峰县"
                    },
                    {
                        "c_code": "361126",
                        "c_name": "弋阳县"
                    },
                    {
                        "c_code": "361127",
                        "c_name": "余干县"
                    },
                    {
                        "c_code": "361128",
                        "c_name": "鄱阳县"
                    },
                    {
                        "c_code": "361129",
                        "c_name": "万年县"
                    },
                    {
                        "c_code": "361130",
                        "c_name": "婺源县"
                    },
                    {
                        "c_code": "361181",
                        "c_name": "德兴市"
                    }
                ],
                "s_code": "361100"
            }
        ],
        "p_code": "360000"
    },
    {
        "p_name": "山东省",
        "s": [{
                "s_name": "济南市",
                "c": [{
                        "c_code": "370102",
                        "c_name": "历下区"
                    },
                    {
                        "c_code": "370103",
                        "c_name": "市中区"
                    },
                    {
                        "c_code": "370104",
                        "c_name": "槐荫区"
                    },
                    {
                        "c_code": "370105",
                        "c_name": "天桥区"
                    },
                    {
                        "c_code": "370112",
                        "c_name": "历城区"
                    },
                    {
                        "c_code": "370113",
                        "c_name": "长清区"
                    },
                    {
                        "c_code": "370124",
                        "c_name": "平阴县"
                    },
                    {
                        "c_code": "370125",
                        "c_name": "济阳县"
                    },
                    {
                        "c_code": "370126",
                        "c_name": "商河县"
                    },
                    {
                        "c_code": "370181",
                        "c_name": "章丘市"
                    }
                ],
                "s_code": "370100"
            },
            {
                "s_name": "青岛市",
                "c": [{
                        "c_code": "370202",
                        "c_name": "市南区"
                    },
                    {
                        "c_code": "370203",
                        "c_name": "市北区"
                    },
                    {
                        "c_code": "370205",
                        "c_name": "四方区"
                    },
                    {
                        "c_code": "370211",
                        "c_name": "黄岛区"
                    },
                    {
                        "c_code": "370212",
                        "c_name": "崂山区"
                    },
                    {
                        "c_code": "370213",
                        "c_name": "李沧区"
                    },
                    {
                        "c_code": "370214",
                        "c_name": "城阳区"
                    },
                    {
                        "c_code": "370281",
                        "c_name": "胶州市"
                    },
                    {
                        "c_code": "370282",
                        "c_name": "即墨市"
                    },
                    {
                        "c_code": "370283",
                        "c_name": "平度市"
                    },
                    {
                        "c_code": "370284",
                        "c_name": "胶南市"
                    },
                    {
                        "c_code": "370285",
                        "c_name": "莱西市"
                    }
                ],
                "s_code": "370200"
            },
            {
                "s_name": "淄博市",
                "c": [{
                        "c_code": "370302",
                        "c_name": "淄川区"
                    },
                    {
                        "c_code": "370303",
                        "c_name": "张店区"
                    },
                    {
                        "c_code": "370304",
                        "c_name": "博山区"
                    },
                    {
                        "c_code": "370305",
                        "c_name": "临淄区"
                    },
                    {
                        "c_code": "370306",
                        "c_name": "周村区"
                    },
                    {
                        "c_code": "370321",
                        "c_name": "桓台县"
                    },
                    {
                        "c_code": "370322",
                        "c_name": "高青县"
                    },
                    {
                        "c_code": "370323",
                        "c_name": "沂源县"
                    }
                ],
                "s_code": "370300"
            },
            {
                "s_name": "枣庄市",
                "c": [{
                        "c_code": "370402",
                        "c_name": "市中区"
                    },
                    {
                        "c_code": "370403",
                        "c_name": "薛城区"
                    },
                    {
                        "c_code": "370404",
                        "c_name": "峄城区"
                    },
                    {
                        "c_code": "370405",
                        "c_name": "台儿庄区"
                    },
                    {
                        "c_code": "370406",
                        "c_name": "山亭区"
                    },
                    {
                        "c_code": "370481",
                        "c_name": "滕州市"
                    }
                ],
                "s_code": "370400"
            },
            {
                "s_name": "东营市",
                "c": [{
                        "c_code": "370502",
                        "c_name": "东营区"
                    },
                    {
                        "c_code": "370503",
                        "c_name": "河口区"
                    },
                    {
                        "c_code": "370521",
                        "c_name": "垦利县"
                    },
                    {
                        "c_code": "370522",
                        "c_name": "利津县"
                    },
                    {
                        "c_code": "370523",
                        "c_name": "广饶县"
                    }
                ],
                "s_code": "370500"
            },
            {
                "s_name": "烟台市",
                "c": [{
                        "c_code": "370602",
                        "c_name": "芝罘区"
                    },
                    {
                        "c_code": "370611",
                        "c_name": "福山区"
                    },
                    {
                        "c_code": "370612",
                        "c_name": "牟平区"
                    },
                    {
                        "c_code": "370613",
                        "c_name": "莱山区"
                    },
                    {
                        "c_code": "370634",
                        "c_name": "长岛县"
                    },
                    {
                        "c_code": "370681",
                        "c_name": "龙口市"
                    },
                    {
                        "c_code": "370682",
                        "c_name": "莱阳市"
                    },
                    {
                        "c_code": "370683",
                        "c_name": "莱州市"
                    },
                    {
                        "c_code": "370684",
                        "c_name": "蓬莱市"
                    },
                    {
                        "c_code": "370685",
                        "c_name": "招远市"
                    },
                    {
                        "c_code": "370686",
                        "c_name": "栖霞市"
                    },
                    {
                        "c_code": "370687",
                        "c_name": "海阳市"
                    }
                ],
                "s_code": "370600"
            },
            {
                "s_name": "潍坊市",
                "c": [{
                        "c_code": "370702",
                        "c_name": "潍城区"
                    },
                    {
                        "c_code": "370703",
                        "c_name": "寒亭区"
                    },
                    {
                        "c_code": "370704",
                        "c_name": "坊子区"
                    },
                    {
                        "c_code": "370705",
                        "c_name": "奎文区"
                    },
                    {
                        "c_code": "370724",
                        "c_name": "临朐县"
                    },
                    {
                        "c_code": "370725",
                        "c_name": "昌乐县"
                    },
                    {
                        "c_code": "370781",
                        "c_name": "青州市"
                    },
                    {
                        "c_code": "370782",
                        "c_name": "诸城市"
                    },
                    {
                        "c_code": "370783",
                        "c_name": "寿光市"
                    },
                    {
                        "c_code": "370784",
                        "c_name": "安丘市"
                    },
                    {
                        "c_code": "370785",
                        "c_name": "高密市"
                    },
                    {
                        "c_code": "370786",
                        "c_name": "昌邑市"
                    }
                ],
                "s_code": "370700"
            },
            {
                "s_name": "济宁市",
                "c": [{
                        "c_code": "370802",
                        "c_name": "市中区"
                    },
                    {
                        "c_code": "370811",
                        "c_name": "任城区"
                    },
                    {
                        "c_code": "370826",
                        "c_name": "微山县"
                    },
                    {
                        "c_code": "370827",
                        "c_name": "鱼台县"
                    },
                    {
                        "c_code": "370828",
                        "c_name": "金乡县"
                    },
                    {
                        "c_code": "370829",
                        "c_name": "嘉祥县"
                    },
                    {
                        "c_code": "370830",
                        "c_name": "汶上县"
                    },
                    {
                        "c_code": "370831",
                        "c_name": "泗水县"
                    },
                    {
                        "c_code": "370832",
                        "c_name": "梁山县"
                    },
                    {
                        "c_code": "370881",
                        "c_name": "曲阜市"
                    },
                    {
                        "c_code": "370882",
                        "c_name": "兖州市"
                    },
                    {
                        "c_code": "370883",
                        "c_name": "邹城市"
                    }
                ],
                "s_code": "370800"
            },
            {
                "s_name": "泰安市",
                "c": [{
                        "c_code": "370902",
                        "c_name": "泰山区"
                    },
                    {
                        "c_code": "370911",
                        "c_name": "岱岳区"
                    },
                    {
                        "c_code": "370921",
                        "c_name": "宁阳县"
                    },
                    {
                        "c_code": "370923",
                        "c_name": "东平县"
                    },
                    {
                        "c_code": "370982",
                        "c_name": "新泰市"
                    },
                    {
                        "c_code": "370983",
                        "c_name": "肥城市"
                    }
                ],
                "s_code": "370900"
            },
            {
                "s_name": "威海市",
                "c": [{
                        "c_code": "371002",
                        "c_name": "环翠区"
                    },
                    {
                        "c_code": "371081",
                        "c_name": "文登市"
                    },
                    {
                        "c_code": "371082",
                        "c_name": "荣成市"
                    },
                    {
                        "c_code": "371083",
                        "c_name": "乳山市"
                    }
                ],
                "s_code": "371000"
            },
            {
                "s_name": "日照市",
                "c": [{
                        "c_code": "371102",
                        "c_name": "东港区"
                    },
                    {
                        "c_code": "371103",
                        "c_name": "岚山区"
                    },
                    {
                        "c_code": "371121",
                        "c_name": "五莲县"
                    },
                    {
                        "c_code": "371122",
                        "c_name": "莒县"
                    }
                ],
                "s_code": "371100"
            },
            {
                "s_name": "莱芜市",
                "c": [{
                        "c_code": "371202",
                        "c_name": "莱城区"
                    },
                    {
                        "c_code": "371203",
                        "c_name": "钢城区"
                    }
                ],
                "s_code": "371200"
            },
            {
                "s_name": "临沂市",
                "c": [{
                        "c_code": "371302",
                        "c_name": "兰山区"
                    },
                    {
                        "c_code": "371311",
                        "c_name": "罗庄区"
                    },
                    {
                        "c_code": "371312",
                        "c_name": "河东区"
                    },
                    {
                        "c_code": "371321",
                        "c_name": "沂南县"
                    },
                    {
                        "c_code": "371322",
                        "c_name": "郯城县"
                    },
                    {
                        "c_code": "371323",
                        "c_name": "沂水县"
                    },
                    {
                        "c_code": "371324",
                        "c_name": "苍山县"
                    },
                    {
                        "c_code": "371325",
                        "c_name": "费县"
                    },
                    {
                        "c_code": "371326",
                        "c_name": "平邑县"
                    },
                    {
                        "c_code": "371327",
                        "c_name": "莒南县"
                    },
                    {
                        "c_code": "371328",
                        "c_name": "蒙阴县"
                    },
                    {
                        "c_code": "371329",
                        "c_name": "临沭县"
                    }
                ],
                "s_code": "371300"
            },
            {
                "s_name": "德州市",
                "c": [{
                        "c_code": "371402",
                        "c_name": "德城区"
                    },
                    {
                        "c_code": "371421",
                        "c_name": "陵城区"
                    },
                    {
                        "c_code": "371422",
                        "c_name": "宁津县"
                    },
                    {
                        "c_code": "371423",
                        "c_name": "庆云县"
                    },
                    {
                        "c_code": "371424",
                        "c_name": "临邑县"
                    },
                    {
                        "c_code": "371425",
                        "c_name": "齐河县"
                    },
                    {
                        "c_code": "371426",
                        "c_name": "平原县"
                    },
                    {
                        "c_code": "371427",
                        "c_name": "夏津县"
                    },
                    {
                        "c_code": "371428",
                        "c_name": "武城县"
                    },
                    {
                        "c_code": "371481",
                        "c_name": "乐陵市"
                    },
                    {
                        "c_code": "371482",
                        "c_name": "禹城市"
                    }
                ],
                "s_code": "371400"
            },
            {
                "s_name": "聊城市",
                "c": [{
                        "c_code": "371502",
                        "c_name": "东昌府区"
                    },
                    {
                        "c_code": "371521",
                        "c_name": "阳谷县"
                    },
                    {
                        "c_code": "371522",
                        "c_name": "莘县"
                    },
                    {
                        "c_code": "371523",
                        "c_name": "茌平县"
                    },
                    {
                        "c_code": "371524",
                        "c_name": "东阿县"
                    },
                    {
                        "c_code": "371525",
                        "c_name": "冠县"
                    },
                    {
                        "c_code": "371526",
                        "c_name": "高唐县"
                    },
                    {
                        "c_code": "371581",
                        "c_name": "临清市"
                    }
                ],
                "s_code": "371500"
            },
            {
                "s_name": "滨州市",
                "c": [{
                        "c_code": "371602",
                        "c_name": "滨城区"
                    },
                    {
                        "c_code": "371621",
                        "c_name": "惠民县"
                    },
                    {
                        "c_code": "371622",
                        "c_name": "阳信县"
                    },
                    {
                        "c_code": "371623",
                        "c_name": "无棣县"
                    },
                    {
                        "c_code": "371624",
                        "c_name": "沾化县"
                    },
                    {
                        "c_code": "371625",
                        "c_name": "博兴县"
                    },
                    {
                        "c_code": "371626",
                        "c_name": "邹平县"
                    }
                ],
                "s_code": "371600"
            },
            {
                "s_name": "菏泽市",
                "c": [{
                        "c_code": "371702",
                        "c_name": "牡丹区"
                    },
                    {
                        "c_code": "371721",
                        "c_name": "曹县"
                    },
                    {
                        "c_code": "371722",
                        "c_name": "单县"
                    },
                    {
                        "c_code": "371723",
                        "c_name": "成武县"
                    },
                    {
                        "c_code": "371724",
                        "c_name": "巨野县"
                    },
                    {
                        "c_code": "371725",
                        "c_name": "郓城县"
                    },
                    {
                        "c_code": "371726",
                        "c_name": "鄄城县"
                    },
                    {
                        "c_code": "371727",
                        "c_name": "定陶县"
                    },
                    {
                        "c_code": "371728",
                        "c_name": "东明县"
                    }
                ],
                "s_code": "371700"
            }
        ],
        "p_code": "370000"
    },
    {
        "p_name": "河南省",
        "s": [{
                "s_name": "郑州市",
                "c": [{
                        "c_code": "410102",
                        "c_name": "中原区"
                    },
                    {
                        "c_code": "410103",
                        "c_name": "二七区"
                    },
                    {
                        "c_code": "410104",
                        "c_name": "管城回族区"
                    },
                    {
                        "c_code": "410105",
                        "c_name": "金水区"
                    },
                    {
                        "c_code": "410106",
                        "c_name": "上街区"
                    },
                    {
                        "c_code": "410108",
                        "c_name": "惠济区"
                    },
                    {
                        "c_code": "410122",
                        "c_name": "中牟县"
                    },
                    {
                        "c_code": "410181",
                        "c_name": "巩义市"
                    },
                    {
                        "c_code": "410182",
                        "c_name": "荥阳市"
                    },
                    {
                        "c_code": "410183",
                        "c_name": "新密市"
                    },
                    {
                        "c_code": "410184",
                        "c_name": "新郑市"
                    },
                    {
                        "c_code": "410185",
                        "c_name": "登封市"
                    }
                ],
                "s_code": "410100"
            },
            {
                "s_name": "开封市",
                "c": [{
                        "c_code": "410202",
                        "c_name": "龙亭区"
                    },
                    {
                        "c_code": "410203",
                        "c_name": "顺河回族区"
                    },
                    {
                        "c_code": "410204",
                        "c_name": "鼓楼区"
                    },
                    {
                        "c_code": "410205",
                        "c_name": "禹王台区"
                    },
                    {
                        "c_code": "410211",
                        "c_name": "金明区"
                    },
                    {
                        "c_code": "410221",
                        "c_name": "杞县"
                    },
                    {
                        "c_code": "410222",
                        "c_name": "通许县"
                    },
                    {
                        "c_code": "410223",
                        "c_name": "尉氏县"
                    },
                    {
                        "c_code": "410224",
                        "c_name": "开封县"
                    },
                    {
                        "c_code": "410225",
                        "c_name": "兰考县"
                    }
                ],
                "s_code": "410200"
            },
            {
                "s_name": "洛阳市",
                "c": [{
                        "c_code": "410302",
                        "c_name": "老城区"
                    },
                    {
                        "c_code": "410303",
                        "c_name": "西工区"
                    },
                    {
                        "c_code": "410304",
                        "c_name": "瀍河回族区"
                    },
                    {
                        "c_code": "410305",
                        "c_name": "涧西区"
                    },
                    {
                        "c_code": "410306",
                        "c_name": "吉利区"
                    },
                    {
                        "c_code": "410311",
                        "c_name": "洛龙区"
                    },
                    {
                        "c_code": "410322",
                        "c_name": "孟津县"
                    },
                    {
                        "c_code": "410323",
                        "c_name": "新安县"
                    },
                    {
                        "c_code": "410324",
                        "c_name": "栾川县"
                    },
                    {
                        "c_code": "410325",
                        "c_name": "嵩县"
                    },
                    {
                        "c_code": "410326",
                        "c_name": "汝阳县"
                    },
                    {
                        "c_code": "410327",
                        "c_name": "宜阳县"
                    },
                    {
                        "c_code": "410328",
                        "c_name": "洛宁县"
                    },
                    {
                        "c_code": "410329",
                        "c_name": "伊川县"
                    },
                    {
                        "c_code": "410381",
                        "c_name": "偃师市"
                    }
                ],
                "s_code": "410300"
            },
            {
                "s_name": "平顶山市",
                "c": [{
                        "c_code": "410402",
                        "c_name": "新华区"
                    },
                    {
                        "c_code": "410403",
                        "c_name": "卫东区"
                    },
                    {
                        "c_code": "410404",
                        "c_name": "石龙区"
                    },
                    {
                        "c_code": "410411",
                        "c_name": "湛河区"
                    },
                    {
                        "c_code": "410421",
                        "c_name": "宝丰县"
                    },
                    {
                        "c_code": "410422",
                        "c_name": "叶县"
                    },
                    {
                        "c_code": "410423",
                        "c_name": "鲁山县"
                    },
                    {
                        "c_code": "410425",
                        "c_name": "郏县"
                    },
                    {
                        "c_code": "410481",
                        "c_name": "舞钢市"
                    },
                    {
                        "c_code": "410482",
                        "c_name": "汝州市"
                    }
                ],
                "s_code": "410400"
            },
            {
                "s_name": "安阳市",
                "c": [{
                        "c_code": "410502",
                        "c_name": "文峰区"
                    },
                    {
                        "c_code": "410503",
                        "c_name": "北关区"
                    },
                    {
                        "c_code": "410505",
                        "c_name": "殷都区"
                    },
                    {
                        "c_code": "410506",
                        "c_name": "龙安区"
                    },
                    {
                        "c_code": "410522",
                        "c_name": "安阳县"
                    },
                    {
                        "c_code": "410523",
                        "c_name": "汤阴县"
                    },
                    {
                        "c_code": "410526",
                        "c_name": "滑县"
                    },
                    {
                        "c_code": "410527",
                        "c_name": "内黄县"
                    },
                    {
                        "c_code": "410581",
                        "c_name": "林州市"
                    }
                ],
                "s_code": "410500"
            },
            {
                "s_name": "鹤壁市",
                "c": [{
                        "c_code": "410602",
                        "c_name": "鹤山区"
                    },
                    {
                        "c_code": "410603",
                        "c_name": "山城区"
                    },
                    {
                        "c_code": "410611",
                        "c_name": "淇滨区"
                    },
                    {
                        "c_code": "410621",
                        "c_name": "浚县"
                    },
                    {
                        "c_code": "410622",
                        "c_name": "淇县"
                    }
                ],
                "s_code": "410600"
            },
            {
                "s_name": "新乡市",
                "c": [{
                        "c_code": "410702",
                        "c_name": "红旗区"
                    },
                    {
                        "c_code": "410703",
                        "c_name": "卫滨区"
                    },
                    {
                        "c_code": "410704",
                        "c_name": "凤泉区"
                    },
                    {
                        "c_code": "410711",
                        "c_name": "牧野区"
                    },
                    {
                        "c_code": "410721",
                        "c_name": "新乡县"
                    },
                    {
                        "c_code": "410724",
                        "c_name": "获嘉县"
                    },
                    {
                        "c_code": "410725",
                        "c_name": "原阳县"
                    },
                    {
                        "c_code": "410726",
                        "c_name": "延津县"
                    },
                    {
                        "c_code": "410727",
                        "c_name": "封丘县"
                    },
                    {
                        "c_code": "410728",
                        "c_name": "长垣县"
                    },
                    {
                        "c_code": "410781",
                        "c_name": "卫辉市"
                    },
                    {
                        "c_code": "410782",
                        "c_name": "辉县市"
                    }
                ],
                "s_code": "410700"
            },
            {
                "s_name": "焦作市",
                "c": [{
                        "c_code": "410802",
                        "c_name": "解放区"
                    },
                    {
                        "c_code": "410803",
                        "c_name": "中站区"
                    },
                    {
                        "c_code": "410804",
                        "c_name": "马村区"
                    },
                    {
                        "c_code": "410811",
                        "c_name": "山阳区"
                    },
                    {
                        "c_code": "410821",
                        "c_name": "修武县"
                    },
                    {
                        "c_code": "410822",
                        "c_name": "博爱县"
                    },
                    {
                        "c_code": "410823",
                        "c_name": "武陟县"
                    },
                    {
                        "c_code": "410825",
                        "c_name": "温县"
                    },
                    {
                        "c_code": "410882",
                        "c_name": "沁阳市"
                    },
                    {
                        "c_code": "410883",
                        "c_name": "孟州市"
                    }
                ],
                "s_code": "410800"
            },
            {
                "s_name": "濮阳市",
                "c": [{
                        "c_code": "410902",
                        "c_name": "华龙区"
                    },
                    {
                        "c_code": "410922",
                        "c_name": "清丰县"
                    },
                    {
                        "c_code": "410923",
                        "c_name": "南乐县"
                    },
                    {
                        "c_code": "410926",
                        "c_name": "范县"
                    },
                    {
                        "c_code": "410927",
                        "c_name": "台前县"
                    },
                    {
                        "c_code": "410928",
                        "c_name": "濮阳县"
                    }
                ],
                "s_code": "410900"
            },
            {
                "s_name": "许昌市",
                "c": [{
                        "c_code": "411002",
                        "c_name": "魏都区"
                    },
                    {
                        "c_code": "411023",
                        "c_name": "许昌县"
                    },
                    {
                        "c_code": "411024",
                        "c_name": "鄢陵县"
                    },
                    {
                        "c_code": "411025",
                        "c_name": "襄城县"
                    },
                    {
                        "c_code": "411081",
                        "c_name": "禹州市"
                    },
                    {
                        "c_code": "411082",
                        "c_name": "长葛市"
                    }
                ],
                "s_code": "411000"
            },
            {
                "s_name": "漯河市",
                "c": [{
                        "c_code": "411102",
                        "c_name": "源汇区"
                    },
                    {
                        "c_code": "411103",
                        "c_name": "郾城区"
                    },
                    {
                        "c_code": "411104",
                        "c_name": "召陵区"
                    },
                    {
                        "c_code": "411121",
                        "c_name": "舞阳县"
                    },
                    {
                        "c_code": "411122",
                        "c_name": "临颍县"
                    }
                ],
                "s_code": "411100"
            },
            {
                "s_name": "三门峡市",
                "c": [{
                        "c_code": "411202",
                        "c_name": "湖滨区"
                    },
                    {
                        "c_code": "411221",
                        "c_name": "渑池县"
                    },
                    {
                        "c_code": "411222",
                        "c_name": "陕县"
                    },
                    {
                        "c_code": "411224",
                        "c_name": "卢氏县"
                    },
                    {
                        "c_code": "411281",
                        "c_name": "义马市"
                    },
                    {
                        "c_code": "411282",
                        "c_name": "灵宝市"
                    }
                ],
                "s_code": "411200"
            },
            {
                "s_name": "南阳市",
                "c": [{
                        "c_code": "411302",
                        "c_name": "宛城区"
                    },
                    {
                        "c_code": "411303",
                        "c_name": "卧龙区"
                    },
                    {
                        "c_code": "411321",
                        "c_name": "南召县"
                    },
                    {
                        "c_code": "411322",
                        "c_name": "方城县"
                    },
                    {
                        "c_code": "411323",
                        "c_name": "西峡县"
                    },
                    {
                        "c_code": "411324",
                        "c_name": "镇平县"
                    },
                    {
                        "c_code": "411325",
                        "c_name": "内乡县"
                    },
                    {
                        "c_code": "411326",
                        "c_name": "淅川县"
                    },
                    {
                        "c_code": "411327",
                        "c_name": "社旗县"
                    },
                    {
                        "c_code": "411328",
                        "c_name": "唐河县"
                    },
                    {
                        "c_code": "411329",
                        "c_name": "新野县"
                    },
                    {
                        "c_code": "411330",
                        "c_name": "桐柏县"
                    },
                    {
                        "c_code": "411381",
                        "c_name": "邓州市"
                    }
                ],
                "s_code": "411300"
            },
            {
                "s_name": "商丘市",
                "c": [{
                        "c_code": "411402",
                        "c_name": "梁园区"
                    },
                    {
                        "c_code": "411403",
                        "c_name": "睢阳区"
                    },
                    {
                        "c_code": "411421",
                        "c_name": "民权县"
                    },
                    {
                        "c_code": "411422",
                        "c_name": "睢县"
                    },
                    {
                        "c_code": "411423",
                        "c_name": "宁陵县"
                    },
                    {
                        "c_code": "411424",
                        "c_name": "柘城县"
                    },
                    {
                        "c_code": "411425",
                        "c_name": "虞城县"
                    },
                    {
                        "c_code": "411426",
                        "c_name": "夏邑县"
                    },
                    {
                        "c_code": "411481",
                        "c_name": "永城市"
                    }
                ],
                "s_code": "411400"
            },
            {
                "s_name": "信阳市",
                "c": [{
                        "c_code": "411502",
                        "c_name": "浉河区"
                    },
                    {
                        "c_code": "411520",
                        "c_name": "平桥区"
                    },
                    {
                        "c_code": "411521",
                        "c_name": "罗山县"
                    },
                    {
                        "c_code": "411522",
                        "c_name": "光山县"
                    },
                    {
                        "c_code": "411523",
                        "c_name": "新县"
                    },
                    {
                        "c_code": "411524",
                        "c_name": "商城县"
                    },
                    {
                        "c_code": "411525",
                        "c_name": "固始县"
                    },
                    {
                        "c_code": "411526",
                        "c_name": "潢川县"
                    },
                    {
                        "c_code": "411527",
                        "c_name": "淮滨县"
                    },
                    {
                        "c_code": "411528",
                        "c_name": "息县"
                    }
                ],
                "s_code": "411500"
            },
            {
                "s_name": "周口市",
                "c": [{
                        "c_code": "411602",
                        "c_name": "川汇区"
                    },
                    {
                        "c_code": "411621",
                        "c_name": "扶沟县"
                    },
                    {
                        "c_code": "411622",
                        "c_name": "西华县"
                    },
                    {
                        "c_code": "411623",
                        "c_name": "商水县"
                    },
                    {
                        "c_code": "411624",
                        "c_name": "沈丘县"
                    },
                    {
                        "c_code": "411625",
                        "c_name": "郸城县"
                    },
                    {
                        "c_code": "411626",
                        "c_name": "淮阳县"
                    },
                    {
                        "c_code": "411627",
                        "c_name": "太康县"
                    },
                    {
                        "c_code": "411628",
                        "c_name": "鹿邑县"
                    },
                    {
                        "c_code": "411681",
                        "c_name": "项城市"
                    }
                ],
                "s_code": "411600"
            },
            {
                "s_name": "驻马店市",
                "c": [{
                        "c_code": "411702",
                        "c_name": "驿城区"
                    },
                    {
                        "c_code": "411721",
                        "c_name": "西平县"
                    },
                    {
                        "c_code": "411722",
                        "c_name": "上蔡县"
                    },
                    {
                        "c_code": "411723",
                        "c_name": "平舆县"
                    },
                    {
                        "c_code": "411724",
                        "c_name": "正阳县"
                    },
                    {
                        "c_code": "411725",
                        "c_name": "确山县"
                    },
                    {
                        "c_code": "411726",
                        "c_name": "泌阳县"
                    },
                    {
                        "c_code": "411727",
                        "c_name": "汝南县"
                    },
                    {
                        "c_code": "411728",
                        "c_name": "遂平县"
                    },
                    {
                        "c_code": "411729",
                        "c_name": "新蔡县"
                    }
                ],
                "s_code": "411700"
            }
        ],
        "p_code": "410000"
    },
    {
        "p_name": "湖北省",
        "s": [{
                "s_name": "武汉市",
                "c": [{
                        "c_code": "420102",
                        "c_name": "江岸区"
                    },
                    {
                        "c_code": "420103",
                        "c_name": "江汉区"
                    },
                    {
                        "c_code": "420104",
                        "c_name": "~口区"
                    },
                    {
                        "c_code": "420105",
                        "c_name": "汉阳区"
                    },
                    {
                        "c_code": "420106",
                        "c_name": "武昌区"
                    },
                    {
                        "c_code": "420107",
                        "c_name": "青山区"
                    },
                    {
                        "c_code": "420111",
                        "c_name": "洪山区"
                    },
                    {
                        "c_code": "420112",
                        "c_name": "东西湖区"
                    },
                    {
                        "c_code": "420113",
                        "c_name": "汉南区"
                    },
                    {
                        "c_code": "420114",
                        "c_name": "蔡甸区"
                    },
                    {
                        "c_code": "420115",
                        "c_name": "江夏区"
                    },
                    {
                        "c_code": "420116",
                        "c_name": "黄陂区"
                    },
                    {
                        "c_code": "420117",
                        "c_name": "新洲区"
                    }
                ],
                "s_code": "420100"
            },
            {
                "s_name": "黄石市",
                "c": [{
                        "c_code": "420202",
                        "c_name": "黄石港区"
                    },
                    {
                        "c_code": "420203",
                        "c_name": "西塞山区"
                    },
                    {
                        "c_code": "420204",
                        "c_name": "下陆区"
                    },
                    {
                        "c_code": "420205",
                        "c_name": "铁山区"
                    },
                    {
                        "c_code": "420222",
                        "c_name": "阳新县"
                    },
                    {
                        "c_code": "420281",
                        "c_name": "大冶市"
                    }
                ],
                "s_code": "420200"
            },
            {
                "s_name": "十堰市",
                "c": [{
                        "c_code": "420302",
                        "c_name": "茅箭区"
                    },
                    {
                        "c_code": "420303",
                        "c_name": "张湾区"
                    },
                    {
                        "c_code": "420321",
                        "c_name": "郧县"
                    },
                    {
                        "c_code": "420322",
                        "c_name": "郧西县"
                    },
                    {
                        "c_code": "420323",
                        "c_name": "竹山县"
                    },
                    {
                        "c_code": "420324",
                        "c_name": "竹溪县"
                    },
                    {
                        "c_code": "420325",
                        "c_name": "房县"
                    },
                    {
                        "c_code": "420381",
                        "c_name": "丹江口市"
                    }
                ],
                "s_code": "420300"
            },
            {
                "s_name": "宜昌市",
                "c": [{
                        "c_code": "420502",
                        "c_name": "西陵区"
                    },
                    {
                        "c_code": "420503",
                        "c_name": "伍家岗区"
                    },
                    {
                        "c_code": "420504",
                        "c_name": "点军区"
                    },
                    {
                        "c_code": "420505",
                        "c_name": "V亭区"
                    },
                    {
                        "c_code": "420506",
                        "c_name": "夷陵区"
                    },
                    {
                        "c_code": "420525",
                        "c_name": "远安县"
                    },
                    {
                        "c_code": "420526",
                        "c_name": "兴山县"
                    },
                    {
                        "c_code": "420527",
                        "c_name": "秭归县"
                    },
                    {
                        "c_code": "420528",
                        "c_name": "长阳土家族自治县"
                    },
                    {
                        "c_code": "420529",
                        "c_name": "五峰土家族自治县"
                    },
                    {
                        "c_code": "420581",
                        "c_name": "宜都市"
                    },
                    {
                        "c_code": "420582",
                        "c_name": "当阳市"
                    },
                    {
                        "c_code": "420583",
                        "c_name": "枝江市"
                    }
                ],
                "s_code": "420500"
            },
            {
                "s_name": "襄樊市",
                "c": [{
                        "c_code": "420602",
                        "c_name": "襄城区"
                    },
                    {
                        "c_code": "420606",
                        "c_name": "樊城区"
                    },
                    {
                        "c_code": "420607",
                        "c_name": "襄阳区"
                    },
                    {
                        "c_code": "420624",
                        "c_name": "南漳县"
                    },
                    {
                        "c_code": "420625",
                        "c_name": "谷城县"
                    },
                    {
                        "c_code": "420626",
                        "c_name": "保康县"
                    },
                    {
                        "c_code": "420682",
                        "c_name": "老河口市"
                    },
                    {
                        "c_code": "420683",
                        "c_name": "枣阳市"
                    },
                    {
                        "c_code": "420684",
                        "c_name": "宜城市"
                    }
                ],
                "s_code": "420600"
            },
            {
                "s_name": "鄂州市",
                "c": [{
                        "c_code": "420702",
                        "c_name": "梁子湖区"
                    },
                    {
                        "c_code": "420703",
                        "c_name": "华容区"
                    },
                    {
                        "c_code": "420704",
                        "c_name": "鄂城区"
                    }
                ],
                "s_code": "420700"
            },
            {
                "s_name": "荆门市",
                "c": [{
                        "c_code": "420802",
                        "c_name": "东宝区"
                    },
                    {
                        "c_code": "420804",
                        "c_name": "掇刀区"
                    },
                    {
                        "c_code": "420821",
                        "c_name": "京山县"
                    },
                    {
                        "c_code": "420822",
                        "c_name": "沙洋县"
                    },
                    {
                        "c_code": "420881",
                        "c_name": "钟祥市"
                    }
                ],
                "s_code": "420800"
            },
            {
                "s_name": "孝感市",
                "c": [{
                        "c_code": "420902",
                        "c_name": "孝南区"
                    },
                    {
                        "c_code": "420921",
                        "c_name": "孝昌县"
                    },
                    {
                        "c_code": "420922",
                        "c_name": "大悟县"
                    },
                    {
                        "c_code": "420923",
                        "c_name": "云梦县"
                    },
                    {
                        "c_code": "420981",
                        "c_name": "应城市"
                    },
                    {
                        "c_code": "420982",
                        "c_name": "安陆市"
                    },
                    {
                        "c_code": "420984",
                        "c_name": "汉川市"
                    }
                ],
                "s_code": "420900"
            },
            {
                "s_name": "荆州市",
                "c": [{
                        "c_code": "421002",
                        "c_name": "沙市区"
                    },
                    {
                        "c_code": "421003",
                        "c_name": "荆州区"
                    },
                    {
                        "c_code": "421022",
                        "c_name": "公安县"
                    },
                    {
                        "c_code": "421023",
                        "c_name": "监利县"
                    },
                    {
                        "c_code": "421024",
                        "c_name": "江陵县"
                    },
                    {
                        "c_code": "421081",
                        "c_name": "石首市"
                    },
                    {
                        "c_code": "421083",
                        "c_name": "洪湖市"
                    },
                    {
                        "c_code": "421087",
                        "c_name": "松滋市"
                    }
                ],
                "s_code": "421000"
            },
            {
                "s_name": "黄冈市",
                "c": [{
                        "c_code": "421102",
                        "c_name": "黄州区"
                    },
                    {
                        "c_code": "421121",
                        "c_name": "团风县"
                    },
                    {
                        "c_code": "421122",
                        "c_name": "红安县"
                    },
                    {
                        "c_code": "421123",
                        "c_name": "罗田县"
                    },
                    {
                        "c_code": "421124",
                        "c_name": "英山县"
                    },
                    {
                        "c_code": "421125",
                        "c_name": "浠水县"
                    },
                    {
                        "c_code": "421126",
                        "c_name": "蕲春县"
                    },
                    {
                        "c_code": "421127",
                        "c_name": "黄梅县"
                    },
                    {
                        "c_code": "421181",
                        "c_name": "麻城市"
                    },
                    {
                        "c_code": "421182",
                        "c_name": "武穴市"
                    }
                ],
                "s_code": "421100"
            },
            {
                "s_name": "咸宁市",
                "c": [{
                        "c_code": "421202",
                        "c_name": "咸安区"
                    },
                    {
                        "c_code": "421221",
                        "c_name": "嘉鱼县"
                    },
                    {
                        "c_code": "421222",
                        "c_name": "通城县"
                    },
                    {
                        "c_code": "421223",
                        "c_name": "崇阳县"
                    },
                    {
                        "c_code": "421224",
                        "c_name": "通山县"
                    },
                    {
                        "c_code": "421281",
                        "c_name": "赤壁市"
                    }
                ],
                "s_code": "421200"
            },
            {
                "s_name": "随州市",
                "c": [{
                        "c_code": "421303",
                        "c_name": "曾都区"
                    },
                    {
                        "c_code": "421321",
                        "c_name": "随县"
                    },
                    {
                        "c_code": "421381",
                        "c_name": "广水市"
                    }
                ],
                "s_code": "421300"
            },
            {
                "s_name": "恩施土家族苗族自治州",
                "c": [{
                        "c_code": "422801",
                        "c_name": "恩施市"
                    },
                    {
                        "c_code": "422802",
                        "c_name": "利川市"
                    },
                    {
                        "c_code": "422822",
                        "c_name": "建始县"
                    },
                    {
                        "c_code": "422823",
                        "c_name": "巴东县"
                    },
                    {
                        "c_code": "422825",
                        "c_name": "宣恩县"
                    },
                    {
                        "c_code": "422826",
                        "c_name": "咸丰县"
                    },
                    {
                        "c_code": "422827",
                        "c_name": "来凤县"
                    },
                    {
                        "c_code": "422828",
                        "c_name": "鹤峰县"
                    }
                ],
                "s_code": "422800"
            },
            {
                "s_name": "仙桃市",
                "c": [{
                    "c_code": "429004",
                    "c_name": "仙桃市"
                }],
                "s_code": "429004"
            },
            {
                "s_name": "潜江市",
                "c": [{
                    "c_code": "429005",
                    "c_name": "潜江市"
                }],
                "s_code": "429005"
            },
            {
                "s_name": "天门市",
                "c": [{
                    "c_code": "429006",
                    "c_name": "天门市"
                }],
                "s_code": "429006"
            },
            {
                "s_name": "神农架林区",
                "c": [{
                    "c_code": "429021",
                    "c_name": "神农架林区"
                }],
                "s_code": "429021"
            }
        ],
        "p_code": "420000"
    },
    {
        "p_name": "湖南省",
        "s": [{
                "s_name": "长沙市",
                "c": [{
                        "c_code": "430102",
                        "c_name": "芙蓉区"
                    },
                    {
                        "c_code": "430103",
                        "c_name": "天心区"
                    },
                    {
                        "c_code": "430104",
                        "c_name": "岳麓区"
                    },
                    {
                        "c_code": "430105",
                        "c_name": "开福区"
                    },
                    {
                        "c_code": "430111",
                        "c_name": "雨花区"
                    },
                    {
                        "c_code": "430121",
                        "c_name": "长沙县"
                    },
                    {
                        "c_code": "430122",
                        "c_name": "望城县"
                    },
                    {
                        "c_code": "430124",
                        "c_name": "宁乡县"
                    },
                    {
                        "c_code": "430181",
                        "c_name": "浏阳市"
                    }
                ],
                "s_code": "430100"
            },
            {
                "s_name": "株洲市",
                "c": [{
                        "c_code": "430202",
                        "c_name": "荷塘区"
                    },
                    {
                        "c_code": "430203",
                        "c_name": "芦淞区"
                    },
                    {
                        "c_code": "430204",
                        "c_name": "石峰区"
                    },
                    {
                        "c_code": "430211",
                        "c_name": "天元区"
                    },
                    {
                        "c_code": "430221",
                        "c_name": "株洲县"
                    },
                    {
                        "c_code": "430223",
                        "c_name": "攸县"
                    },
                    {
                        "c_code": "430224",
                        "c_name": "茶陵县"
                    },
                    {
                        "c_code": "430225",
                        "c_name": "炎陵县"
                    },
                    {
                        "c_code": "430281",
                        "c_name": "醴陵市"
                    }
                ],
                "s_code": "430200"
            },
            {
                "s_name": "湘潭市",
                "c": [{
                        "c_code": "430302",
                        "c_name": "雨湖区"
                    },
                    {
                        "c_code": "430304",
                        "c_name": "岳塘区"
                    },
                    {
                        "c_code": "430321",
                        "c_name": "湘潭县"
                    },
                    {
                        "c_code": "430381",
                        "c_name": "湘乡市"
                    },
                    {
                        "c_code": "430382",
                        "c_name": "韶山市"
                    }
                ],
                "s_code": "430300"
            },
            {
                "s_name": "衡阳市",
                "c": [{
                        "c_code": "430405",
                        "c_name": "珠晖区"
                    },
                    {
                        "c_code": "430406",
                        "c_name": "雁峰区"
                    },
                    {
                        "c_code": "430407",
                        "c_name": "石鼓区"
                    },
                    {
                        "c_code": "430408",
                        "c_name": "蒸湘区"
                    },
                    {
                        "c_code": "430412",
                        "c_name": "南岳区"
                    },
                    {
                        "c_code": "430421",
                        "c_name": "衡阳县"
                    },
                    {
                        "c_code": "430422",
                        "c_name": "衡南县"
                    },
                    {
                        "c_code": "430423",
                        "c_name": "衡山县"
                    },
                    {
                        "c_code": "430424",
                        "c_name": "衡东县"
                    },
                    {
                        "c_code": "430426",
                        "c_name": "祁东县"
                    },
                    {
                        "c_code": "430481",
                        "c_name": "耒阳市"
                    },
                    {
                        "c_code": "430482",
                        "c_name": "常宁市"
                    }
                ],
                "s_code": "430400"
            },
            {
                "s_name": "邵阳市",
                "c": [{
                        "c_code": "430502",
                        "c_name": "双清区"
                    },
                    {
                        "c_code": "430503",
                        "c_name": "大祥区"
                    },
                    {
                        "c_code": "430511",
                        "c_name": "北塔区"
                    },
                    {
                        "c_code": "430521",
                        "c_name": "邵东县"
                    },
                    {
                        "c_code": "430522",
                        "c_name": "新邵县"
                    },
                    {
                        "c_code": "430523",
                        "c_name": "邵阳县"
                    },
                    {
                        "c_code": "430524",
                        "c_name": "隆回县"
                    },
                    {
                        "c_code": "430525",
                        "c_name": "洞口县"
                    },
                    {
                        "c_code": "430527",
                        "c_name": "绥宁县"
                    },
                    {
                        "c_code": "430528",
                        "c_name": "新宁县"
                    },
                    {
                        "c_code": "430529",
                        "c_name": "城步苗族自治县"
                    },
                    {
                        "c_code": "430581",
                        "c_name": "武冈市"
                    }
                ],
                "s_code": "430500"
            },
            {
                "s_name": "岳阳市",
                "c": [{
                        "c_code": "430602",
                        "c_name": "岳阳楼区"
                    },
                    {
                        "c_code": "430603",
                        "c_name": "云溪区"
                    },
                    {
                        "c_code": "430611",
                        "c_name": "君山区"
                    },
                    {
                        "c_code": "430621",
                        "c_name": "岳阳县"
                    },
                    {
                        "c_code": "430623",
                        "c_name": "华容县"
                    },
                    {
                        "c_code": "430624",
                        "c_name": "湘阴县"
                    },
                    {
                        "c_code": "430626",
                        "c_name": "平江县"
                    },
                    {
                        "c_code": "430681",
                        "c_name": "汨罗市"
                    },
                    {
                        "c_code": "430682",
                        "c_name": "临湘市"
                    }
                ],
                "s_code": "430600"
            },
            {
                "s_name": "常德市",
                "c": [{
                        "c_code": "430702",
                        "c_name": "武陵区"
                    },
                    {
                        "c_code": "430703",
                        "c_name": "鼎城区"
                    },
                    {
                        "c_code": "430721",
                        "c_name": "安乡县"
                    },
                    {
                        "c_code": "430722",
                        "c_name": "汉寿县"
                    },
                    {
                        "c_code": "430723",
                        "c_name": "澧县"
                    },
                    {
                        "c_code": "430724",
                        "c_name": "临澧县"
                    },
                    {
                        "c_code": "430725",
                        "c_name": "桃源县"
                    },
                    {
                        "c_code": "430726",
                        "c_name": "石门县"
                    },
                    {
                        "c_code": "430781",
                        "c_name": "津市市"
                    }
                ],
                "s_code": "430700"
            },
            {
                "s_name": "张家界市",
                "c": [{
                        "c_code": "430802",
                        "c_name": "永定区"
                    },
                    {
                        "c_code": "430811",
                        "c_name": "武陵源区"
                    },
                    {
                        "c_code": "430821",
                        "c_name": "慈利县"
                    },
                    {
                        "c_code": "430822",
                        "c_name": "桑植县"
                    }
                ],
                "s_code": "430800"
            },
            {
                "s_name": "益阳市",
                "c": [{
                        "c_code": "430902",
                        "c_name": "资阳区"
                    },
                    {
                        "c_code": "430903",
                        "c_name": "赫山区"
                    },
                    {
                        "c_code": "430921",
                        "c_name": "南县"
                    },
                    {
                        "c_code": "430922",
                        "c_name": "桃江县"
                    },
                    {
                        "c_code": "430923",
                        "c_name": "安化县"
                    },
                    {
                        "c_code": "430981",
                        "c_name": "沅江市"
                    }
                ],
                "s_code": "430900"
            },
            {
                "s_name": "郴州市",
                "c": [{
                        "c_code": "431002",
                        "c_name": "北湖区"
                    },
                    {
                        "c_code": "431003",
                        "c_name": "苏仙区"
                    },
                    {
                        "c_code": "431021",
                        "c_name": "桂阳县"
                    },
                    {
                        "c_code": "431022",
                        "c_name": "宜章县"
                    },
                    {
                        "c_code": "431023",
                        "c_name": "永兴县"
                    },
                    {
                        "c_code": "431024",
                        "c_name": "嘉禾县"
                    },
                    {
                        "c_code": "431025",
                        "c_name": "临武县"
                    },
                    {
                        "c_code": "431026",
                        "c_name": "汝城县"
                    },
                    {
                        "c_code": "431027",
                        "c_name": "桂东县"
                    },
                    {
                        "c_code": "431028",
                        "c_name": "安仁县"
                    },
                    {
                        "c_code": "431081",
                        "c_name": "资兴市"
                    }
                ],
                "s_code": "431000"
            },
            {
                "s_name": "永州市",
                "c": [{
                        "c_code": "431102",
                        "c_name": "零陵区"
                    },
                    {
                        "c_code": "431103",
                        "c_name": "冷水滩区"
                    },
                    {
                        "c_code": "431121",
                        "c_name": "祁阳县"
                    },
                    {
                        "c_code": "431122",
                        "c_name": "东安县"
                    },
                    {
                        "c_code": "431123",
                        "c_name": "双牌县"
                    },
                    {
                        "c_code": "431124",
                        "c_name": "道县"
                    },
                    {
                        "c_code": "431125",
                        "c_name": "江永县"
                    },
                    {
                        "c_code": "431126",
                        "c_name": "宁远县"
                    },
                    {
                        "c_code": "431127",
                        "c_name": "蓝山县"
                    },
                    {
                        "c_code": "431128",
                        "c_name": "新田县"
                    },
                    {
                        "c_code": "431129",
                        "c_name": "江华瑶族自治县"
                    }
                ],
                "s_code": "431100"
            },
            {
                "s_name": "怀化市",
                "c": [{
                        "c_code": "431202",
                        "c_name": "鹤城区"
                    },
                    {
                        "c_code": "431221",
                        "c_name": "中方县"
                    },
                    {
                        "c_code": "431222",
                        "c_name": "沅陵县"
                    },
                    {
                        "c_code": "431223",
                        "c_name": "辰溪县"
                    },
                    {
                        "c_code": "431224",
                        "c_name": "溆浦县"
                    },
                    {
                        "c_code": "431225",
                        "c_name": "会同县"
                    },
                    {
                        "c_code": "431226",
                        "c_name": "麻阳苗族自治县"
                    },
                    {
                        "c_code": "431227",
                        "c_name": "新晃侗族自治县"
                    },
                    {
                        "c_code": "431228",
                        "c_name": "芷江侗族自治县"
                    },
                    {
                        "c_code": "431229",
                        "c_name": "靖州苗族侗族自治县"
                    },
                    {
                        "c_code": "431230",
                        "c_name": "通道侗族自治县"
                    },
                    {
                        "c_code": "431281",
                        "c_name": "洪江市"
                    }
                ],
                "s_code": "431200"
            },
            {
                "s_name": "娄底市",
                "c": [{
                        "c_code": "431302",
                        "c_name": "娄星区"
                    },
                    {
                        "c_code": "431321",
                        "c_name": "双峰县"
                    },
                    {
                        "c_code": "431322",
                        "c_name": "新化县"
                    },
                    {
                        "c_code": "431381",
                        "c_name": "冷水江市"
                    },
                    {
                        "c_code": "431382",
                        "c_name": "涟源市"
                    }
                ],
                "s_code": "431300"
            },
            {
                "s_name": "湘西土家族苗族自治州",
                "c": [{
                        "c_code": "433101",
                        "c_name": "吉首市"
                    },
                    {
                        "c_code": "433122",
                        "c_name": "泸溪县"
                    },
                    {
                        "c_code": "433123",
                        "c_name": "凤凰县"
                    },
                    {
                        "c_code": "433124",
                        "c_name": "花垣县"
                    },
                    {
                        "c_code": "433125",
                        "c_name": "保靖县"
                    },
                    {
                        "c_code": "433126",
                        "c_name": "古丈县"
                    },
                    {
                        "c_code": "433127",
                        "c_name": "永顺县"
                    },
                    {
                        "c_code": "433130",
                        "c_name": "龙山县"
                    }
                ],
                "s_code": "433100"
            }
        ],
        "p_code": "430000"
    },
    {
        "p_name": "广东省",
        "s": [{
                "s_name": "广州市",
                "c": [{
                        "c_code": "440103",
                        "c_name": "荔湾区"
                    },
                    {
                        "c_code": "440104",
                        "c_name": "越秀区"
                    },
                    {
                        "c_code": "440105",
                        "c_name": "海珠区"
                    },
                    {
                        "c_code": "440106",
                        "c_name": "天河区"
                    },
                    {
                        "c_code": "440111",
                        "c_name": "白云区"
                    },
                    {
                        "c_code": "440112",
                        "c_name": "黄埔区"
                    },
                    {
                        "c_code": "440113",
                        "c_name": "番禺区"
                    },
                    {
                        "c_code": "440114",
                        "c_name": "花都区"
                    },
                    {
                        "c_code": "440115",
                        "c_name": "南沙区"
                    },
                    {
                        "c_code": "440116",
                        "c_name": "萝岗区"
                    },
                    {
                        "c_code": "440183",
                        "c_name": "增城市"
                    },
                    {
                        "c_code": "440184",
                        "c_name": "从化市"
                    }
                ],
                "s_code": "440100"
            },
            {
                "s_name": "韶关市",
                "c": [{
                        "c_code": "440203",
                        "c_name": "武江区"
                    },
                    {
                        "c_code": "440204",
                        "c_name": "浈江区"
                    },
                    {
                        "c_code": "440205",
                        "c_name": "曲江区"
                    },
                    {
                        "c_code": "440222",
                        "c_name": "始兴县"
                    },
                    {
                        "c_code": "440224",
                        "c_name": "仁化县"
                    },
                    {
                        "c_code": "440229",
                        "c_name": "翁源县"
                    },
                    {
                        "c_code": "440232",
                        "c_name": "乳源瑶族自治县"
                    },
                    {
                        "c_code": "440233",
                        "c_name": "新丰县"
                    },
                    {
                        "c_code": "440281",
                        "c_name": "乐昌市"
                    },
                    {
                        "c_code": "440282",
                        "c_name": "南雄市"
                    }
                ],
                "s_code": "440200"
            },
            {
                "s_name": "深圳市",
                "c": [{
                        "c_code": "440303",
                        "c_name": "罗湖区"
                    },
                    {
                        "c_code": "440304",
                        "c_name": "福田区"
                    },
                    {
                        "c_code": "440305",
                        "c_name": "南山区"
                    },
                    {
                        "c_code": "440306",
                        "c_name": "宝安区"
                    },
                    {
                        "c_code": "440307",
                        "c_name": "龙岗区"
                    },
                    {
                        "c_code": "440308",
                        "c_name": "盐田区"
                    }
                ],
                "s_code": "440300"
            },
            {
                "s_name": "珠海市",
                "c": [{
                        "c_code": "440402",
                        "c_name": "香洲区"
                    },
                    {
                        "c_code": "440403",
                        "c_name": "斗门区"
                    },
                    {
                        "c_code": "440404",
                        "c_name": "金湾区"
                    }
                ],
                "s_code": "440400"
            },
            {
                "s_name": "汕头市",
                "c": [{
                        "c_code": "440507",
                        "c_name": "龙湖区"
                    },
                    {
                        "c_code": "440511",
                        "c_name": "金平区"
                    },
                    {
                        "c_code": "440512",
                        "c_name": "濠江区"
                    },
                    {
                        "c_code": "440513",
                        "c_name": "潮阳区"
                    },
                    {
                        "c_code": "440514",
                        "c_name": "潮南区"
                    },
                    {
                        "c_code": "440515",
                        "c_name": "澄海区"
                    },
                    {
                        "c_code": "440523",
                        "c_name": "南澳县"
                    }
                ],
                "s_code": "440500"
            },
            {
                "s_name": "佛山市",
                "c": [{
                        "c_code": "440604",
                        "c_name": "禅城区"
                    },
                    {
                        "c_code": "440605",
                        "c_name": "南海区"
                    },
                    {
                        "c_code": "440606",
                        "c_name": "顺德区"
                    },
                    {
                        "c_code": "440607",
                        "c_name": "三水区"
                    },
                    {
                        "c_code": "440608",
                        "c_name": "高明区"
                    }
                ],
                "s_code": "440600"
            },
            {
                "s_name": "江门市",
                "c": [{
                        "c_code": "440703",
                        "c_name": "蓬江区"
                    },
                    {
                        "c_code": "440704",
                        "c_name": "江海区"
                    },
                    {
                        "c_code": "440705",
                        "c_name": "新会区"
                    },
                    {
                        "c_code": "440781",
                        "c_name": "台山市"
                    },
                    {
                        "c_code": "440783",
                        "c_name": "开平市"
                    },
                    {
                        "c_code": "440784",
                        "c_name": "鹤山市"
                    },
                    {
                        "c_code": "440785",
                        "c_name": "恩平市"
                    }
                ],
                "s_code": "440700"
            },
            {
                "s_name": "湛江市",
                "c": [{
                        "c_code": "440802",
                        "c_name": "赤坎区"
                    },
                    {
                        "c_code": "440803",
                        "c_name": "霞山区"
                    },
                    {
                        "c_code": "440804",
                        "c_name": "坡头区"
                    },
                    {
                        "c_code": "440811",
                        "c_name": "麻章区"
                    },
                    {
                        "c_code": "440823",
                        "c_name": "遂溪县"
                    },
                    {
                        "c_code": "440825",
                        "c_name": "徐闻县"
                    },
                    {
                        "c_code": "440881",
                        "c_name": "廉江市"
                    },
                    {
                        "c_code": "440882",
                        "c_name": "雷州市"
                    },
                    {
                        "c_code": "440883",
                        "c_name": "吴川市"
                    }
                ],
                "s_code": "440800"
            },
            {
                "s_name": "茂名市",
                "c": [{
                        "c_code": "440902",
                        "c_name": "茂南区"
                    },
                    {
                        "c_code": "440903",
                        "c_name": "茂港区"
                    },
                    {
                        "c_code": "440923",
                        "c_name": "电白县"
                    },
                    {
                        "c_code": "440981",
                        "c_name": "高州市"
                    },
                    {
                        "c_code": "440982",
                        "c_name": "化州市"
                    },
                    {
                        "c_code": "440983",
                        "c_name": "信宜市"
                    }
                ],
                "s_code": "440900"
            },
            {
                "s_name": "肇庆市",
                "c": [{
                        "c_code": "441202",
                        "c_name": "端州区"
                    },
                    {
                        "c_code": "441203",
                        "c_name": "鼎湖区"
                    },
                    {
                        "c_code": "441223",
                        "c_name": "广宁县"
                    },
                    {
                        "c_code": "441224",
                        "c_name": "怀集县"
                    },
                    {
                        "c_code": "441225",
                        "c_name": "封开县"
                    },
                    {
                        "c_code": "441226",
                        "c_name": "德庆县"
                    },
                    {
                        "c_code": "441283",
                        "c_name": "高要市"
                    },
                    {
                        "c_code": "441284",
                        "c_name": "四会市"
                    }
                ],
                "s_code": "441200"
            },
            {
                "s_name": "惠州市",
                "c": [{
                        "c_code": "441302",
                        "c_name": "惠城区"
                    },
                    {
                        "c_code": "441303",
                        "c_name": "惠阳区"
                    },
                    {
                        "c_code": "441322",
                        "c_name": "博罗县"
                    },
                    {
                        "c_code": "441323",
                        "c_name": "惠东县"
                    },
                    {
                        "c_code": "441324",
                        "c_name": "龙门县"
                    }
                ],
                "s_code": "441300"
            },
            {
                "s_name": "梅州市",
                "c": [{
                        "c_code": "441402",
                        "c_name": "梅江区"
                    },
                    {
                        "c_code": "441421",
                        "c_name": "梅县"
                    },
                    {
                        "c_code": "441422",
                        "c_name": "大埔县"
                    },
                    {
                        "c_code": "441423",
                        "c_name": "丰顺县"
                    },
                    {
                        "c_code": "441424",
                        "c_name": "五华县"
                    },
                    {
                        "c_code": "441426",
                        "c_name": "平远县"
                    },
                    {
                        "c_code": "441427",
                        "c_name": "蕉岭县"
                    },
                    {
                        "c_code": "441481",
                        "c_name": "兴宁市"
                    }
                ],
                "s_code": "441400"
            },
            {
                "s_name": "汕尾市",
                "c": [{
                        "c_code": "441502",
                        "c_name": "城区"
                    },
                    {
                        "c_code": "441521",
                        "c_name": "海丰县"
                    },
                    {
                        "c_code": "441523",
                        "c_name": "陆河县"
                    },
                    {
                        "c_code": "441581",
                        "c_name": "陆丰市"
                    }
                ],
                "s_code": "441500"
            },
            {
                "s_name": "河源市",
                "c": [{
                        "c_code": "441602",
                        "c_name": "源城区"
                    },
                    {
                        "c_code": "441621",
                        "c_name": "紫金县"
                    },
                    {
                        "c_code": "441622",
                        "c_name": "龙川县"
                    },
                    {
                        "c_code": "441623",
                        "c_name": "连平县"
                    },
                    {
                        "c_code": "441624",
                        "c_name": "和平县"
                    },
                    {
                        "c_code": "441625",
                        "c_name": "东源县"
                    }
                ],
                "s_code": "441600"
            },
            {
                "s_name": "阳江市",
                "c": [{
                        "c_code": "441702",
                        "c_name": "江城区"
                    },
                    {
                        "c_code": "441721",
                        "c_name": "阳西县"
                    },
                    {
                        "c_code": "441723",
                        "c_name": "阳东县"
                    },
                    {
                        "c_code": "441781",
                        "c_name": "阳春市"
                    }
                ],
                "s_code": "441700"
            },
            {
                "s_name": "清远市",
                "c": [{
                        "c_code": "441802",
                        "c_name": "清城区"
                    },
                    {
                        "c_code": "441821",
                        "c_name": "佛冈县"
                    },
                    {
                        "c_code": "441823",
                        "c_name": "阳山县"
                    },
                    {
                        "c_code": "441825",
                        "c_name": "连山壮族瑶族自治县"
                    },
                    {
                        "c_code": "441826",
                        "c_name": "连南瑶族自治县"
                    },
                    {
                        "c_code": "441827",
                        "c_name": "清新县"
                    },
                    {
                        "c_code": "441881",
                        "c_name": "英德市"
                    },
                    {
                        "c_code": "441882",
                        "c_name": "连州市"
                    }
                ],
                "s_code": "441800"
            },
            {
                "s_name": "潮州市",
                "c": [{
                        "c_code": "445102",
                        "c_name": "湘桥区"
                    },
                    {
                        "c_code": "445121",
                        "c_name": "潮安县"
                    },
                    {
                        "c_code": "445122",
                        "c_name": "饶平县"
                    }
                ],
                "s_code": "445100"
            },
            {
                "s_name": "揭阳市",
                "c": [{
                        "c_code": "445202",
                        "c_name": "榕城区"
                    },
                    {
                        "c_code": "445221",
                        "c_name": "揭东县"
                    },
                    {
                        "c_code": "445222",
                        "c_name": "揭西县"
                    },
                    {
                        "c_code": "445224",
                        "c_name": "惠来县"
                    },
                    {
                        "c_code": "445281",
                        "c_name": "普宁市"
                    }
                ],
                "s_code": "445200"
            },
            {
                "s_name": "云浮市",
                "c": [{
                        "c_code": "445302",
                        "c_name": "云城区"
                    },
                    {
                        "c_code": "445321",
                        "c_name": "新兴县"
                    },
                    {
                        "c_code": "445322",
                        "c_name": "郁南县"
                    },
                    {
                        "c_code": "445323",
                        "c_name": "云安县"
                    },
                    {
                        "c_code": "445381",
                        "c_name": "罗定市"
                    }
                ],
                "s_code": "445300"
            }
        ],
        "p_code": "440000"
    },
    {
        "p_name": "广西壮族自治区",
        "s": [{
                "s_name": "南宁市",
                "c": [{
                        "c_code": "450102",
                        "c_name": "兴宁区"
                    },
                    {
                        "c_code": "450103",
                        "c_name": "青秀区"
                    },
                    {
                        "c_code": "450105",
                        "c_name": "江南区"
                    },
                    {
                        "c_code": "450107",
                        "c_name": "西乡塘区"
                    },
                    {
                        "c_code": "450108",
                        "c_name": "良庆区"
                    },
                    {
                        "c_code": "450109",
                        "c_name": "邕宁区"
                    },
                    {
                        "c_code": "450122",
                        "c_name": "武鸣县"
                    },
                    {
                        "c_code": "450123",
                        "c_name": "隆安县"
                    },
                    {
                        "c_code": "450124",
                        "c_name": "马山县"
                    },
                    {
                        "c_code": "450125",
                        "c_name": "上林县"
                    },
                    {
                        "c_code": "450126",
                        "c_name": "宾阳县"
                    },
                    {
                        "c_code": "450127",
                        "c_name": "横县"
                    }
                ],
                "s_code": "450100"
            },
            {
                "s_name": "柳州市",
                "c": [{
                        "c_code": "450202",
                        "c_name": "城中区"
                    },
                    {
                        "c_code": "450203",
                        "c_name": "鱼峰区"
                    },
                    {
                        "c_code": "450204",
                        "c_name": "柳南区"
                    },
                    {
                        "c_code": "450205",
                        "c_name": "柳北区"
                    },
                    {
                        "c_code": "450221",
                        "c_name": "柳江县"
                    },
                    {
                        "c_code": "450222",
                        "c_name": "柳城县"
                    },
                    {
                        "c_code": "450223",
                        "c_name": "鹿寨县"
                    },
                    {
                        "c_code": "450224",
                        "c_name": "融安县"
                    },
                    {
                        "c_code": "450225",
                        "c_name": "融水苗族自治县"
                    },
                    {
                        "c_code": "450226",
                        "c_name": "三江侗族自治县"
                    }
                ],
                "s_code": "450200"
            },
            {
                "s_name": "桂林市",
                "c": [{
                        "c_code": "450302",
                        "c_name": "秀峰区"
                    },
                    {
                        "c_code": "450303",
                        "c_name": "叠彩区"
                    },
                    {
                        "c_code": "450304",
                        "c_name": "象山区"
                    },
                    {
                        "c_code": "450305",
                        "c_name": "七星区"
                    },
                    {
                        "c_code": "450311",
                        "c_name": "雁山区"
                    },
                    {
                        "c_code": "450321",
                        "c_name": "阳朔县"
                    },
                    {
                        "c_code": "450322",
                        "c_name": "临桂县"
                    },
                    {
                        "c_code": "450323",
                        "c_name": "灵川县"
                    },
                    {
                        "c_code": "450324",
                        "c_name": "全州县"
                    },
                    {
                        "c_code": "450325",
                        "c_name": "兴安县"
                    },
                    {
                        "c_code": "450326",
                        "c_name": "永福县"
                    },
                    {
                        "c_code": "450327",
                        "c_name": "灌阳县"
                    },
                    {
                        "c_code": "450328",
                        "c_name": "龙胜各族自治县"
                    },
                    {
                        "c_code": "450329",
                        "c_name": "资源县"
                    },
                    {
                        "c_code": "450330",
                        "c_name": "平乐县"
                    },
                    {
                        "c_code": "450331",
                        "c_name": "荔蒲县"
                    },
                    {
                        "c_code": "450332",
                        "c_name": "恭城瑶族自治县"
                    }
                ],
                "s_code": "450300"
            },
            {
                "s_name": "梧州市",
                "c": [{
                        "c_code": "450403",
                        "c_name": "万秀区"
                    },
                    {
                        "c_code": "450404",
                        "c_name": "蝶山区"
                    },
                    {
                        "c_code": "450405",
                        "c_name": "长洲区"
                    },
                    {
                        "c_code": "450421",
                        "c_name": "苍梧县"
                    },
                    {
                        "c_code": "450422",
                        "c_name": "藤县"
                    },
                    {
                        "c_code": "450423",
                        "c_name": "蒙山县"
                    },
                    {
                        "c_code": "450481",
                        "c_name": "岑溪市"
                    }
                ],
                "s_code": "450400"
            },
            {
                "s_name": "北海市",
                "c": [{
                        "c_code": "450502",
                        "c_name": "海城区"
                    },
                    {
                        "c_code": "450503",
                        "c_name": "银海区"
                    },
                    {
                        "c_code": "450512",
                        "c_name": "铁山港区"
                    },
                    {
                        "c_code": "450521",
                        "c_name": "合浦县"
                    }
                ],
                "s_code": "450500"
            },
            {
                "s_name": "防城港市",
                "c": [{
                        "c_code": "450602",
                        "c_name": "港口区"
                    },
                    {
                        "c_code": "450603",
                        "c_name": "防城区"
                    },
                    {
                        "c_code": "450621",
                        "c_name": "上思县"
                    },
                    {
                        "c_code": "450681",
                        "c_name": "东兴市"
                    }
                ],
                "s_code": "450600"
            },
            {
                "s_name": "钦州市",
                "c": [{
                        "c_code": "450702",
                        "c_name": "钦南区"
                    },
                    {
                        "c_code": "450703",
                        "c_name": "钦北区"
                    },
                    {
                        "c_code": "450721",
                        "c_name": "灵山县"
                    },
                    {
                        "c_code": "450722",
                        "c_name": "浦北县"
                    }
                ],
                "s_code": "450700"
            },
            {
                "s_name": "贵港市",
                "c": [{
                        "c_code": "450802",
                        "c_name": "港北区"
                    },
                    {
                        "c_code": "450803",
                        "c_name": "港南区"
                    },
                    {
                        "c_code": "450804",
                        "c_name": "覃塘区"
                    },
                    {
                        "c_code": "450821",
                        "c_name": "平南县"
                    },
                    {
                        "c_code": "450881",
                        "c_name": "桂平市"
                    }
                ],
                "s_code": "450800"
            },
            {
                "s_name": "玉林市",
                "c": [{
                        "c_code": "450902",
                        "c_name": "玉州区"
                    },
                    {
                        "c_code": "450921",
                        "c_name": "容县"
                    },
                    {
                        "c_code": "450922",
                        "c_name": "陆川县"
                    },
                    {
                        "c_code": "450923",
                        "c_name": "博白县"
                    },
                    {
                        "c_code": "450924",
                        "c_name": "兴业县"
                    },
                    {
                        "c_code": "450981",
                        "c_name": "北流市"
                    }
                ],
                "s_code": "450900"
            },
            {
                "s_name": "百色市",
                "c": [{
                        "c_code": "451002",
                        "c_name": "右江区"
                    },
                    {
                        "c_code": "451021",
                        "c_name": "田阳县"
                    },
                    {
                        "c_code": "451022",
                        "c_name": "田东县"
                    },
                    {
                        "c_code": "451023",
                        "c_name": "平果县"
                    },
                    {
                        "c_code": "451024",
                        "c_name": "德保县"
                    },
                    {
                        "c_code": "451025",
                        "c_name": "靖西县"
                    },
                    {
                        "c_code": "451026",
                        "c_name": "那坡县"
                    },
                    {
                        "c_code": "451027",
                        "c_name": "凌云县"
                    },
                    {
                        "c_code": "451028",
                        "c_name": "乐业县"
                    },
                    {
                        "c_code": "451029",
                        "c_name": "田林县"
                    },
                    {
                        "c_code": "451030",
                        "c_name": "西林县"
                    },
                    {
                        "c_code": "451031",
                        "c_name": "隆林各族自治县"
                    }
                ],
                "s_code": "451000"
            },
            {
                "s_name": "贺州市",
                "c": [{
                        "c_code": "451102",
                        "c_name": "八步区"
                    },
                    {
                        "c_code": "451121",
                        "c_name": "昭平县"
                    },
                    {
                        "c_code": "451122",
                        "c_name": "钟山县"
                    },
                    {
                        "c_code": "451123",
                        "c_name": "富川瑶族自治县"
                    }
                ],
                "s_code": "451100"
            },
            {
                "s_name": "河池市",
                "c": [{
                        "c_code": "451202",
                        "c_name": "金城江区"
                    },
                    {
                        "c_code": "451221",
                        "c_name": "南丹县"
                    },
                    {
                        "c_code": "451222",
                        "c_name": "天峨县"
                    },
                    {
                        "c_code": "451223",
                        "c_name": "凤山县"
                    },
                    {
                        "c_code": "451224",
                        "c_name": "东兰县"
                    },
                    {
                        "c_code": "451225",
                        "c_name": "罗城仫佬族自治县"
                    },
                    {
                        "c_code": "451226",
                        "c_name": "环江毛南族自治县"
                    },
                    {
                        "c_code": "451227",
                        "c_name": "巴马瑶族自治县"
                    },
                    {
                        "c_code": "451228",
                        "c_name": "都安瑶族自治县"
                    },
                    {
                        "c_code": "451229",
                        "c_name": "大化瑶族自治县"
                    },
                    {
                        "c_code": "451281",
                        "c_name": "宜州市"
                    }
                ],
                "s_code": "451200"
            },
            {
                "s_name": "来宾市",
                "c": [{
                        "c_code": "451302",
                        "c_name": "兴宾区"
                    },
                    {
                        "c_code": "451321",
                        "c_name": "忻城县"
                    },
                    {
                        "c_code": "451322",
                        "c_name": "象州县"
                    },
                    {
                        "c_code": "451323",
                        "c_name": "武宣县"
                    },
                    {
                        "c_code": "451324",
                        "c_name": "金秀瑶族自治县"
                    },
                    {
                        "c_code": "451381",
                        "c_name": "合山市"
                    }
                ],
                "s_code": "451300"
            },
            {
                "s_name": "崇左市",
                "c": [{
                        "c_code": "451402",
                        "c_name": "江洲区"
                    },
                    {
                        "c_code": "451421",
                        "c_name": "扶绥县"
                    },
                    {
                        "c_code": "451422",
                        "c_name": "宁明县"
                    },
                    {
                        "c_code": "451423",
                        "c_name": "龙州县"
                    },
                    {
                        "c_code": "451424",
                        "c_name": "大新县"
                    },
                    {
                        "c_code": "451425",
                        "c_name": "天等县"
                    },
                    {
                        "c_code": "451481",
                        "c_name": "凭祥市"
                    }
                ],
                "s_code": "451400"
            }
        ],
        "p_code": "450000"
    },
    {
        "p_name": "海南省",
        "s": [{
                "s_name": "海口市",
                "c": [{
                        "c_code": "460105",
                        "c_name": "秀英区"
                    },
                    {
                        "c_code": "460106",
                        "c_name": "龙华区"
                    },
                    {
                        "c_code": "460107",
                        "c_name": "琼山区"
                    },
                    {
                        "c_code": "460108",
                        "c_name": "美兰区"
                    }
                ],
                "s_code": "460100"
            },
            {
                "s_name": "三亚市",
                "c": [{
                    "c_code": "460200",
                    "c_name": "三亚市"
                }],
                "s_code": "460200"
            },
            {
                "s_name": "五指山市",
                "c": [{
                    "c_code": "469001",
                    "c_name": "五指山市"
                }],
                "s_code": "469001"
            },
            {
                "s_name": "琼海市",
                "c": [{
                    "c_code": "469002",
                    "c_name": "琼海市"
                }],
                "s_code": "469002"
            },
            {
                "s_name": "儋州市",
                "c": [{
                    "c_code": "469003",
                    "c_name": "儋州市"
                }],
                "s_code": "469003"
            },
            {
                "s_name": "文昌市",
                "c": [{
                    "c_code": "469005",
                    "c_name": "文昌市"
                }],
                "s_code": "469005"
            },
            {
                "s_name": "万宁市",
                "c": [{
                    "c_code": "469006",
                    "c_name": "万宁市"
                }],
                "s_code": "469006"
            },
            {
                "s_name": "东方市",
                "c": [{
                    "c_code": "469007",
                    "c_name": "东方市"
                }],
                "s_code": "469007"
            },
            {
                "s_name": "定安县",
                "c": [{
                    "c_code": "469021",
                    "c_name": "定安县"
                }],
                "s_code": "469021"
            },
            {
                "s_name": "屯昌县",
                "c": [{
                    "c_code": "469022",
                    "c_name": "屯昌县"
                }],
                "s_code": "469022"
            },
            {
                "s_name": "澄迈县",
                "c": [{
                    "c_code": "469023",
                    "c_name": "澄迈县"
                }],
                "s_code": "469023"
            },
            {
                "s_name": "临高县",
                "c": [{
                    "c_code": "469024",
                    "c_name": "临高县"
                }],
                "s_code": "469024"
            },
            {
                "s_name": "白沙黎族自治县",
                "c": [{
                    "c_code": "469025",
                    "c_name": "白沙黎族自治县"
                }],
                "s_code": "469025"
            },
            {
                "s_name": "昌江黎族自治县",
                "c": [{
                    "c_code": "469026",
                    "c_name": "昌江黎族自治县"
                }],
                "s_code": "469026"
            },
            {
                "s_name": "乐东黎族自治县",
                "c": [{
                    "c_code": "469027",
                    "c_name": "乐东黎族自治县"
                }],
                "s_code": "469027"
            },
            {
                "s_name": "陵水黎族自治县",
                "c": [{
                    "c_code": "469028",
                    "c_name": "陵水黎族自治县"
                }],
                "s_code": "469028"
            },
            {
                "s_name": "保亭黎族苗族自治县",
                "c": [{
                    "c_code": "469029",
                    "c_name": "保亭黎族苗族自治县"
                }],
                "s_code": "469029"
            },
            {
                "s_name": "琼中黎族苗族自治县",
                "c": [{
                    "c_code": "469030",
                    "c_name": "琼中黎族苗族自治县"
                }],
                "s_code": "469030"
            },
            {
                "s_name": "西沙群岛",
                "c": [{
                    "c_code": "469031",
                    "c_name": "西沙群岛"
                }],
                "s_code": "469031"
            },
            {
                "s_name": "南沙群岛",
                "c": [{
                    "c_code": "469032",
                    "c_name": "南沙群岛"
                }],
                "s_code": "469032"
            },
            {
                "s_name": "中沙群岛的岛礁及其海域",
                "c": [{
                    "c_code": "469033",
                    "c_name": "中沙群岛的岛礁及其海域"
                }],
                "s_code": "469033"
            }
        ],
        "p_code": "460000"
    },
    {
        "p_name": "四川省",
        "s": [{
                "s_name": "成都市",
                "c": [{
                        "c_code": "510104",
                        "c_name": "锦江区"
                    },
                    {
                        "c_code": "510105",
                        "c_name": "青羊区"
                    },
                    {
                        "c_code": "510106",
                        "c_name": "金牛区"
                    },
                    {
                        "c_code": "510107",
                        "c_name": "武侯区"
                    },
                    {
                        "c_code": "510108",
                        "c_name": "成华区"
                    },
                    {
                        "c_code": "510112",
                        "c_name": "龙泉驿区"
                    },
                    {
                        "c_code": "510113",
                        "c_name": "青白江区"
                    },
                    {
                        "c_code": "510114",
                        "c_name": "新都区"
                    },
                    {
                        "c_code": "510115",
                        "c_name": "温江区"
                    },
                    {
                        "c_code": "510121",
                        "c_name": "金堂县"
                    },
                    {
                        "c_code": "510122",
                        "c_name": "双流县"
                    },
                    {
                        "c_code": "510124",
                        "c_name": "郫县"
                    },
                    {
                        "c_code": "510129",
                        "c_name": "大邑县"
                    },
                    {
                        "c_code": "510131",
                        "c_name": "蒲江县"
                    },
                    {
                        "c_code": "510132",
                        "c_name": "新津县"
                    },
                    {
                        "c_code": "510181",
                        "c_name": "都江堰市"
                    },
                    {
                        "c_code": "510182",
                        "c_name": "彭州市"
                    },
                    {
                        "c_code": "510183",
                        "c_name": "邛崃市"
                    },
                    {
                        "c_code": "510184",
                        "c_name": "崇州市"
                    }
                ],
                "s_code": "510100"
            },
            {
                "s_name": "自贡市",
                "c": [{
                        "c_code": "510302",
                        "c_name": "自流井区"
                    },
                    {
                        "c_code": "510303",
                        "c_name": "贡井区"
                    },
                    {
                        "c_code": "510304",
                        "c_name": "大安区"
                    },
                    {
                        "c_code": "510311",
                        "c_name": "沿滩区"
                    },
                    {
                        "c_code": "510321",
                        "c_name": "荣县"
                    },
                    {
                        "c_code": "510322",
                        "c_name": "富顺县"
                    }
                ],
                "s_code": "510300"
            },
            {
                "s_name": "攀枝花市",
                "c": [{
                        "c_code": "510402",
                        "c_name": "东区"
                    },
                    {
                        "c_code": "510403",
                        "c_name": "西区"
                    },
                    {
                        "c_code": "510411",
                        "c_name": "仁和区"
                    },
                    {
                        "c_code": "510421",
                        "c_name": "米易县"
                    },
                    {
                        "c_code": "510422",
                        "c_name": "盐边县"
                    }
                ],
                "s_code": "510400"
            },
            {
                "s_name": "泸州市",
                "c": [{
                        "c_code": "510502",
                        "c_name": "江阳区"
                    },
                    {
                        "c_code": "510503",
                        "c_name": "纳溪区"
                    },
                    {
                        "c_code": "510504",
                        "c_name": "龙马潭区"
                    },
                    {
                        "c_code": "510521",
                        "c_name": "泸县"
                    },
                    {
                        "c_code": "510522",
                        "c_name": "合江县"
                    },
                    {
                        "c_code": "510524",
                        "c_name": "叙永县"
                    },
                    {
                        "c_code": "510525",
                        "c_name": "古蔺县"
                    }
                ],
                "s_code": "510500"
            },
            {
                "s_name": "德阳市",
                "c": [{
                        "c_code": "510603",
                        "c_name": "旌阳区"
                    },
                    {
                        "c_code": "510623",
                        "c_name": "中江县"
                    },
                    {
                        "c_code": "510626",
                        "c_name": "罗江县"
                    },
                    {
                        "c_code": "510681",
                        "c_name": "广汉市"
                    },
                    {
                        "c_code": "510682",
                        "c_name": "什邡市"
                    },
                    {
                        "c_code": "510683",
                        "c_name": "绵竹市"
                    }
                ],
                "s_code": "510600"
            },
            {
                "s_name": "绵阳市",
                "c": [{
                        "c_code": "510703",
                        "c_name": "涪城区"
                    },
                    {
                        "c_code": "510704",
                        "c_name": "游仙区"
                    },
                    {
                        "c_code": "510722",
                        "c_name": "三台县"
                    },
                    {
                        "c_code": "510723",
                        "c_name": "盐亭县"
                    },
                    {
                        "c_code": "510724",
                        "c_name": "安县"
                    },
                    {
                        "c_code": "510725",
                        "c_name": "梓潼县"
                    },
                    {
                        "c_code": "510726",
                        "c_name": "北川羌族自治县"
                    },
                    {
                        "c_code": "510727",
                        "c_name": "平武县"
                    },
                    {
                        "c_code": "510781",
                        "c_name": "江油市"
                    }
                ],
                "s_code": "510700"
            },
            {
                "s_name": "广元市",
                "c": [{
                        "c_code": "510802",
                        "c_name": "利州区"
                    },
                    {
                        "c_code": "510811",
                        "c_name": "元坝区"
                    },
                    {
                        "c_code": "510812",
                        "c_name": "朝天区"
                    },
                    {
                        "c_code": "510821",
                        "c_name": "旺苍县"
                    },
                    {
                        "c_code": "510822",
                        "c_name": "青川县"
                    },
                    {
                        "c_code": "510823",
                        "c_name": "剑阁县"
                    },
                    {
                        "c_code": "510824",
                        "c_name": "苍溪县"
                    }
                ],
                "s_code": "510800"
            },
            {
                "s_name": "遂宁市",
                "c": [{
                        "c_code": "510903",
                        "c_name": "船山区"
                    },
                    {
                        "c_code": "510904",
                        "c_name": "安居区"
                    },
                    {
                        "c_code": "510921",
                        "c_name": "蓬溪县"
                    },
                    {
                        "c_code": "510922",
                        "c_name": "射洪县"
                    },
                    {
                        "c_code": "510923",
                        "c_name": "大英县"
                    }
                ],
                "s_code": "510900"
            },
            {
                "s_name": "内江市",
                "c": [{
                        "c_code": "511002",
                        "c_name": "市中区"
                    },
                    {
                        "c_code": "511011",
                        "c_name": "东兴区"
                    },
                    {
                        "c_code": "511024",
                        "c_name": "威远县"
                    },
                    {
                        "c_code": "511025",
                        "c_name": "资中县"
                    },
                    {
                        "c_code": "511028",
                        "c_name": "隆昌县"
                    }
                ],
                "s_code": "511000"
            },
            {
                "s_name": "乐山市",
                "c": [{
                        "c_code": "511102",
                        "c_name": "市中区"
                    },
                    {
                        "c_code": "511111",
                        "c_name": "沙湾区"
                    },
                    {
                        "c_code": "511112",
                        "c_name": "五通桥区"
                    },
                    {
                        "c_code": "511113",
                        "c_name": "金口河区"
                    },
                    {
                        "c_code": "511123",
                        "c_name": "犍为县"
                    },
                    {
                        "c_code": "511124",
                        "c_name": "井研县"
                    },
                    {
                        "c_code": "511126",
                        "c_name": "夹江县"
                    },
                    {
                        "c_code": "511129",
                        "c_name": "沐川县"
                    },
                    {
                        "c_code": "511132",
                        "c_name": "峨边彝族自治县"
                    },
                    {
                        "c_code": "511133",
                        "c_name": "马边彝族自治县"
                    },
                    {
                        "c_code": "511181",
                        "c_name": "峨眉山市"
                    }
                ],
                "s_code": "511100"
            },
            {
                "s_name": "南充市",
                "c": [{
                        "c_code": "511302",
                        "c_name": "顺庆区"
                    },
                    {
                        "c_code": "511303",
                        "c_name": "高坪区"
                    },
                    {
                        "c_code": "511304",
                        "c_name": "嘉陵区"
                    },
                    {
                        "c_code": "511321",
                        "c_name": "南部县"
                    },
                    {
                        "c_code": "511322",
                        "c_name": "营山县"
                    },
                    {
                        "c_code": "511323",
                        "c_name": "蓬安县"
                    },
                    {
                        "c_code": "511324",
                        "c_name": "仪陇县"
                    },
                    {
                        "c_code": "511325",
                        "c_name": "西充县"
                    },
                    {
                        "c_code": "511381",
                        "c_name": "阆中市"
                    }
                ],
                "s_code": "511300"
            },
            {
                "s_name": "眉山市",
                "c": [{
                        "c_code": "511402",
                        "c_name": "东坡区"
                    },
                    {
                        "c_code": "511421",
                        "c_name": "仁寿县"
                    },
                    {
                        "c_code": "511422",
                        "c_name": "彭山县"
                    },
                    {
                        "c_code": "511423",
                        "c_name": "洪雅县"
                    },
                    {
                        "c_code": "511424",
                        "c_name": "丹棱县"
                    },
                    {
                        "c_code": "511425",
                        "c_name": "青神县"
                    }
                ],
                "s_code": "511400"
            },
            {
                "s_name": "宜宾市",
                "c": [{
                        "c_code": "511502",
                        "c_name": "翠屏区"
                    },
                    {
                        "c_code": "511521",
                        "c_name": "宜宾县"
                    },
                    {
                        "c_code": "511522",
                        "c_name": "南溪县"
                    },
                    {
                        "c_code": "511523",
                        "c_name": "江安县"
                    },
                    {
                        "c_code": "511524",
                        "c_name": "长宁县"
                    },
                    {
                        "c_code": "511525",
                        "c_name": "高县"
                    },
                    {
                        "c_code": "511526",
                        "c_name": "珙县"
                    },
                    {
                        "c_code": "511527",
                        "c_name": "筠连县"
                    },
                    {
                        "c_code": "511528",
                        "c_name": "兴文县"
                    },
                    {
                        "c_code": "511529",
                        "c_name": "屏山县"
                    }
                ],
                "s_code": "511500"
            },
            {
                "s_name": "广安市",
                "c": [{
                        "c_code": "511602",
                        "c_name": "广安区"
                    },
                    {
                        "c_code": "511621",
                        "c_name": "岳池县"
                    },
                    {
                        "c_code": "511622",
                        "c_name": "武胜县"
                    },
                    {
                        "c_code": "511623",
                        "c_name": "邻水县"
                    },
                    {
                        "c_code": "511681",
                        "c_name": "华蓥市"
                    }
                ],
                "s_code": "511600"
            },
            {
                "s_name": "达州市",
                "c": [{
                        "c_code": "511702",
                        "c_name": "通川区"
                    },
                    {
                        "c_code": "511721",
                        "c_name": "达县"
                    },
                    {
                        "c_code": "511722",
                        "c_name": "宣汉县"
                    },
                    {
                        "c_code": "511723",
                        "c_name": "开江县"
                    },
                    {
                        "c_code": "511724",
                        "c_name": "大竹县"
                    },
                    {
                        "c_code": "511725",
                        "c_name": "渠县"
                    },
                    {
                        "c_code": "511781",
                        "c_name": "万源市"
                    }
                ],
                "s_code": "511700"
            },
            {
                "s_name": "雅安市",
                "c": [{
                        "c_code": "511802",
                        "c_name": "雨城区"
                    },
                    {
                        "c_code": "511821",
                        "c_name": "名山县"
                    },
                    {
                        "c_code": "511822",
                        "c_name": "荥经县"
                    },
                    {
                        "c_code": "511823",
                        "c_name": "汉源县"
                    },
                    {
                        "c_code": "511824",
                        "c_name": "石棉县"
                    },
                    {
                        "c_code": "511825",
                        "c_name": "天全县"
                    },
                    {
                        "c_code": "511826",
                        "c_name": "芦山县"
                    },
                    {
                        "c_code": "511827",
                        "c_name": "宝兴县"
                    }
                ],
                "s_code": "511800"
            },
            {
                "s_name": "巴中市",
                "c": [{
                        "c_code": "511902",
                        "c_name": "巴州区"
                    },
                    {
                        "c_code": "511921",
                        "c_name": "通江县"
                    },
                    {
                        "c_code": "511922",
                        "c_name": "南江县"
                    },
                    {
                        "c_code": "511923",
                        "c_name": "平昌县"
                    }
                ],
                "s_code": "511900"
            },
            {
                "s_name": "资阳市",
                "c": [{
                        "c_code": "512002",
                        "c_name": "雁江区"
                    },
                    {
                        "c_code": "512021",
                        "c_name": "安岳县"
                    },
                    {
                        "c_code": "512022",
                        "c_name": "乐至县"
                    },
                    {
                        "c_code": "512081",
                        "c_name": "简阳市"
                    }
                ],
                "s_code": "512000"
            },
            {
                "s_name": "阿坝藏族羌族自治州",
                "c": [{
                        "c_code": "513221",
                        "c_name": "汶川县"
                    },
                    {
                        "c_code": "513222",
                        "c_name": "理县"
                    },
                    {
                        "c_code": "513223",
                        "c_name": "茂县"
                    },
                    {
                        "c_code": "513224",
                        "c_name": "松潘县"
                    },
                    {
                        "c_code": "513225",
                        "c_name": "九寨沟县"
                    },
                    {
                        "c_code": "513226",
                        "c_name": "金川县"
                    },
                    {
                        "c_code": "513227",
                        "c_name": "小金县"
                    },
                    {
                        "c_code": "513228",
                        "c_name": "黑水县"
                    },
                    {
                        "c_code": "513229",
                        "c_name": "马尔康县"
                    },
                    {
                        "c_code": "513230",
                        "c_name": "壤塘县"
                    },
                    {
                        "c_code": "513231",
                        "c_name": "阿坝县"
                    },
                    {
                        "c_code": "513232",
                        "c_name": "若尔盖县"
                    },
                    {
                        "c_code": "513233",
                        "c_name": "红原县"
                    }
                ],
                "s_code": "513200"
            },
            {
                "s_name": "甘孜藏族自治州",
                "c": [{
                        "c_code": "513321",
                        "c_name": "康定县"
                    },
                    {
                        "c_code": "513322",
                        "c_name": "泸定县"
                    },
                    {
                        "c_code": "513323",
                        "c_name": "丹巴县"
                    },
                    {
                        "c_code": "513324",
                        "c_name": "九龙县"
                    },
                    {
                        "c_code": "513325",
                        "c_name": "雅江县"
                    },
                    {
                        "c_code": "513326",
                        "c_name": "道孚县"
                    },
                    {
                        "c_code": "513327",
                        "c_name": "炉霍县"
                    },
                    {
                        "c_code": "513328",
                        "c_name": "甘孜县"
                    },
                    {
                        "c_code": "513329",
                        "c_name": "新龙县"
                    },
                    {
                        "c_code": "513330",
                        "c_name": "德格县"
                    },
                    {
                        "c_code": "513331",
                        "c_name": "白玉县"
                    },
                    {
                        "c_code": "513332",
                        "c_name": "石渠县"
                    },
                    {
                        "c_code": "513333",
                        "c_name": "色达县"
                    },
                    {
                        "c_code": "513334",
                        "c_name": "理塘县"
                    },
                    {
                        "c_code": "513335",
                        "c_name": "巴塘县"
                    },
                    {
                        "c_code": "513336",
                        "c_name": "乡城县"
                    },
                    {
                        "c_code": "513337",
                        "c_name": "稻城县"
                    },
                    {
                        "c_code": "513338",
                        "c_name": "得荣县"
                    }
                ],
                "s_code": "513300"
            },
            {
                "s_name": "凉山彝族自治州",
                "c": [{
                        "c_code": "513401",
                        "c_name": "西昌市"
                    },
                    {
                        "c_code": "513422",
                        "c_name": "木里藏族自治县"
                    },
                    {
                        "c_code": "513423",
                        "c_name": "盐源县"
                    },
                    {
                        "c_code": "513424",
                        "c_name": "德昌县"
                    },
                    {
                        "c_code": "513425",
                        "c_name": "会理县"
                    },
                    {
                        "c_code": "513426",
                        "c_name": "会东县"
                    },
                    {
                        "c_code": "513427",
                        "c_name": "宁南县"
                    },
                    {
                        "c_code": "513428",
                        "c_name": "普格县"
                    },
                    {
                        "c_code": "513429",
                        "c_name": "布拖县"
                    },
                    {
                        "c_code": "513430",
                        "c_name": "金阳县"
                    },
                    {
                        "c_code": "513431",
                        "c_name": "昭觉县"
                    },
                    {
                        "c_code": "513432",
                        "c_name": "喜德县"
                    },
                    {
                        "c_code": "513433",
                        "c_name": "冕宁县"
                    },
                    {
                        "c_code": "513434",
                        "c_name": "越西县"
                    },
                    {
                        "c_code": "513435",
                        "c_name": "甘洛县"
                    },
                    {
                        "c_code": "513436",
                        "c_name": "美姑县"
                    },
                    {
                        "c_code": "513437",
                        "c_name": "雷波县"
                    }
                ],
                "s_code": "513400"
            }
        ],
        "p_code": "510000"
    },
    {
        "p_name": "贵州省",
        "s": [{
                "s_name": "贵阳市",
                "c": [{
                        "c_code": "520102",
                        "c_name": "南明区"
                    },
                    {
                        "c_code": "520103",
                        "c_name": "云岩区"
                    },
                    {
                        "c_code": "520111",
                        "c_name": "花溪区"
                    },
                    {
                        "c_code": "520112",
                        "c_name": "乌当区"
                    },
                    {
                        "c_code": "520113",
                        "c_name": "白云区"
                    },
                    {
                        "c_code": "520114",
                        "c_name": "小河区"
                    },
                    {
                        "c_code": "520121",
                        "c_name": "开阳县"
                    },
                    {
                        "c_code": "520122",
                        "c_name": "息烽县"
                    },
                    {
                        "c_code": "520123",
                        "c_name": "修文县"
                    },
                    {
                        "c_code": "520181",
                        "c_name": "清镇市"
                    }
                ],
                "s_code": "520100"
            },
            {
                "s_name": "六盘水市",
                "c": [{
                        "c_code": "520201",
                        "c_name": "钟山区"
                    },
                    {
                        "c_code": "520203",
                        "c_name": "六枝特区"
                    },
                    {
                        "c_code": "520221",
                        "c_name": "水城县"
                    },
                    {
                        "c_code": "520222",
                        "c_name": "盘县"
                    }
                ],
                "s_code": "520200"
            },
            {
                "s_name": "遵义市",
                "c": [{
                        "c_code": "520302",
                        "c_name": "红花岗区"
                    },
                    {
                        "c_code": "520303",
                        "c_name": "汇川区"
                    },
                    {
                        "c_code": "520321",
                        "c_name": "遵义县"
                    },
                    {
                        "c_code": "520322",
                        "c_name": "桐梓县"
                    },
                    {
                        "c_code": "520323",
                        "c_name": "绥阳县"
                    },
                    {
                        "c_code": "520324",
                        "c_name": "正安县"
                    },
                    {
                        "c_code": "520325",
                        "c_name": "道真仡佬族苗族自治县"
                    },
                    {
                        "c_code": "520326",
                        "c_name": "务川仡佬族苗族自治县"
                    },
                    {
                        "c_code": "520327",
                        "c_name": "凤冈县"
                    },
                    {
                        "c_code": "520328",
                        "c_name": "湄潭县"
                    },
                    {
                        "c_code": "520329",
                        "c_name": "余庆县"
                    },
                    {
                        "c_code": "520330",
                        "c_name": "习水县"
                    },
                    {
                        "c_code": "520381",
                        "c_name": "赤水市"
                    },
                    {
                        "c_code": "520382",
                        "c_name": "仁怀市"
                    }
                ],
                "s_code": "520300"
            },
            {
                "s_name": "安顺市",
                "c": [{
                        "c_code": "520402",
                        "c_name": "西秀区"
                    },
                    {
                        "c_code": "520421",
                        "c_name": "平坝县"
                    },
                    {
                        "c_code": "520422",
                        "c_name": "普定县"
                    },
                    {
                        "c_code": "520423",
                        "c_name": "镇宁布依族苗族自治县"
                    },
                    {
                        "c_code": "520424",
                        "c_name": "关岭布依族苗族自治县"
                    },
                    {
                        "c_code": "520425",
                        "c_name": "紫云苗族布依族自治县"
                    }
                ],
                "s_code": "520400"
            },
            {
                "s_name": "铜仁地区",
                "c": [{
                        "c_code": "522201",
                        "c_name": "铜仁市"
                    },
                    {
                        "c_code": "522222",
                        "c_name": "江口县"
                    },
                    {
                        "c_code": "522223",
                        "c_name": "玉屏侗族自治县"
                    },
                    {
                        "c_code": "522224",
                        "c_name": "石阡县"
                    },
                    {
                        "c_code": "522225",
                        "c_name": "思南县"
                    },
                    {
                        "c_code": "522226",
                        "c_name": "印江土家族苗族自治县"
                    },
                    {
                        "c_code": "522227",
                        "c_name": "德江县"
                    },
                    {
                        "c_code": "522228",
                        "c_name": "沿河土家族自治县"
                    },
                    {
                        "c_code": "522229",
                        "c_name": "松桃苗族自治县"
                    },
                    {
                        "c_code": "522230",
                        "c_name": "万山特区"
                    }
                ],
                "s_code": "522200"
            },
            {
                "s_name": "黔西南布依族苗族自治州",
                "c": [{
                        "c_code": "522301",
                        "c_name": "兴义市"
                    },
                    {
                        "c_code": "522322",
                        "c_name": "兴仁县"
                    },
                    {
                        "c_code": "522323",
                        "c_name": "普安县"
                    },
                    {
                        "c_code": "522324",
                        "c_name": "晴隆县"
                    },
                    {
                        "c_code": "522325",
                        "c_name": "贞丰县"
                    },
                    {
                        "c_code": "522326",
                        "c_name": "望谟县"
                    },
                    {
                        "c_code": "522327",
                        "c_name": "册亨县"
                    },
                    {
                        "c_code": "522328",
                        "c_name": "安龙县"
                    }
                ],
                "s_code": "522300"
            },
            {
                "s_name": "毕节地区",
                "c": [{
                        "c_code": "522401",
                        "c_name": "毕节市"
                    },
                    {
                        "c_code": "522422",
                        "c_name": "大方县"
                    },
                    {
                        "c_code": "522423",
                        "c_name": "黔西县"
                    },
                    {
                        "c_code": "522424",
                        "c_name": "金沙县"
                    },
                    {
                        "c_code": "522425",
                        "c_name": "织金县"
                    },
                    {
                        "c_code": "522426",
                        "c_name": "纳雍县"
                    },
                    {
                        "c_code": "522427",
                        "c_name": "威宁彝族回族苗族自治县"
                    },
                    {
                        "c_code": "522428",
                        "c_name": "赫章县"
                    }
                ],
                "s_code": "522400"
            },
            {
                "s_name": "黔东南苗族侗族自治州",
                "c": [{
                        "c_code": "522601",
                        "c_name": "凯里市"
                    },
                    {
                        "c_code": "522622",
                        "c_name": "黄平县"
                    },
                    {
                        "c_code": "522623",
                        "c_name": "施秉县"
                    },
                    {
                        "c_code": "522624",
                        "c_name": "三穗县"
                    },
                    {
                        "c_code": "522625",
                        "c_name": "镇远县"
                    },
                    {
                        "c_code": "522626",
                        "c_name": "岑巩县"
                    },
                    {
                        "c_code": "522627",
                        "c_name": "天柱县"
                    },
                    {
                        "c_code": "522628",
                        "c_name": "锦屏县"
                    },
                    {
                        "c_code": "522629",
                        "c_name": "剑河县"
                    },
                    {
                        "c_code": "522630",
                        "c_name": "台江县"
                    },
                    {
                        "c_code": "522631",
                        "c_name": "黎平县"
                    },
                    {
                        "c_code": "522632",
                        "c_name": "榕江县"
                    },
                    {
                        "c_code": "522633",
                        "c_name": "从江县"
                    },
                    {
                        "c_code": "522634",
                        "c_name": "雷山县"
                    },
                    {
                        "c_code": "522635",
                        "c_name": "麻江县"
                    },
                    {
                        "c_code": "522636",
                        "c_name": "丹寨县"
                    }
                ],
                "s_code": "522600"
            },
            {
                "s_name": "黔南布依族苗族自治州",
                "c": [{
                        "c_code": "522701",
                        "c_name": "都匀市"
                    },
                    {
                        "c_code": "522702",
                        "c_name": "福泉市"
                    },
                    {
                        "c_code": "522722",
                        "c_name": "荔波县"
                    },
                    {
                        "c_code": "522723",
                        "c_name": "贵定县"
                    },
                    {
                        "c_code": "522725",
                        "c_name": "瓮安县"
                    },
                    {
                        "c_code": "522726",
                        "c_name": "独山县"
                    },
                    {
                        "c_code": "522727",
                        "c_name": "平塘县"
                    },
                    {
                        "c_code": "522728",
                        "c_name": "罗甸县"
                    },
                    {
                        "c_code": "522729",
                        "c_name": "长顺县"
                    },
                    {
                        "c_code": "522730",
                        "c_name": "龙里县"
                    },
                    {
                        "c_code": "522731",
                        "c_name": "惠水县"
                    },
                    {
                        "c_code": "522732",
                        "c_name": "三都水族自治县"
                    }
                ],
                "s_code": "522700"
            }
        ],
        "p_code": "520000"
    },
    {
        "p_name": "云南省",
        "s": [{
                "s_name": "昆明市",
                "c": [{
                        "c_code": "530102",
                        "c_name": "五华区"
                    },
                    {
                        "c_code": "530103",
                        "c_name": "盘龙区"
                    },
                    {
                        "c_code": "530111",
                        "c_name": "官渡区"
                    },
                    {
                        "c_code": "530112",
                        "c_name": "西山区"
                    },
                    {
                        "c_code": "530113",
                        "c_name": "东川区"
                    },
                    {
                        "c_code": "530121",
                        "c_name": "呈贡县"
                    },
                    {
                        "c_code": "530122",
                        "c_name": "晋宁县"
                    },
                    {
                        "c_code": "530124",
                        "c_name": "富民县"
                    },
                    {
                        "c_code": "530125",
                        "c_name": "宜良县"
                    },
                    {
                        "c_code": "530126",
                        "c_name": "石林彝族自治县"
                    },
                    {
                        "c_code": "530127",
                        "c_name": "嵩明县"
                    },
                    {
                        "c_code": "530128",
                        "c_name": "禄劝彝族苗族自治县"
                    },
                    {
                        "c_code": "530129",
                        "c_name": "寻甸回族彝族自治县"
                    },
                    {
                        "c_code": "530181",
                        "c_name": "安宁市"
                    }
                ],
                "s_code": "530100"
            },
            {
                "s_name": "曲靖市",
                "c": [{
                        "c_code": "530302",
                        "c_name": "麒麟区"
                    },
                    {
                        "c_code": "530321",
                        "c_name": "马龙县"
                    },
                    {
                        "c_code": "530322",
                        "c_name": "陆良县"
                    },
                    {
                        "c_code": "530323",
                        "c_name": "师宗县"
                    },
                    {
                        "c_code": "530324",
                        "c_name": "罗平县"
                    },
                    {
                        "c_code": "530325",
                        "c_name": "富源县"
                    },
                    {
                        "c_code": "530326",
                        "c_name": "会泽县"
                    },
                    {
                        "c_code": "530328",
                        "c_name": "沾益县"
                    },
                    {
                        "c_code": "530381",
                        "c_name": "宣威市"
                    }
                ],
                "s_code": "530300"
            },
            {
                "s_name": "玉溪市",
                "c": [{
                        "c_code": "530402",
                        "c_name": "红塔区"
                    },
                    {
                        "c_code": "530421",
                        "c_name": "江川县"
                    },
                    {
                        "c_code": "530422",
                        "c_name": "澄江县"
                    },
                    {
                        "c_code": "530423",
                        "c_name": "通海县"
                    },
                    {
                        "c_code": "530424",
                        "c_name": "华宁县"
                    },
                    {
                        "c_code": "530425",
                        "c_name": "易门县"
                    },
                    {
                        "c_code": "530426",
                        "c_name": "峨山彝族自治县"
                    },
                    {
                        "c_code": "530427",
                        "c_name": "新平彝族傣族自治县"
                    },
                    {
                        "c_code": "530428",
                        "c_name": "元江哈尼族彝族傣族自治县"
                    }
                ],
                "s_code": "530400"
            },
            {
                "s_name": "保山市",
                "c": [{
                        "c_code": "530502",
                        "c_name": "隆阳区"
                    },
                    {
                        "c_code": "530521",
                        "c_name": "施甸县"
                    },
                    {
                        "c_code": "530522",
                        "c_name": "腾冲县"
                    },
                    {
                        "c_code": "530523",
                        "c_name": "龙陵县"
                    },
                    {
                        "c_code": "530524",
                        "c_name": "昌宁县"
                    }
                ],
                "s_code": "530500"
            },
            {
                "s_name": "昭通市",
                "c": [{
                        "c_code": "530602",
                        "c_name": "昭阳区"
                    },
                    {
                        "c_code": "530621",
                        "c_name": "鲁甸县"
                    },
                    {
                        "c_code": "530622",
                        "c_name": "巧家县"
                    },
                    {
                        "c_code": "530623",
                        "c_name": "盐津县"
                    },
                    {
                        "c_code": "530624",
                        "c_name": "大关县"
                    },
                    {
                        "c_code": "530625",
                        "c_name": "永善县"
                    },
                    {
                        "c_code": "530626",
                        "c_name": "绥江县"
                    },
                    {
                        "c_code": "530627",
                        "c_name": "镇雄县"
                    },
                    {
                        "c_code": "530628",
                        "c_name": "彝良县"
                    },
                    {
                        "c_code": "530629",
                        "c_name": "威信县"
                    },
                    {
                        "c_code": "530630",
                        "c_name": "水富县"
                    }
                ],
                "s_code": "530600"
            },
            {
                "s_name": "丽江市",
                "c": [{
                        "c_code": "530702",
                        "c_name": "古城区"
                    },
                    {
                        "c_code": "530721",
                        "c_name": "玉龙纳西族自治县"
                    },
                    {
                        "c_code": "530722",
                        "c_name": "永胜县"
                    },
                    {
                        "c_code": "530723",
                        "c_name": "华坪县"
                    },
                    {
                        "c_code": "530724",
                        "c_name": "宁蒗彝族自治县"
                    }
                ],
                "s_code": "530700"
            },
            {
                "s_name": "普洱市",
                "c": [{
                        "c_code": "530802",
                        "c_name": "思茅区"
                    },
                    {
                        "c_code": "530821",
                        "c_name": "宁洱哈尼族彝族自治县"
                    },
                    {
                        "c_code": "530822",
                        "c_name": "墨江哈尼族自治县"
                    },
                    {
                        "c_code": "530823",
                        "c_name": "景东彝族自治县"
                    },
                    {
                        "c_code": "530824",
                        "c_name": "景谷傣族彝族自治县"
                    },
                    {
                        "c_code": "530825",
                        "c_name": "镇沅彝族哈尼族拉祜族自治县"
                    },
                    {
                        "c_code": "530826",
                        "c_name": "江城哈尼族彝族自治县"
                    },
                    {
                        "c_code": "530827",
                        "c_name": "孟连傣族拉祜族佤族自治县"
                    },
                    {
                        "c_code": "530828",
                        "c_name": "澜沧拉祜族自治县"
                    },
                    {
                        "c_code": "530829",
                        "c_name": "西盟佤族自治县"
                    }
                ],
                "s_code": "530800"
            },
            {
                "s_name": "临沧市",
                "c": [{
                        "c_code": "530902",
                        "c_name": "临翔区"
                    },
                    {
                        "c_code": "530921",
                        "c_name": "凤庆县"
                    },
                    {
                        "c_code": "530922",
                        "c_name": "云县"
                    },
                    {
                        "c_code": "530923",
                        "c_name": "永德县"
                    },
                    {
                        "c_code": "530924",
                        "c_name": "镇康县"
                    },
                    {
                        "c_code": "530925",
                        "c_name": "双江拉祜族佤族布朗族傣族自治县"
                    },
                    {
                        "c_code": "530926",
                        "c_name": "耿马傣族佤族自治县"
                    },
                    {
                        "c_code": "530927",
                        "c_name": "沧源佤族自治县"
                    }
                ],
                "s_code": "530900"
            },
            {
                "s_name": "楚雄彝族自治州",
                "c": [{
                        "c_code": "532301",
                        "c_name": "楚雄市"
                    },
                    {
                        "c_code": "532322",
                        "c_name": "双柏县"
                    },
                    {
                        "c_code": "532323",
                        "c_name": "牟定县"
                    },
                    {
                        "c_code": "532324",
                        "c_name": "南华县"
                    },
                    {
                        "c_code": "532325",
                        "c_name": "姚安县"
                    },
                    {
                        "c_code": "532326",
                        "c_name": "大姚县"
                    },
                    {
                        "c_code": "532327",
                        "c_name": "永仁县"
                    },
                    {
                        "c_code": "532328",
                        "c_name": "元谋县"
                    },
                    {
                        "c_code": "532329",
                        "c_name": "武定县"
                    },
                    {
                        "c_code": "532331",
                        "c_name": "禄丰县"
                    }
                ],
                "s_code": "532300"
            },
            {
                "s_name": "红河哈尼族彝族自治州",
                "c": [{
                        "c_code": "532501",
                        "c_name": "个旧市"
                    },
                    {
                        "c_code": "532502",
                        "c_name": "开远市"
                    },
                    {
                        "c_code": "532522",
                        "c_name": "蒙自县"
                    },
                    {
                        "c_code": "532523",
                        "c_name": "屏边苗族自治县"
                    },
                    {
                        "c_code": "532524",
                        "c_name": "建水县"
                    },
                    {
                        "c_code": "532525",
                        "c_name": "石屏县"
                    },
                    {
                        "c_code": "532526",
                        "c_name": "弥勒县"
                    },
                    {
                        "c_code": "532527",
                        "c_name": "泸西县"
                    },
                    {
                        "c_code": "532528",
                        "c_name": "元阳县"
                    },
                    {
                        "c_code": "532529",
                        "c_name": "红河县"
                    },
                    {
                        "c_code": "532530",
                        "c_name": "金平苗族瑶族傣族自治县"
                    },
                    {
                        "c_code": "532531",
                        "c_name": "绿春县"
                    },
                    {
                        "c_code": "532532",
                        "c_name": "河口瑶族自治县"
                    }
                ],
                "s_code": "532500"
            },
            {
                "s_name": "文山壮族苗族自治州",
                "c": [{
                        "c_code": "532621",
                        "c_name": "文山县"
                    },
                    {
                        "c_code": "532622",
                        "c_name": "砚山县"
                    },
                    {
                        "c_code": "532623",
                        "c_name": "西畴县"
                    },
                    {
                        "c_code": "532624",
                        "c_name": "麻栗坡县"
                    },
                    {
                        "c_code": "532625",
                        "c_name": "马关县"
                    },
                    {
                        "c_code": "532626",
                        "c_name": "丘北县"
                    },
                    {
                        "c_code": "532627",
                        "c_name": "广南县"
                    },
                    {
                        "c_code": "532628",
                        "c_name": "富宁县"
                    }
                ],
                "s_code": "532600"
            },
            {
                "s_name": "西双版纳傣族自治州",
                "c": [{
                        "c_code": "532801",
                        "c_name": "景洪市"
                    },
                    {
                        "c_code": "532822",
                        "c_name": "勐海县"
                    },
                    {
                        "c_code": "532823",
                        "c_name": "勐腊县"
                    }
                ],
                "s_code": "532800"
            },
            {
                "s_name": "大理白族自治州",
                "c": [{
                        "c_code": "532901",
                        "c_name": "大理市"
                    },
                    {
                        "c_code": "532922",
                        "c_name": "漾濞彝族自治县"
                    },
                    {
                        "c_code": "532923",
                        "c_name": "祥云县"
                    },
                    {
                        "c_code": "532924",
                        "c_name": "宾川县"
                    },
                    {
                        "c_code": "532925",
                        "c_name": "弥渡县"
                    },
                    {
                        "c_code": "532926",
                        "c_name": "南涧彝族自治县"
                    },
                    {
                        "c_code": "532927",
                        "c_name": "巍山彝族回族自治县"
                    },
                    {
                        "c_code": "532928",
                        "c_name": "永平县"
                    },
                    {
                        "c_code": "532929",
                        "c_name": "云龙县"
                    },
                    {
                        "c_code": "532930",
                        "c_name": "洱源县"
                    },
                    {
                        "c_code": "532931",
                        "c_name": "剑川县"
                    },
                    {
                        "c_code": "532932",
                        "c_name": "鹤庆县"
                    }
                ],
                "s_code": "532900"
            },
            {
                "s_name": "德宏傣族景颇族自治州",
                "c": [{
                        "c_code": "533102",
                        "c_name": "瑞丽市"
                    },
                    {
                        "c_code": "533103",
                        "c_name": "潞西市"
                    },
                    {
                        "c_code": "533122",
                        "c_name": "梁河县"
                    },
                    {
                        "c_code": "533123",
                        "c_name": "盈江县"
                    },
                    {
                        "c_code": "533124",
                        "c_name": "陇川县"
                    }
                ],
                "s_code": "533100"
            },
            {
                "s_name": "怒江傈僳族自治州",
                "c": [{
                        "c_code": "533321",
                        "c_name": "泸水县"
                    },
                    {
                        "c_code": "533323",
                        "c_name": "福贡县"
                    },
                    {
                        "c_code": "533324",
                        "c_name": "贡山独龙族怒族自治县"
                    },
                    {
                        "c_code": "533325",
                        "c_name": "兰坪白族普米族自治县"
                    }
                ],
                "s_code": "533300"
            },
            {
                "s_name": "迪庆藏族自治州",
                "c": [{
                        "c_code": "533421",
                        "c_name": "香格里拉县"
                    },
                    {
                        "c_code": "533422",
                        "c_name": "德钦县"
                    },
                    {
                        "c_code": "533423",
                        "c_name": "维西傈僳族自治县"
                    }
                ],
                "s_code": "533400"
            }
        ],
        "p_code": "530000"
    },
    {
        "p_name": "西藏自治区",
        "s": [{
                "s_name": "拉萨市",
                "c": [{
                        "c_code": "540102",
                        "c_name": "城关区"
                    },
                    {
                        "c_code": "540121",
                        "c_name": "林周县"
                    },
                    {
                        "c_code": "540122",
                        "c_name": "当雄县"
                    },
                    {
                        "c_code": "540123",
                        "c_name": "尼木县"
                    },
                    {
                        "c_code": "540124",
                        "c_name": "曲水县"
                    },
                    {
                        "c_code": "540125",
                        "c_name": "堆龙德庆县"
                    },
                    {
                        "c_code": "540126",
                        "c_name": "达孜县"
                    },
                    {
                        "c_code": "540127",
                        "c_name": "墨竹工卡县"
                    }
                ],
                "s_code": "540100"
            },
            {
                "s_name": "昌都地区",
                "c": [{
                        "c_code": "542121",
                        "c_name": "昌都县"
                    },
                    {
                        "c_code": "542122",
                        "c_name": "江达县"
                    },
                    {
                        "c_code": "542123",
                        "c_name": "贡觉县"
                    },
                    {
                        "c_code": "542124",
                        "c_name": "类乌齐县"
                    },
                    {
                        "c_code": "542125",
                        "c_name": "丁青县"
                    },
                    {
                        "c_code": "542126",
                        "c_name": "察雅县"
                    },
                    {
                        "c_code": "542127",
                        "c_name": "八宿县"
                    },
                    {
                        "c_code": "542128",
                        "c_name": "左贡县"
                    },
                    {
                        "c_code": "542129",
                        "c_name": "芒康县"
                    },
                    {
                        "c_code": "542132",
                        "c_name": "洛隆县"
                    },
                    {
                        "c_code": "542133",
                        "c_name": "边坝县"
                    }
                ],
                "s_code": "542100"
            },
            {
                "s_name": "山南地区",
                "c": [{
                        "c_code": "542221",
                        "c_name": "乃东县"
                    },
                    {
                        "c_code": "542222",
                        "c_name": "扎囊县"
                    },
                    {
                        "c_code": "542223",
                        "c_name": "贡嘎县"
                    },
                    {
                        "c_code": "542224",
                        "c_name": "桑日县"
                    },
                    {
                        "c_code": "542225",
                        "c_name": "琼结县"
                    },
                    {
                        "c_code": "542226",
                        "c_name": "曲松县"
                    },
                    {
                        "c_code": "542227",
                        "c_name": "措美县"
                    },
                    {
                        "c_code": "542228",
                        "c_name": "洛扎县"
                    },
                    {
                        "c_code": "542229",
                        "c_name": "加查县"
                    },
                    {
                        "c_code": "542231",
                        "c_name": "隆子县"
                    },
                    {
                        "c_code": "542232",
                        "c_name": "错那县"
                    },
                    {
                        "c_code": "542233",
                        "c_name": "浪卡子县"
                    }
                ],
                "s_code": "542200"
            },
            {
                "s_name": "日喀则地区",
                "c": [{
                        "c_code": "542301",
                        "c_name": "日喀则市"
                    },
                    {
                        "c_code": "542322",
                        "c_name": "南木林县"
                    },
                    {
                        "c_code": "542323",
                        "c_name": "江孜县"
                    },
                    {
                        "c_code": "542324",
                        "c_name": "定日县"
                    },
                    {
                        "c_code": "542325",
                        "c_name": "萨迦县"
                    },
                    {
                        "c_code": "542326",
                        "c_name": "拉孜县"
                    },
                    {
                        "c_code": "542327",
                        "c_name": "昂仁县"
                    },
                    {
                        "c_code": "542328",
                        "c_name": "谢通门县"
                    },
                    {
                        "c_code": "542329",
                        "c_name": "白朗县"
                    },
                    {
                        "c_code": "542330",
                        "c_name": "仁布县"
                    },
                    {
                        "c_code": "542331",
                        "c_name": "康马县"
                    },
                    {
                        "c_code": "542332",
                        "c_name": "定结县"
                    },
                    {
                        "c_code": "542333",
                        "c_name": "仲巴县"
                    },
                    {
                        "c_code": "542334",
                        "c_name": "亚东县"
                    },
                    {
                        "c_code": "542335",
                        "c_name": "吉隆县"
                    },
                    {
                        "c_code": "542336",
                        "c_name": "聂拉木县"
                    },
                    {
                        "c_code": "542337",
                        "c_name": "萨嘎县"
                    },
                    {
                        "c_code": "542338",
                        "c_name": "岗巴县"
                    }
                ],
                "s_code": "542300"
            },
            {
                "s_name": "那曲地区",
                "c": [{
                        "c_code": "542421",
                        "c_name": "那曲县"
                    },
                    {
                        "c_code": "542422",
                        "c_name": "嘉黎县"
                    },
                    {
                        "c_code": "542423",
                        "c_name": "比如县"
                    },
                    {
                        "c_code": "542424",
                        "c_name": "聂荣县"
                    },
                    {
                        "c_code": "542425",
                        "c_name": "安多县"
                    },
                    {
                        "c_code": "542426",
                        "c_name": "申扎县"
                    },
                    {
                        "c_code": "542427",
                        "c_name": "索县"
                    },
                    {
                        "c_code": "542428",
                        "c_name": "班戈县"
                    },
                    {
                        "c_code": "542429",
                        "c_name": "巴青县"
                    },
                    {
                        "c_code": "542430",
                        "c_name": "尼玛县"
                    }
                ],
                "s_code": "542400"
            },
            {
                "s_name": "阿里地区",
                "c": [{
                        "c_code": "542521",
                        "c_name": "普兰县"
                    },
                    {
                        "c_code": "542522",
                        "c_name": "札达县"
                    },
                    {
                        "c_code": "542523",
                        "c_name": "噶尔县"
                    },
                    {
                        "c_code": "542524",
                        "c_name": "日土县"
                    },
                    {
                        "c_code": "542525",
                        "c_name": "革吉县"
                    },
                    {
                        "c_code": "542526",
                        "c_name": "改则县"
                    },
                    {
                        "c_code": "542527",
                        "c_name": "措勤县"
                    }
                ],
                "s_code": "542500"
            },
            {
                "s_name": "林芝地区",
                "c": [{
                        "c_code": "542621",
                        "c_name": "林芝县"
                    },
                    {
                        "c_code": "542622",
                        "c_name": "工布江达县"
                    },
                    {
                        "c_code": "542623",
                        "c_name": "米林县"
                    },
                    {
                        "c_code": "542624",
                        "c_name": "墨脱县"
                    },
                    {
                        "c_code": "542625",
                        "c_name": "波密县"
                    },
                    {
                        "c_code": "542626",
                        "c_name": "察隅县"
                    },
                    {
                        "c_code": "542627",
                        "c_name": "朗县"
                    }
                ],
                "s_code": "542600"
            }
        ],
        "p_code": "540000"
    },
    {
        "p_name": "陕西省",
        "s": [{
                "s_name": "西安市",
                "c": [{
                        "c_code": "610102",
                        "c_name": "新城区"
                    },
                    {
                        "c_code": "610103",
                        "c_name": "碑林区"
                    },
                    {
                        "c_code": "610104",
                        "c_name": "莲湖区"
                    },
                    {
                        "c_code": "610111",
                        "c_name": "灞桥区"
                    },
                    {
                        "c_code": "610112",
                        "c_name": "未央区"
                    },
                    {
                        "c_code": "610113",
                        "c_name": "雁塔区"
                    },
                    {
                        "c_code": "610114",
                        "c_name": "阎良区"
                    },
                    {
                        "c_code": "610115",
                        "c_name": "临潼区"
                    },
                    {
                        "c_code": "610116",
                        "c_name": "长安区"
                    },
                    {
                        "c_code": "610122",
                        "c_name": "蓝田县"
                    },
                    {
                        "c_code": "610124",
                        "c_name": "周至县"
                    },
                    {
                        "c_code": "610125",
                        "c_name": "户县"
                    },
                    {
                        "c_code": "610126",
                        "c_name": "高陵县"
                    }
                ],
                "s_code": "610100"
            },
            {
                "s_name": "铜川市",
                "c": [{
                        "c_code": "610202",
                        "c_name": "王益区"
                    },
                    {
                        "c_code": "610203",
                        "c_name": "印台区"
                    },
                    {
                        "c_code": "610204",
                        "c_name": "耀州区"
                    },
                    {
                        "c_code": "610222",
                        "c_name": "宜君县"
                    }
                ],
                "s_code": "610200"
            },
            {
                "s_name": "宝鸡市",
                "c": [{
                        "c_code": "610302",
                        "c_name": "渭滨区"
                    },
                    {
                        "c_code": "610303",
                        "c_name": "金台区"
                    },
                    {
                        "c_code": "610304",
                        "c_name": "陈仓区"
                    },
                    {
                        "c_code": "610322",
                        "c_name": "凤翔县"
                    },
                    {
                        "c_code": "610323",
                        "c_name": "岐山县"
                    },
                    {
                        "c_code": "610324",
                        "c_name": "扶风县"
                    },
                    {
                        "c_code": "610326",
                        "c_name": "眉县"
                    },
                    {
                        "c_code": "610327",
                        "c_name": "陇县"
                    },
                    {
                        "c_code": "610328",
                        "c_name": "千阳县"
                    },
                    {
                        "c_code": "610329",
                        "c_name": "麟游县"
                    },
                    {
                        "c_code": "610330",
                        "c_name": "凤县"
                    },
                    {
                        "c_code": "610331",
                        "c_name": "太白县"
                    }
                ],
                "s_code": "610300"
            },
            {
                "s_name": "咸阳市",
                "c": [{
                        "c_code": "610402",
                        "c_name": "秦都区"
                    },
                    {
                        "c_code": "610403",
                        "c_name": "杨陵区"
                    },
                    {
                        "c_code": "610404",
                        "c_name": "渭城区"
                    },
                    {
                        "c_code": "610422",
                        "c_name": "三原县"
                    },
                    {
                        "c_code": "610423",
                        "c_name": "泾阳县"
                    },
                    {
                        "c_code": "610424",
                        "c_name": "乾县"
                    },
                    {
                        "c_code": "610425",
                        "c_name": "礼泉县"
                    },
                    {
                        "c_code": "610426",
                        "c_name": "永寿县"
                    },
                    {
                        "c_code": "610427",
                        "c_name": "彬县"
                    },
                    {
                        "c_code": "610428",
                        "c_name": "长武县"
                    },
                    {
                        "c_code": "610429",
                        "c_name": "旬邑县"
                    },
                    {
                        "c_code": "610430",
                        "c_name": "淳化县"
                    },
                    {
                        "c_code": "610431",
                        "c_name": "武功县"
                    },
                    {
                        "c_code": "610481",
                        "c_name": "兴平市"
                    }
                ],
                "s_code": "610400"
            },
            {
                "s_name": "渭南市",
                "c": [{
                        "c_code": "610502",
                        "c_name": "临渭区"
                    },
                    {
                        "c_code": "610521",
                        "c_name": "华县"
                    },
                    {
                        "c_code": "610522",
                        "c_name": "潼关县"
                    },
                    {
                        "c_code": "610523",
                        "c_name": "大荔县"
                    },
                    {
                        "c_code": "610524",
                        "c_name": "合阳县"
                    },
                    {
                        "c_code": "610525",
                        "c_name": "澄城县"
                    },
                    {
                        "c_code": "610526",
                        "c_name": "蒲城县"
                    },
                    {
                        "c_code": "610527",
                        "c_name": "白水县"
                    },
                    {
                        "c_code": "610528",
                        "c_name": "富平县"
                    },
                    {
                        "c_code": "610581",
                        "c_name": "韩城市"
                    },
                    {
                        "c_code": "610582",
                        "c_name": "华阴市"
                    }
                ],
                "s_code": "610500"
            },
            {
                "s_name": "延安市",
                "c": [{
                        "c_code": "610602",
                        "c_name": "宝塔区"
                    },
                    {
                        "c_code": "610621",
                        "c_name": "延长县"
                    },
                    {
                        "c_code": "610622",
                        "c_name": "延川县"
                    },
                    {
                        "c_code": "610623",
                        "c_name": "子长县"
                    },
                    {
                        "c_code": "610624",
                        "c_name": "安塞县"
                    },
                    {
                        "c_code": "610625",
                        "c_name": "志丹县"
                    },
                    {
                        "c_code": "610626",
                        "c_name": "吴起县"
                    },
                    {
                        "c_code": "610627",
                        "c_name": "甘泉县"
                    },
                    {
                        "c_code": "610628",
                        "c_name": "富县"
                    },
                    {
                        "c_code": "610629",
                        "c_name": "洛川县"
                    },
                    {
                        "c_code": "610630",
                        "c_name": "宜川县"
                    },
                    {
                        "c_code": "610631",
                        "c_name": "黄龙县"
                    },
                    {
                        "c_code": "610632",
                        "c_name": "黄陵县"
                    }
                ],
                "s_code": "610600"
            },
            {
                "s_name": "汉中市",
                "c": [{
                        "c_code": "610702",
                        "c_name": "汉台区"
                    },
                    {
                        "c_code": "610721",
                        "c_name": "南郑县"
                    },
                    {
                        "c_code": "610722",
                        "c_name": "城固县"
                    },
                    {
                        "c_code": "610723",
                        "c_name": "洋县"
                    },
                    {
                        "c_code": "610724",
                        "c_name": "西乡县"
                    },
                    {
                        "c_code": "610725",
                        "c_name": "勉县"
                    },
                    {
                        "c_code": "610726",
                        "c_name": "宁强县"
                    },
                    {
                        "c_code": "610727",
                        "c_name": "略阳县"
                    },
                    {
                        "c_code": "610728",
                        "c_name": "镇巴县"
                    },
                    {
                        "c_code": "610729",
                        "c_name": "留坝县"
                    },
                    {
                        "c_code": "610730",
                        "c_name": "佛坪县"
                    }
                ],
                "s_code": "610700"
            },
            {
                "s_name": "榆林市",
                "c": [{
                        "c_code": "610802",
                        "c_name": "榆阳区"
                    },
                    {
                        "c_code": "610821",
                        "c_name": "神木县"
                    },
                    {
                        "c_code": "610822",
                        "c_name": "府谷县"
                    },
                    {
                        "c_code": "610823",
                        "c_name": "横山县"
                    },
                    {
                        "c_code": "610824",
                        "c_name": "靖边县"
                    },
                    {
                        "c_code": "610825",
                        "c_name": "定边县"
                    },
                    {
                        "c_code": "610826",
                        "c_name": "绥德县"
                    },
                    {
                        "c_code": "610827",
                        "c_name": "米脂县"
                    },
                    {
                        "c_code": "610828",
                        "c_name": "佳县"
                    },
                    {
                        "c_code": "610829",
                        "c_name": "吴堡县"
                    },
                    {
                        "c_code": "610830",
                        "c_name": "清涧县"
                    },
                    {
                        "c_code": "610831",
                        "c_name": "子洲县"
                    }
                ],
                "s_code": "610800"
            },
            {
                "s_name": "安康市",
                "c": [{
                        "c_code": "610902",
                        "c_name": "汉滨区"
                    },
                    {
                        "c_code": "610921",
                        "c_name": "汉阴县"
                    },
                    {
                        "c_code": "610922",
                        "c_name": "石泉县"
                    },
                    {
                        "c_code": "610923",
                        "c_name": "宁陕县"
                    },
                    {
                        "c_code": "610924",
                        "c_name": "紫阳县"
                    },
                    {
                        "c_code": "610925",
                        "c_name": "岚皋县"
                    },
                    {
                        "c_code": "610926",
                        "c_name": "平利县"
                    },
                    {
                        "c_code": "610927",
                        "c_name": "镇坪县"
                    },
                    {
                        "c_code": "610928",
                        "c_name": "旬阳县"
                    },
                    {
                        "c_code": "610929",
                        "c_name": "白河县"
                    }
                ],
                "s_code": "610900"
            },
            {
                "s_name": "商洛市",
                "c": [{
                        "c_code": "611002",
                        "c_name": "商州区"
                    },
                    {
                        "c_code": "611021",
                        "c_name": "洛南县"
                    },
                    {
                        "c_code": "611022",
                        "c_name": "丹凤县"
                    },
                    {
                        "c_code": "611023",
                        "c_name": "商南县"
                    },
                    {
                        "c_code": "611024",
                        "c_name": "山阳县"
                    },
                    {
                        "c_code": "611025",
                        "c_name": "镇安县"
                    },
                    {
                        "c_code": "611026",
                        "c_name": "柞水县"
                    }
                ],
                "s_code": "611000"
            }
        ],
        "p_code": "610000"
    },
    {
        "p_name": "甘肃省",
        "s": [{
                "s_name": "兰州市",
                "c": [{
                        "c_code": "620102",
                        "c_name": "城关区"
                    },
                    {
                        "c_code": "620103",
                        "c_name": "七里河区"
                    },
                    {
                        "c_code": "620104",
                        "c_name": "西固区"
                    },
                    {
                        "c_code": "620105",
                        "c_name": "安宁区"
                    },
                    {
                        "c_code": "620111",
                        "c_name": "红古区"
                    },
                    {
                        "c_code": "620121",
                        "c_name": "永登县"
                    },
                    {
                        "c_code": "620122",
                        "c_name": "皋兰县"
                    },
                    {
                        "c_code": "620123",
                        "c_name": "榆中县"
                    }
                ],
                "s_code": "620100"
            },
            {
                "s_name": "金昌市",
                "c": [{
                        "c_code": "620302",
                        "c_name": "金川区"
                    },
                    {
                        "c_code": "620321",
                        "c_name": "永昌县"
                    }
                ],
                "s_code": "620300"
            },
            {
                "s_name": "白银市",
                "c": [{
                        "c_code": "620402",
                        "c_name": "白银区"
                    },
                    {
                        "c_code": "620403",
                        "c_name": "平川区"
                    },
                    {
                        "c_code": "620421",
                        "c_name": "靖远县"
                    },
                    {
                        "c_code": "620422",
                        "c_name": "会宁县"
                    },
                    {
                        "c_code": "620423",
                        "c_name": "景泰县"
                    }
                ],
                "s_code": "620400"
            },
            {
                "s_name": "天水市",
                "c": [{
                        "c_code": "620502",
                        "c_name": "秦州区"
                    },
                    {
                        "c_code": "620503",
                        "c_name": "麦积区"
                    },
                    {
                        "c_code": "620521",
                        "c_name": "清水县"
                    },
                    {
                        "c_code": "620522",
                        "c_name": "秦安县"
                    },
                    {
                        "c_code": "620523",
                        "c_name": "甘谷县"
                    },
                    {
                        "c_code": "620524",
                        "c_name": "武山县"
                    },
                    {
                        "c_code": "620525",
                        "c_name": "张家川回族自治县"
                    }
                ],
                "s_code": "620500"
            },
            {
                "s_name": "武威市",
                "c": [{
                        "c_code": "620602",
                        "c_name": "凉州区"
                    },
                    {
                        "c_code": "620621",
                        "c_name": "民勤县"
                    },
                    {
                        "c_code": "620622",
                        "c_name": "古浪县"
                    },
                    {
                        "c_code": "620623",
                        "c_name": "天祝藏族自治县"
                    }
                ],
                "s_code": "620600"
            },
            {
                "s_name": "张掖市",
                "c": [{
                        "c_code": "620702",
                        "c_name": "甘州区"
                    },
                    {
                        "c_code": "620721",
                        "c_name": "肃南裕固族自治县"
                    },
                    {
                        "c_code": "620722",
                        "c_name": "民乐县"
                    },
                    {
                        "c_code": "620723",
                        "c_name": "临泽县"
                    },
                    {
                        "c_code": "620724",
                        "c_name": "高台县"
                    },
                    {
                        "c_code": "620725",
                        "c_name": "山丹县"
                    }
                ],
                "s_code": "620700"
            },
            {
                "s_name": "平凉市",
                "c": [{
                        "c_code": "620802",
                        "c_name": "崆峒区"
                    },
                    {
                        "c_code": "620821",
                        "c_name": "泾川县"
                    },
                    {
                        "c_code": "620822",
                        "c_name": "灵台县"
                    },
                    {
                        "c_code": "620823",
                        "c_name": "崇信县"
                    },
                    {
                        "c_code": "620824",
                        "c_name": "华亭县"
                    },
                    {
                        "c_code": "620825",
                        "c_name": "庄浪县"
                    },
                    {
                        "c_code": "620826",
                        "c_name": "静宁县"
                    }
                ],
                "s_code": "620800"
            },
            {
                "s_name": "酒泉市",
                "c": [{
                        "c_code": "620902",
                        "c_name": "肃州区"
                    },
                    {
                        "c_code": "620921",
                        "c_name": "金塔县"
                    },
                    {
                        "c_code": "620922",
                        "c_name": "瓜州县"
                    },
                    {
                        "c_code": "620923",
                        "c_name": "肃北蒙古族自治县"
                    },
                    {
                        "c_code": "620924",
                        "c_name": "阿克塞哈萨克族自治县"
                    },
                    {
                        "c_code": "620981",
                        "c_name": "玉门市"
                    },
                    {
                        "c_code": "620982",
                        "c_name": "敦煌市"
                    }
                ],
                "s_code": "620900"
            },
            {
                "s_name": "庆阳市",
                "c": [{
                        "c_code": "621002",
                        "c_name": "西峰区"
                    },
                    {
                        "c_code": "621021",
                        "c_name": "庆城县"
                    },
                    {
                        "c_code": "621022",
                        "c_name": "环县"
                    },
                    {
                        "c_code": "621023",
                        "c_name": "华池县"
                    },
                    {
                        "c_code": "621024",
                        "c_name": "合水县"
                    },
                    {
                        "c_code": "621025",
                        "c_name": "正宁县"
                    },
                    {
                        "c_code": "621026",
                        "c_name": "宁县"
                    },
                    {
                        "c_code": "621027",
                        "c_name": "镇原县"
                    }
                ],
                "s_code": "621000"
            },
            {
                "s_name": "定西市",
                "c": [{
                        "c_code": "621102",
                        "c_name": "安定区"
                    },
                    {
                        "c_code": "621121",
                        "c_name": "通渭县"
                    },
                    {
                        "c_code": "621122",
                        "c_name": "陇西县"
                    },
                    {
                        "c_code": "621123",
                        "c_name": "渭源县"
                    },
                    {
                        "c_code": "621124",
                        "c_name": "临洮县"
                    },
                    {
                        "c_code": "621125",
                        "c_name": "漳县"
                    },
                    {
                        "c_code": "621126",
                        "c_name": "岷县"
                    }
                ],
                "s_code": "621100"
            },
            {
                "s_name": "陇南市",
                "c": [{
                        "c_code": "621202",
                        "c_name": "武都区"
                    },
                    {
                        "c_code": "621221",
                        "c_name": "成县"
                    },
                    {
                        "c_code": "621222",
                        "c_name": "文县"
                    },
                    {
                        "c_code": "621223",
                        "c_name": "宕昌县"
                    },
                    {
                        "c_code": "621224",
                        "c_name": "康县"
                    },
                    {
                        "c_code": "621225",
                        "c_name": "西和县"
                    },
                    {
                        "c_code": "621226",
                        "c_name": "礼县"
                    },
                    {
                        "c_code": "621227",
                        "c_name": "徽县"
                    },
                    {
                        "c_code": "621228",
                        "c_name": "两当县"
                    }
                ],
                "s_code": "621200"
            },
            {
                "s_name": "临夏回族自治州",
                "c": [{
                        "c_code": "622901",
                        "c_name": "临夏市"
                    },
                    {
                        "c_code": "622921",
                        "c_name": "临夏县"
                    },
                    {
                        "c_code": "622922",
                        "c_name": "康乐县"
                    },
                    {
                        "c_code": "622923",
                        "c_name": "永靖县"
                    },
                    {
                        "c_code": "622924",
                        "c_name": "广河县"
                    },
                    {
                        "c_code": "622925",
                        "c_name": "和政县"
                    },
                    {
                        "c_code": "622926",
                        "c_name": "东乡族自治县"
                    },
                    {
                        "c_code": "622927",
                        "c_name": "积石山保安族东乡族撒拉族自治县"
                    }
                ],
                "s_code": "622900"
            },
            {
                "s_name": "甘南藏族自治州",
                "c": [{
                        "c_code": "623001",
                        "c_name": "合作市"
                    },
                    {
                        "c_code": "623021",
                        "c_name": "临潭县"
                    },
                    {
                        "c_code": "623022",
                        "c_name": "卓尼县"
                    },
                    {
                        "c_code": "623023",
                        "c_name": "舟曲县"
                    },
                    {
                        "c_code": "623024",
                        "c_name": "迭部县"
                    },
                    {
                        "c_code": "623025",
                        "c_name": "玛曲县"
                    },
                    {
                        "c_code": "623026",
                        "c_name": "碌曲县"
                    },
                    {
                        "c_code": "623027",
                        "c_name": "夏河县"
                    }
                ],
                "s_code": "623000"
            }
        ],
        "p_code": "620000"
    },
    {
        "p_name": "青海省",
        "s": [{
                "s_name": "西宁市",
                "c": [{
                        "c_code": "630102",
                        "c_name": "城东区"
                    },
                    {
                        "c_code": "630103",
                        "c_name": "城中区"
                    },
                    {
                        "c_code": "630104",
                        "c_name": "城西区"
                    },
                    {
                        "c_code": "630105",
                        "c_name": "城北区"
                    },
                    {
                        "c_code": "630121",
                        "c_name": "大通回族土族自治县"
                    },
                    {
                        "c_code": "630122",
                        "c_name": "湟中县"
                    },
                    {
                        "c_code": "630123",
                        "c_name": "湟源县"
                    }
                ],
                "s_code": "630100"
            },
            {
                "s_name": "海东地区",
                "c": [{
                        "c_code": "632121",
                        "c_name": "平安县"
                    },
                    {
                        "c_code": "632122",
                        "c_name": "民和回族土族自治县"
                    },
                    {
                        "c_code": "632123",
                        "c_name": "乐都县"
                    },
                    {
                        "c_code": "632126",
                        "c_name": "互助土族自治县"
                    },
                    {
                        "c_code": "632127",
                        "c_name": "化隆回族自治县"
                    },
                    {
                        "c_code": "632128",
                        "c_name": "循化撒拉族自治县"
                    }
                ],
                "s_code": "632100"
            },
            {
                "s_name": "海北藏族自治州",
                "c": [{
                        "c_code": "632221",
                        "c_name": "门源回族自治县"
                    },
                    {
                        "c_code": "632222",
                        "c_name": "祁连县"
                    },
                    {
                        "c_code": "632223",
                        "c_name": "海晏县"
                    },
                    {
                        "c_code": "632224",
                        "c_name": "刚察县"
                    }
                ],
                "s_code": "632200"
            },
            {
                "s_name": "黄南藏族自治州",
                "c": [{
                        "c_code": "632321",
                        "c_name": "同仁县"
                    },
                    {
                        "c_code": "632322",
                        "c_name": "尖扎县"
                    },
                    {
                        "c_code": "632323",
                        "c_name": "泽库县"
                    },
                    {
                        "c_code": "632324",
                        "c_name": "河南蒙古族自治县"
                    }
                ],
                "s_code": "632300"
            },
            {
                "s_name": "海南藏族自治州",
                "c": [{
                        "c_code": "632521",
                        "c_name": "共和县"
                    },
                    {
                        "c_code": "632522",
                        "c_name": "同德县"
                    },
                    {
                        "c_code": "632523",
                        "c_name": "贵德县"
                    },
                    {
                        "c_code": "632524",
                        "c_name": "兴海县"
                    },
                    {
                        "c_code": "632525",
                        "c_name": "贵南县"
                    }
                ],
                "s_code": "632500"
            },
            {
                "s_name": "果洛藏族自治州",
                "c": [{
                        "c_code": "632621",
                        "c_name": "玛沁县"
                    },
                    {
                        "c_code": "632622",
                        "c_name": "班玛县"
                    },
                    {
                        "c_code": "632623",
                        "c_name": "甘德县"
                    },
                    {
                        "c_code": "632624",
                        "c_name": "达日县"
                    },
                    {
                        "c_code": "632625",
                        "c_name": "久治县"
                    },
                    {
                        "c_code": "632626",
                        "c_name": "玛多县"
                    }
                ],
                "s_code": "632600"
            },
            {
                "s_name": "玉树藏族自治州",
                "c": [{
                        "c_code": "632721",
                        "c_name": "玉树县"
                    },
                    {
                        "c_code": "632722",
                        "c_name": "杂多县"
                    },
                    {
                        "c_code": "632723",
                        "c_name": "称多县"
                    },
                    {
                        "c_code": "632724",
                        "c_name": "治多县"
                    },
                    {
                        "c_code": "632725",
                        "c_name": "囊谦县"
                    },
                    {
                        "c_code": "632726",
                        "c_name": "曲麻莱县"
                    }
                ],
                "s_code": "632700"
            },
            {
                "s_name": "海西蒙古族藏族自治州",
                "c": [{
                        "c_code": "632801",
                        "c_name": "格尔木市"
                    },
                    {
                        "c_code": "632802",
                        "c_name": "德令哈市"
                    },
                    {
                        "c_code": "632821",
                        "c_name": "乌兰县"
                    },
                    {
                        "c_code": "632822",
                        "c_name": "都兰县"
                    },
                    {
                        "c_code": "632823",
                        "c_name": "天峻县"
                    }
                ],
                "s_code": "632800"
            }
        ],
        "p_code": "630000"
    },
    {
        "p_name": "宁夏回族自治区",
        "s": [{
                "s_name": "银川市",
                "c": [{
                        "c_code": "640104",
                        "c_name": "兴庆区"
                    },
                    {
                        "c_code": "640105",
                        "c_name": "西夏区"
                    },
                    {
                        "c_code": "640106",
                        "c_name": "金凤区"
                    },
                    {
                        "c_code": "640121",
                        "c_name": "永宁县"
                    },
                    {
                        "c_code": "640122",
                        "c_name": "贺兰县"
                    },
                    {
                        "c_code": "640181",
                        "c_name": "灵武市"
                    }
                ],
                "s_code": "640100"
            },
            {
                "s_name": "石嘴山市",
                "c": [{
                        "c_code": "640202",
                        "c_name": "大武口区"
                    },
                    {
                        "c_code": "640205",
                        "c_name": "惠农区"
                    },
                    {
                        "c_code": "640221",
                        "c_name": "平罗县"
                    }
                ],
                "s_code": "640200"
            },
            {
                "s_name": "吴忠市",
                "c": [{
                        "c_code": "640302",
                        "c_name": "利通区"
                    },
                    {
                        "c_code": "640303",
                        "c_name": "红寺堡区"
                    },
                    {
                        "c_code": "640323",
                        "c_name": "盐池县"
                    },
                    {
                        "c_code": "640324",
                        "c_name": "同心县"
                    },
                    {
                        "c_code": "640381",
                        "c_name": "青铜峡市"
                    }
                ],
                "s_code": "640300"
            },
            {
                "s_name": "固原市",
                "c": [{
                        "c_code": "640402",
                        "c_name": "原州区"
                    },
                    {
                        "c_code": "640422",
                        "c_name": "西吉县"
                    },
                    {
                        "c_code": "640423",
                        "c_name": "隆德县"
                    },
                    {
                        "c_code": "640424",
                        "c_name": "泾源县"
                    },
                    {
                        "c_code": "640425",
                        "c_name": "彭阳县"
                    }
                ],
                "s_code": "640400"
            },
            {
                "s_name": "中卫市",
                "c": [{
                        "c_code": "640502",
                        "c_name": "沙坡头区"
                    },
                    {
                        "c_code": "640521",
                        "c_name": "中宁县"
                    },
                    {
                        "c_code": "640522",
                        "c_name": "海原县"
                    }
                ],
                "s_code": "640500"
            }
        ],
        "p_code": "640000"
    },
    {
        "p_name": "新疆维吾尔自治区",
        "s": [{
                "s_name": "乌鲁木齐市",
                "c": [{
                        "c_code": "650102",
                        "c_name": "天山区"
                    },
                    {
                        "c_code": "650103",
                        "c_name": "沙依巴克区"
                    },
                    {
                        "c_code": "650104",
                        "c_name": "新市区"
                    },
                    {
                        "c_code": "650105",
                        "c_name": "水磨沟区"
                    },
                    {
                        "c_code": "650106",
                        "c_name": "头屯河区"
                    },
                    {
                        "c_code": "650107",
                        "c_name": "达坂城区"
                    },
                    {
                        "c_code": "650109",
                        "c_name": "米东区"
                    },
                    {
                        "c_code": "650121",
                        "c_name": "乌鲁木齐县"
                    }
                ],
                "s_code": "650100"
            },
            {
                "s_name": "克拉玛依市",
                "c": [{
                        "c_code": "650202",
                        "c_name": "独山子区"
                    },
                    {
                        "c_code": "650203",
                        "c_name": "克拉玛依区"
                    },
                    {
                        "c_code": "650204",
                        "c_name": "白碱滩区"
                    },
                    {
                        "c_code": "650205",
                        "c_name": "乌尔禾区"
                    }
                ],
                "s_code": "650200"
            },
            {
                "s_name": "吐鲁番地区",
                "c": [{
                        "c_code": "652101",
                        "c_name": "吐鲁番市"
                    },
                    {
                        "c_code": "652122",
                        "c_name": "鄯善县"
                    },
                    {
                        "c_code": "652123",
                        "c_name": "托克逊县"
                    }
                ],
                "s_code": "652100"
            },
            {
                "s_name": "哈密地区",
                "c": [{
                        "c_code": "652201",
                        "c_name": "哈密市"
                    },
                    {
                        "c_code": "652222",
                        "c_name": "巴里坤哈萨克自治县"
                    },
                    {
                        "c_code": "652223",
                        "c_name": "伊吾县"
                    }
                ],
                "s_code": "652200"
            },
            {
                "s_name": "昌吉回族自治州",
                "c": [{
                        "c_code": "652301",
                        "c_name": "昌吉市"
                    },
                    {
                        "c_code": "652302",
                        "c_name": "阜康市"
                    },
                    {
                        "c_code": "652323",
                        "c_name": "呼图壁县"
                    },
                    {
                        "c_code": "652324",
                        "c_name": "玛纳斯县"
                    },
                    {
                        "c_code": "652325",
                        "c_name": "奇台县"
                    },
                    {
                        "c_code": "652327",
                        "c_name": "吉木萨尔县"
                    },
                    {
                        "c_code": "652328",
                        "c_name": "木垒哈萨克自治县"
                    }
                ],
                "s_code": "652300"
            },
            {
                "s_name": "博尔塔拉蒙古自治州",
                "c": [{
                        "c_code": "652701",
                        "c_name": "博乐市"
                    },
                    {
                        "c_code": "652722",
                        "c_name": "精河县"
                    },
                    {
                        "c_code": "652723",
                        "c_name": "温泉县"
                    }
                ],
                "s_code": "652700"
            },
            {
                "s_name": "巴音郭楞蒙古自治州",
                "c": [{
                        "c_code": "652801",
                        "c_name": "库尔勒市"
                    },
                    {
                        "c_code": "652822",
                        "c_name": "轮台县"
                    },
                    {
                        "c_code": "652823",
                        "c_name": "尉犁县"
                    },
                    {
                        "c_code": "652824",
                        "c_name": "若羌县"
                    },
                    {
                        "c_code": "652825",
                        "c_name": "且末县"
                    },
                    {
                        "c_code": "652826",
                        "c_name": "焉耆回族自治县"
                    },
                    {
                        "c_code": "652827",
                        "c_name": "和静县"
                    },
                    {
                        "c_code": "652828",
                        "c_name": "和硕县"
                    },
                    {
                        "c_code": "652829",
                        "c_name": "博湖县"
                    }
                ],
                "s_code": "652800"
            },
            {
                "s_name": "阿克苏地区",
                "c": [{
                        "c_code": "652901",
                        "c_name": "阿克苏市"
                    },
                    {
                        "c_code": "652922",
                        "c_name": "温宿县"
                    },
                    {
                        "c_code": "652923",
                        "c_name": "库车县"
                    },
                    {
                        "c_code": "652924",
                        "c_name": "沙雅县"
                    },
                    {
                        "c_code": "652925",
                        "c_name": "新和县"
                    },
                    {
                        "c_code": "652926",
                        "c_name": "拜城县"
                    },
                    {
                        "c_code": "652927",
                        "c_name": "乌什县"
                    },
                    {
                        "c_code": "652928",
                        "c_name": "阿瓦提县"
                    },
                    {
                        "c_code": "652929",
                        "c_name": "柯坪县"
                    }
                ],
                "s_code": "652900"
            },
            {
                "s_name": "克孜勒苏柯尔克孜自治州",
                "c": [{
                        "c_code": "653001",
                        "c_name": "阿图什市"
                    },
                    {
                        "c_code": "653022",
                        "c_name": "阿克陶县"
                    },
                    {
                        "c_code": "653023",
                        "c_name": "阿合奇县"
                    },
                    {
                        "c_code": "653024",
                        "c_name": "乌恰县"
                    }
                ],
                "s_code": "653000"
            },
            {
                "s_name": "喀什地区",
                "c": [{
                        "c_code": "653101",
                        "c_name": "喀什市"
                    },
                    {
                        "c_code": "653121",
                        "c_name": "疏附县"
                    },
                    {
                        "c_code": "653122",
                        "c_name": "疏勒县"
                    },
                    {
                        "c_code": "653123",
                        "c_name": "英吉沙县"
                    },
                    {
                        "c_code": "653124",
                        "c_name": "泽普县"
                    },
                    {
                        "c_code": "653125",
                        "c_name": "莎车县"
                    },
                    {
                        "c_code": "653126",
                        "c_name": "叶城县"
                    },
                    {
                        "c_code": "653127",
                        "c_name": "麦盖提县"
                    },
                    {
                        "c_code": "653128",
                        "c_name": "岳普湖县"
                    },
                    {
                        "c_code": "653129",
                        "c_name": "伽师县"
                    },
                    {
                        "c_code": "653130",
                        "c_name": "巴楚县"
                    },
                    {
                        "c_code": "653131",
                        "c_name": "塔什库尔干塔吉克自治县"
                    }
                ],
                "s_code": "653100"
            },
            {
                "s_name": "和田地区",
                "c": [{
                        "c_code": "653201",
                        "c_name": "和田市"
                    },
                    {
                        "c_code": "653221",
                        "c_name": "和田县"
                    },
                    {
                        "c_code": "653222",
                        "c_name": "墨玉县"
                    },
                    {
                        "c_code": "653223",
                        "c_name": "皮山县"
                    },
                    {
                        "c_code": "653224",
                        "c_name": "洛浦县"
                    },
                    {
                        "c_code": "653225",
                        "c_name": "策勒县"
                    },
                    {
                        "c_code": "653226",
                        "c_name": "于田县"
                    },
                    {
                        "c_code": "653227",
                        "c_name": "民丰县"
                    }
                ],
                "s_code": "653200"
            },
            {
                "s_name": "伊犁哈萨克自治州",
                "c": [{
                        "c_code": "654002",
                        "c_name": "伊宁市"
                    },
                    {
                        "c_code": "654003",
                        "c_name": "奎屯市"
                    },
                    {
                        "c_code": "654021",
                        "c_name": "伊宁县"
                    },
                    {
                        "c_code": "654022",
                        "c_name": "察布查尔锡伯自治县"
                    },
                    {
                        "c_code": "654023",
                        "c_name": "霍城县"
                    },
                    {
                        "c_code": "654024",
                        "c_name": "巩留县"
                    },
                    {
                        "c_code": "654025",
                        "c_name": "新源县"
                    },
                    {
                        "c_code": "654026",
                        "c_name": "昭苏县"
                    },
                    {
                        "c_code": "654027",
                        "c_name": "特克斯县"
                    },
                    {
                        "c_code": "654028",
                        "c_name": "尼勒克县"
                    }
                ],
                "s_code": "654000"
            },
            {
                "s_name": "塔城地区",
                "c": [{
                        "c_code": "654201",
                        "c_name": "塔城市"
                    },
                    {
                        "c_code": "654202",
                        "c_name": "乌苏市"
                    },
                    {
                        "c_code": "654221",
                        "c_name": "额敏县"
                    },
                    {
                        "c_code": "654223",
                        "c_name": "沙湾县"
                    },
                    {
                        "c_code": "654224",
                        "c_name": "托里县"
                    },
                    {
                        "c_code": "654225",
                        "c_name": "裕民县"
                    },
                    {
                        "c_code": "654226",
                        "c_name": "和布克赛尔蒙古自治县"
                    }
                ],
                "s_code": "654200"
            },
            {
                "s_name": "阿勒泰地区",
                "c": [{
                        "c_code": "654301",
                        "c_name": "阿勒泰市"
                    },
                    {
                        "c_code": "654321",
                        "c_name": "布尔津县"
                    },
                    {
                        "c_code": "654322",
                        "c_name": "富蕴县"
                    },
                    {
                        "c_code": "654323",
                        "c_name": "福海县"
                    },
                    {
                        "c_code": "654324",
                        "c_name": "哈巴河县"
                    },
                    {
                        "c_code": "654325",
                        "c_name": "青河县"
                    },
                    {
                        "c_code": "654326",
                        "c_name": "吉木乃县"
                    }
                ],
                "s_code": "654300"
            }
        ],
        "p_code": "650000"
    }
];
module.exports = {
    citylist: citylist
}